#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: A2_LightFlower_L110035_p3

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HTGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass A2_LightFlower_L110035_p3.A2_LightFlower_L110035_p3_C
// 0x0050 (0x0CE0 - 0x0C90)
class AA2_LightFlower_L110035_p3_C final : public AHTBreakableActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0C90(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USkeletalMeshComponent*                 SM_Lanternflower_ZYF_skin;                         // 0x0C98(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         light_NewTrack_0_F842DE9943CA00BD623ABC97568FFFFA; // 0x0CA0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            light__Direction_F842DE9943CA00BD623ABC97568FFFFA; // 0x0CA4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CA5[0x3];                                      // 0x0CA5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Light;                                             // 0x0CA8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_NewTrack_0_5865B9A641BCCE6828AA68B7287B35FB; // 0x0CB0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline__Direction_5865B9A641BCCE6828AA68B7287B35FB; // 0x0CB4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CB5[0x3];                                      // 0x0CB5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline;                                          // 0x0CB8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AA2_Vines_L110035_p3_C*                 Vines;                                             // 0x0CC0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	double                                        Return_Value_Location_Z;                           // 0x0CC8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Spawned_Comp;                                      // 0x0CD0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AA2_LightFlower_L110035_p3_C*           BB;                                                // 0x0CD8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)

public:
	void BAO();
	void BPOnMainRoleLoadFinished(class AHTPlayerState* PlayerState);
	void Darker();
	void ExecuteUbergraph_A2_LightFlower_L110035_p3(int32 EntryPoint);
	void Falltest();
	void light__FinishedFunc();
	void light__UpdateFunc();
	void LightFlower();
	void OnEmitterSpawned_4A220DAB469436EF4455C0870852810F(class UNiagaraComponent* SpawnedComp);
	void ReceiveOnTakeDamage(class AActor* DamageCauser, const struct FHitResult& HitResult, bool bRealDamaged);
	void Timeline__FinishedFunc();
	void Timeline__UpdateFunc();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("A2_LightFlower_L110035_p3_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"A2_LightFlower_L110035_p3_C")
	}
	static class AA2_LightFlower_L110035_p3_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AA2_LightFlower_L110035_p3_C>();
	}
};
DUMPER7_ASSERTS_AA2_LightFlower_L110035_p3_C;

}

