#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_mon_016_Shake

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_mon_016_Shake.ABP_mon_016_Shake_C
// 0x0CF0 (0x10E0 - 0x03F0)
class UABP_mon_016_Shake_C final : public UAnimInstance
{
public:
	uint8                                         Pad_3E8[0x8];                                      // 0x03E8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x03F8(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0400(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x0408(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x0428(0x00B8)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x04E0(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0500(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_9;                        // 0x0520(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_8;                        // 0x0648(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_7;                        // 0x0770(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_6;                        // 0x0898(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_5;                        // 0x09C0(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_4;                        // 0x0AE8(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_3;                        // 0x0C10(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_2;                        // 0x0D38(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x0E60(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x0F88(0x0128)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x10B0(0x0020)()
	double                                        BlendAlpha;                                        // 0x10D0(0x0008)(BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        PushScale;                                         // 0x10D8(0x0008)(BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_mon_016_Shake_AnimGraphNode_ModifyBone_017EDE3C4BEE3157CA5BA8BD6B910959();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_mon_016_Shake_AnimGraphNode_ModifyBone_3D708CF64C9327D84B81579D29912A2F();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_mon_016_Shake_AnimGraphNode_ModifyBone_408A675A4A8F04E83811918B7D9B62B0();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_mon_016_Shake_AnimGraphNode_ModifyBone_5727ED61476072CB8AF2988857888E7F();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_mon_016_Shake_AnimGraphNode_ModifyBone_5811478740BF7534EA6A2FB664D709FB();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_mon_016_Shake_AnimGraphNode_ModifyBone_80063CC141EB579308C4698894EFBC6E();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_mon_016_Shake_AnimGraphNode_ModifyBone_BE220A3241189505D7414788F9F5F421();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_mon_016_Shake_AnimGraphNode_ModifyBone_C1F1C8B44CF71000130F5C91B720CA2F();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_mon_016_Shake_AnimGraphNode_ModifyBone_C8F3C89E4E452C1AF991BF8802B9542D();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_mon_016_Shake_AnimGraphNode_ModifyBone_E5D8E5EC400B3DD46D194FA70DC62864();
	void ExecuteUbergraph_ABP_mon_016_Shake(int32 EntryPoint);
	void ShakeBoneLayer(const struct FPoseLink& InPose, double PushScale_0, double BlendAlpha_0, struct FPoseLink* ShakeBoneLayer_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ABP_mon_016_Shake_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ABP_mon_016_Shake_C")
	}
	static class UABP_mon_016_Shake_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_mon_016_Shake_C>();
	}
};
DUMPER7_ASSERTS_UABP_mon_016_Shake_C;

}

