#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_MassCrowdAnimSharingTransitionInstance

#include "Basic.hpp"

#include "ABP_MassCrowdAnimSharingTransitionInstance_structs.hpp"
#include "AnimationSharing_classes.hpp"
#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_MassCrowdAnimSharingTransitionInstance.ABP_MassCrowdAnimSharingTransitionInstance_C
// 0x0350 (0x0750 - 0x0400)
class UABP_MassCrowdAnimSharingTransitionInstance_C final : public UAnimSharingTransitionInstance
{
public:
	struct ABP_MassCrowdAnimSharingTransitionInstance::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables; // 0x0400(0x0020)(HasGetValueTypeHash)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0420(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0428(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0430(0x0020)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh_1;                  // 0x0450(0x0158)(ContainsInstancedReference)
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x05A8(0x0050)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh;                    // 0x05F8(0x0158)(ContainsInstancedReference)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ABP_MassCrowdAnimSharingTransitionInstance_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ABP_MassCrowdAnimSharingTransitionInstance_C")
	}
	static class UABP_MassCrowdAnimSharingTransitionInstance_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_MassCrowdAnimSharingTransitionInstance_C>();
	}
};
DUMPER7_ASSERTS_UABP_MassCrowdAnimSharingTransitionInstance_C;

}

