#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_mon_019_Shake

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_mon_019_Shake.ABP_mon_019_Shake_C
// 0x0CF0 (0x10E0 - 0x03F0)
class UABP_mon_019_Shake_C final : public UAnimInstance
{
public:
	uint8                                         Pad_3E8[0x8];                                      // 0x03E8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x03F8(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0400(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x0408(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x0428(0x00B8)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x04E0(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0500(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_9;                        // 0x0520(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_8;                        // 0x0648(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_7;                        // 0x0770(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_6;                        // 0x0898(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_5;                        // 0x09C0(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_4;                        // 0x0AE8(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_3;                        // 0x0C10(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_2;                        // 0x0D38(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x0E60(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x0F88(0x0128)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x10B0(0x0020)()
	double                                        BlendAlpha;                                        // 0x10D0(0x0008)(BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        PushScale;                                         // 0x10D8(0x0008)(BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_mon_019_Shake_AnimGraphNode_ModifyBone_1AF1583441DC1C8A5166EC94A2B042A5();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_mon_019_Shake_AnimGraphNode_ModifyBone_1FC04778451783D4704C869B463F77DB();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_mon_019_Shake_AnimGraphNode_ModifyBone_2CEA999B4D78C2FEC304C38531D3D81D();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_mon_019_Shake_AnimGraphNode_ModifyBone_4458176B48B809FA2EEF51965F2C4E59();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_mon_019_Shake_AnimGraphNode_ModifyBone_456FD5404464B38F0DA14BB2AC73F339();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_mon_019_Shake_AnimGraphNode_ModifyBone_4CDEA997457D80CC47AFCD9E893506A3();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_mon_019_Shake_AnimGraphNode_ModifyBone_5FC49EB24A97B36ABCC99699D6DBA618();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_mon_019_Shake_AnimGraphNode_ModifyBone_A220064D452451DD7C0E638734035389();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_mon_019_Shake_AnimGraphNode_ModifyBone_CDD749354A1F697A2E5D9D90B2AAB044();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_mon_019_Shake_AnimGraphNode_ModifyBone_F08FE6D5437D6B81BCB3D9944DEADB11();
	void ExecuteUbergraph_ABP_mon_019_Shake(int32 EntryPoint);
	void ShakeBoneLayer(const struct FPoseLink& InPose, double PushScale_0, double BlendAlpha_0, struct FPoseLink* ShakeBoneLayer_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ABP_mon_019_Shake_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ABP_mon_019_Shake_C")
	}
	static class UABP_mon_019_Shake_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_mon_019_Shake_C>();
	}
};
DUMPER7_ASSERTS_UABP_mon_019_Shake_C;

}

