#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ActorReaction_1_Manager

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HTGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass ActorReaction_1_Manager.ActorReaction_1_Manager_C
// 0x0050 (0x0720 - 0x06D0)
class AActorReaction_1_Manager_C final : public ACosmosNatureProjectileManager
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCosmosNatureProjectilePlacedComp*      CosmosNatureProjectilePlacedComp4;                 // 0x06D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCosmosNatureProjectilePlacedComp*      CosmosNatureProjectilePlacedComp3;                 // 0x06E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCosmosNatureProjectilePlacedComp*      CosmosNatureProjectilePlacedComp2;                 // 0x06E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCosmosNatureProjectilePlacedComp*      CosmosNatureProjectilePlacedComp1;                 // 0x06F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCosmosNatureProjectilePlacedComp*      CosmosNatureProjectilePlacedComp;                  // 0x06F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box;                                               // 0x0700(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0708(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Target;                                            // 0x0710(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnDestroyCountDown(float CurveValue);
	void ExecuteUbergraph_ActorReaction_1_Manager(int32 EntryPoint);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ActorReaction_1_Manager_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ActorReaction_1_Manager_C")
	}
	static class AActorReaction_1_Manager_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AActorReaction_1_Manager_C>();
	}
};
DUMPER7_ASSERTS_AActorReaction_1_Manager_C;

}

