#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: boss18_act19_5

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "HTGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass boss18_act19_5.boss18_act19_5_C
// 0x0038 (0x04C8 - 0x0490)
class Aboss18_act19_5_C final : public AHTAbilitySpawnActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0490(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHTNiagaraComponent*                    HTNiagara;                                         // 0x0498(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHTAbilityFuncExtensionComponent*       HTAbilityFuncExtension;                            // 0x04A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x04A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                New_Var;                                           // 0x04B0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_boss18_act19_5(int32 EntryPoint);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("boss18_act19_5_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"boss18_act19_5_C")
	}
	static class Aboss18_act19_5_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<Aboss18_act19_5_C>();
	}
};
DUMPER7_ASSERTS_Aboss18_act19_5_C;

}

