#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Anomaly_024_Dan_True_Goal

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_Anomaly_024_Dan_True_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Anomaly_024_Dan_True_Goal.BP_Anomaly_024_Dan_True_Goal_C
// 0x0030 (0x3370 - 0x3340)
class ABP_Anomaly_024_Dan_True_Goal_C final : public ABP_Anomaly_024_Dan_True_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Anomaly_024_Dan_True_Goal_C;     // 0x3338(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      ExplodeNiagara;                                    // 0x3340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ABP_DanVisionManager_Base_C*            RelatedVisionManager;                              // 0x3348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bSpecialEnd_;                                      // 0x3350(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFXPlaying_;                                       // 0x3351(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3352[0x6];                                     // 0x3352(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TSoftClassPtr<class UClass>>           DefaultIdleState;                                  // 0x3358(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UAnimMontage*                           Anim;                                              // 0x3368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__BP_Anomaly_024_Dan_True_Goal_HTDialogue_K2Node_ComponentBoundEvent_1_OnDialogueBeginEndDelegate__DelegateSignature(class AHTPlayerCharacter* InPlayer);
	void BndEvt__BP_NPC_004_Dan_True_HTDialogue_K2Node_ComponentBoundEvent_0_OnDialogueEventDelegate__DelegateSignature(class FName InParticipant, class FName InEventName);
	void BndEvt__BP_NPC_004_Dan_True_HTDialogue_K2Node_ComponentBoundEvent_2_OnDialogueBeginEndDelegate__DelegateSignature(class AHTPlayerCharacter* InPlayer);
	void Cus_HideFX();
	void ExecuteUbergraph_BP_Anomaly_024_Dan_True_Goal(int32 EntryPoint);
	void OnLoaded_2A568FD5475733F71F0FB69B69092DD1(class UObject* Loaded);
	void OnLoaded_8A74DAE149F96A04E02F4BB5FE0A794C(class UObject* Loaded);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Anomaly_024_Dan_True_Goal_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Anomaly_024_Dan_True_Goal_C")
	}
	static class ABP_Anomaly_024_Dan_True_Goal_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Anomaly_024_Dan_True_Goal_C>();
	}
};
DUMPER7_ASSERTS_ABP_Anomaly_024_Dan_True_Goal_C;

}

