#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Anomaly_024_Dan_True

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Anomaly_024_Dan_True.BP_Anomaly_024_Dan_True_C.Cus_OnFightStateChanged
// 0x0001 (0x0001 - 0x0000)
struct BP_Anomaly_024_Dan_True_C_Cus_OnFightStateChanged final
{
public:
	bool                                          bInFight;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Anomaly_024_Dan_True_C_Cus_OnFightStateChanged;

// Function BP_Anomaly_024_Dan_True.BP_Anomaly_024_Dan_True_C.ExecuteUbergraph_BP_Anomaly_024_Dan_True
// 0x0028 (0x0028 - 0x0000)
struct BP_Anomaly_024_Dan_True_C_ExecuteUbergraph_BP_Anomaly_024_Dan_True final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bInFight)>                K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AHTPlayerState*                         CallFunc_GetClientPlayerState_ReturnValue;         // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bInFight;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Anomaly_024_Dan_True_C_ExecuteUbergraph_BP_Anomaly_024_Dan_True;

}

