#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Anomaly_050_K111101

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_Anomaly_050_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Anomaly_050_K111101.BP_Anomaly_050_K111101_C
// 0x0020 (0x31C0 - 0x31A0)
class ABP_Anomaly_050_K111101_C final : public ABP_Anomaly_050_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Anomaly_050_K111101_C;           // 0x3198(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      NS_NPC_MissFei_Coffee;                             // 0x31A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         _________0_5C90CC364315CD51D53F60A3801C79F7;       // 0x31A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            _____Direction_5C90CC364315CD51D53F60A3801C79F7;   // 0x31AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31AD[0x3];                                     // 0x31AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     时间轴; // 0x31B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void Coffee_Time();
	void ExecuteUbergraph_BP_Anomaly_050_K111101(int32 EntryPoint);
	void ReceiveBeginPlay();
	void 时间轴__FinishedFunc();
	void 时间轴__UpdateFunc();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Anomaly_050_K111101_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Anomaly_050_K111101_C")
	}
	static class ABP_Anomaly_050_K111101_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Anomaly_050_K111101_C>();
	}
};
DUMPER7_ASSERTS_ABP_Anomaly_050_K111101_C;

}

