#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AnomalyDoor_OutsideManager

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HTGame_structs.hpp"
#include "HTGame_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AnomalyDoor_OutsideManager.BP_AnomalyDoor_OutsideManager_C
// 0x0338 (0x0EB8 - 0x0B80)
class ABP_AnomalyDoor_OutsideManager_C final : public AHTVisualActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B80(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          UnderGroundBox;                                    // 0x0B88(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box;                                               // 0x0B90(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                    Billboard;                                         // 0x0B98(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_3_Light_F90A54954A929C51F7DBEDA066002332; // 0x0BA0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_3__Direction_F90A54954A929C51F7DBEDA066002332; // 0x0BA4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BA5[0x3];                                      // 0x0BA5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_3;                                        // 0x0BA8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_2_Light_FF88701048E6DABCDDADDEADF281D2F6; // 0x0BB0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_2__Direction_FF88701048E6DABCDDADDEADF281D2F6; // 0x0BB4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BB5[0x3];                                      // 0x0BB5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_2;                                        // 0x0BB8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_1_Rate_881F6C714F66224A58A6DFB3184EC0DB;  // 0x0BC0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_1__Direction_881F6C714F66224A58A6DFB3184EC0DB; // 0x0BC4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC5[0x3];                                      // 0x0BC5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_1;                                        // 0x0BC8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_Rate_F3974A2E4B881E4BFA115488BF467B9E;  // 0x0BD0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_F3974A2E4B881E4BFA115488BF467B9E; // 0x0BD4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BD5[0x3];                                      // 0x0BD5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x0BD8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_Rate_FE6A7C0B4FE5DF258514C293AE68D0F2;    // 0x0BE0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline__Direction_FE6A7C0B4FE5DF258514C293AE68D0F2; // 0x0BE4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BE5[0x3];                                      // 0x0BE5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline;                                          // 0x0BE8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FString                                 VisionID;                                          // 0x0BF0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class ABP_PVAnomalyDoor_Portal_C*             ToInnerDoor;                                       // 0x0C00(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         HiddenList;                                        // 0x0C08(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	class AHTMassCrowdHideAndAvoidVolume*         HTMassAvoidVolume;                                 // 0x0C18(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class ABP_TriggerSequencePlayer_C*            FinalOutsideTrigger;                               // 0x0C20(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class AHTAISpawnManager*                      AISpawnManager;                                    // 0x0C28(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class AEnvironmentChangeVolumeHT*             EnvironmentVolume;                                 // 0x0C30(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	TArray<TSoftObjectPtr<class ABP_MoveActor_C>> Stairs;                                            // 0x0C38(0x0010)(Edit, BlueprintVisible)
	int32                                         Counter;                                           // 0x0C48(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4C[0x4];                                      // 0x0C4C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class ASpotLight>              SpotLightWhite;                                    // 0x0C50(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class ASpotLight>              SpotLightBlue;                                     // 0x0C78(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class APointLight>             SpotLightRed;                                      // 0x0CA0(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	class UDataLayerAsset*                        LayerToLoad;                                       // 0x0CC8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<TSoftObjectPtr<class ABP_AnalyticFog_C>> FogsSurround;                                    // 0x0CD0(0x0010)(Edit, BlueprintVisible)
	TSoftObjectPtr<class UAkAudioEvent>           AkEvent;                                           // 0x0CE0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class UAkComponent*                           AkComp;                                            // 0x0D08(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ABP_AnomalyDoor_PKMInteract_C*          AnomalyDoorPKM;                                    // 0x0D10(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               PostMat;                                           // 0x0D18(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ABP_ChangeActorStencil_C*               ChangeStencilActor;                                // 0x0D20(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	TArray<class UDataLayerAsset*>                LaterLayerToLoad;                                  // 0x0D28(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class AHTVisionAreaVolume*                    VisionTriggerVolume;                               // 0x0D38(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UAkAudioEvent>           StopAkEvent;                                       // 0x0D40(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class ABP_TriggerSequencePlayer_C*            FirstTrigger;                                      // 0x0D68(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class AHTAreaMusicVolume>      MusicVolume;                                       // 0x0D70(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class AHTAreaMusicVolume>      MusicVolumeBridge;                                 // 0x0D98(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class AHTAreaMusicVolume>      MusicVolumeEmpty;                                  // 0x0DC0(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	class ABP_SellerSank_C*                       VendingSank;                                       // 0x0DE8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class FText                                   InsideTalk;                                        // 0x0DF0(0x0010)(Edit, BlueprintVisible)
	TSoftObjectPtr<class AHTMapInterferAreaVolume> MapInterfere1;                                    // 0x0E00(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class AHTMapInterferAreaVolume> MapInterfere2;                                    // 0x0E28(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	bool                                          AllDead;                                           // 0x0E50(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E51[0x3];                                      // 0x0E51(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   LoadYahahaID;                                      // 0x0E54(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Yahaha_Id;                                         // 0x0E5C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E64[0x4];                                      // 0x0E64(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AHTVisualActor*>                 VendingList;                                       // 0x0E68(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	class AHTAISpawnManager*                      AmbMon;                                            // 0x0E78(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	bool                                          IsInside_;                                         // 0x0E80(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E81[0x3];                                      // 0x0E81(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   YahahaKillState;                                   // 0x0E84(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E8C[0x4];                                      // 0x0E8C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class ABP_AnomalyDoorSeqManager_KillMonster_C> LastKillManager;                   // 0x0E90(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)

public:
	void AnomalyDoorFinished();
	void BndEvt__BP_AnomalyDoor_OutsideManager_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void BndEvt__BP_AnomalyDoor_OutsideManager_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void BndEvt__BP_AnomalyDoor_OutsideManager_UnderGroundBox_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void BndEvt__BP_AnomalyDoor_OutsideManager_UnderGroundBox_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void BPOnMainRoleLoadFinished(class AHTPlayerState* PlayerState);
	void DestroyMapInterfere();
	void EndStopEventGroup();
	void ExecuteUbergraph_BP_AnomalyDoor_OutsideManager(int32 EntryPoint);
	void FinishAnomaly(class ABP_CloseDoor_C* CloseDoor);
	void FogDis();
	void MonsterWake();
	void OnLoaded_3915B2B1408CD10A2B560CAE4C76422D(class UObject* Loaded);
	void OnLoaded_6FEF92D749039FC1017A22A7E6902AE8(class UObject* Loaded);
	void OnLoaded_8796CCED455218384A0C55B0BE6D8283(class UObject* Loaded);
	void OnLoaded_8C6FC60D4DF155EBF71E97920A95F402(class UObject* Loaded);
	void OnLoaded_9BD59A674E8C8A824D67E697F621BEBA(class UObject* Loaded);
	void OnLoaded_A1B005FB425A49C0AB72E48C3D8011BD(class UObject* Loaded);
	void OnLoaded_A652A17A42031E09A2DBA9A41FD0163F(class UObject* Loaded);
	void OnLoaded_AEDE0DFC4C3EAA658D2F02A7B116B64A(class UObject* Loaded);
	void OnLoaded_C024B1454E29520B7638D0B43C5D56D6(class UObject* Loaded);
	void OnLoaded_E2137DD44B9A6C2B2776C88CB6F8FA24(class UObject* Loaded);
	void OutsideAllDead(class AHTAISpawnManager* SpawnMgr, class AHTCharacter* OwnerPlayer);
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void SetDoor45(class ABP_PVAnomalyDoor_Portal_C* Portal);
	void ShowPost();
	void StopMusic();
	void Timeline_0__FinishedFunc();
	void Timeline_0__UpdateFunc();
	void Timeline_1__FinishedFunc();
	void Timeline_1__UpdateFunc();
	void Timeline_2__FinishedFunc();
	void Timeline_2__UpdateFunc();
	void Timeline_3__FinishedFunc();
	void Timeline_3__UpdateFunc();
	void Timeline__FinishedFunc();
	void Timeline__UpdateFunc();
	void TriggerPlay_Event();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_AnomalyDoor_OutsideManager_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_AnomalyDoor_OutsideManager_C")
	}
	static class ABP_AnomalyDoor_OutsideManager_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_AnomalyDoor_OutsideManager_C>();
	}
};
DUMPER7_ASSERTS_ABP_AnomalyDoor_OutsideManager_C;

}

