#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Bp_boss_01_Shake

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Bp_boss_01_Shake.Bp_boss_01_Shake_C
// 0x1070 (0x1460 - 0x03F0)
class UBp_boss_01_Shake_C final : public UAnimInstance
{
public:
	uint8                                         Pad_3E8[0x8];                                      // 0x03E8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x03F8(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0400(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x0408(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x0428(0x00B8)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x04E0(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0500(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_12;                       // 0x0520(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_11;                       // 0x0648(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_10;                       // 0x0770(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_9;                        // 0x0898(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_8;                        // 0x09C0(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_7;                        // 0x0AE8(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_6;                        // 0x0C10(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_5;                        // 0x0D38(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_4;                        // 0x0E60(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_3;                        // 0x0F88(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_2;                        // 0x10B0(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x11D8(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x1300(0x0128)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x1428(0x0020)()
	double                                        BlendAlpha;                                        // 0x1448(0x0008)(BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        PushScale;                                         // 0x1450(0x0008)(BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Bp_boss_01_Shake_AnimGraphNode_ModifyBone_00302E8A46AE3C27A6A8B0A8CB405EF3();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Bp_boss_01_Shake_AnimGraphNode_ModifyBone_1B12EE654B910F67A0FA648D51A6221E();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Bp_boss_01_Shake_AnimGraphNode_ModifyBone_302D463D478ABAB1D3C7B690DDA14921();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Bp_boss_01_Shake_AnimGraphNode_ModifyBone_39AF20E94563C3FFB998A5B9F1B3D0D5();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Bp_boss_01_Shake_AnimGraphNode_ModifyBone_4996B24A4A60F7A7C03BA8B34B8052A8();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Bp_boss_01_Shake_AnimGraphNode_ModifyBone_5B7820D8494CB5200AD050BCD6A1586A();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Bp_boss_01_Shake_AnimGraphNode_ModifyBone_6BC7F6224AA041496F5097A549F77714();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Bp_boss_01_Shake_AnimGraphNode_ModifyBone_8FF6C0554278BCCDD0B42CB24562BB45();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Bp_boss_01_Shake_AnimGraphNode_ModifyBone_9416FA0948048C6C745BC2AD8DD17872();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Bp_boss_01_Shake_AnimGraphNode_ModifyBone_A5A38E084B07E68DA03A68901650F877();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Bp_boss_01_Shake_AnimGraphNode_ModifyBone_CFFC1CD24B1D2C2EB0F58B8D0953776A();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Bp_boss_01_Shake_AnimGraphNode_ModifyBone_DBEF185B44C58D5D681572A9122C929D();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Bp_boss_01_Shake_AnimGraphNode_ModifyBone_F7572EB240718279CAF8DEBD22B97FC3();
	void ExecuteUbergraph_Bp_boss_01_Shake(int32 EntryPoint);
	void ShakeBoneLayer(const struct FPoseLink& InPose, double PushScale_0, double BlendAlpha_0, struct FPoseLink* ShakeBoneLayer_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Bp_boss_01_Shake_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Bp_boss_01_Shake_C")
	}
	static class UBp_boss_01_Shake_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBp_boss_01_Shake_C>();
	}
};
DUMPER7_ASSERTS_UBp_boss_01_Shake_C;

}

