#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Boss019_CarStartRace

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HTGame_structs.hpp"
#include "HTGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Boss019_CarStartRace.BP_Boss019_CarStartRace_C
// 0x0078 (0x0350 - 0x02D8)
class ABP_Boss019_CarStartRace_C final : public AHTTriggerBox
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBillboardComponent*                    Billboard;                                         // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          CanEnterPortal;                                    // 0x02E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E9[0x7];                                      // 0x02E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Portal_Circle_OceanChase_C*         RelatedPortal;                                     // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class UDataLayerAsset*                        ChaseDL;                                           // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UDataLayerAsset*                        PermanentDL;                                       // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           ClosePortalHandle;                                 // 0x0308(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ABP_Vehicle_Base_C*                     As_BP_Vehicle_Base;                                // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class ABP_Boss019_PreUnloadManager_C> PreunloadManager;                           // 0x0318(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FTimerHandle                           Handler;                                           // 0x0340(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          IsTest;                                            // 0x0348(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void CloseOceanPortal();
	void Cus_CancleSetRacingOff();
	void Cus_ResetActivePortal();
	void ExecuteUbergraph_BP_Boss019_CarStartRace(int32 EntryPoint);
	void OnLoaded_6EBD23DD42ADE9531A6123AB9E8E2C32(class UObject* Loaded);
	void OnLoaded_9FCA65204BC893DCF8A9AFA1B67F4B48(class UObject* Loaded);
	void ReceiveActorBeginOverlap(class AActor* OtherActor);
	void ReceiveBeginPlay();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void SetIsRacingOff();
	void VFXOff(class AHTPortaltActor* Portal);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Boss019_CarStartRace_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Boss019_CarStartRace_C")
	}
	static class ABP_Boss019_CarStartRace_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Boss019_CarStartRace_C>();
	}
};
DUMPER7_ASSERTS_ABP_Boss019_CarStartRace_C;

}

