#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CWO_OutsideEntry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_HTGamePlayEntranceActor_Base_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "HTGame_structs.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_CWO_OutsideEntry.BP_CWO_OutsideEntry_C
// 0x0248 (0x0E30 - 0x0BE8)
class ABP_CWO_OutsideEntry_C final : public ABP_HTGamePlayEntranceActor_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0BE8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          ActiveAreaCheck;                                   // 0x0BF0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Niagara;                                           // 0x0BF8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       Sphere;                                            // 0x0C00(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                    Billboard;                                         // 0x0C08(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0C10(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_Time_D0476EF0427181C31BBD11919D6E7DC7;    // 0x0C18(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_Lerp_D0476EF0427181C31BBD11919D6E7DC7;    // 0x0C1C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline__Direction_D0476EF0427181C31BBD11919D6E7DC7; // 0x0C20(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C21[0x7];                                      // 0x0C21(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline;                                          // 0x0C28(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FInteractEntry                         InteractEntry;                                     // 0x0C30(0x0168)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class UMaterialInstanceDynamic*               PostTwist;                                         // 0x0D98(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FName                                   In_Transform_ID;                                   // 0x0DA0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              ForwardTwistFinished;                              // 0x0DA8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TSoftObjectPtr<class AHTAISpawnManager>       NPCAdult;                                          // 0x0DB8(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class AHTAISpawnManager>       NPCChild;                                          // 0x0DE0(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	class UAkComponent*                           EntryIdleAK;                                       // 0x0E08(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                InteractLoc;                                       // 0x0E10(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          isFinished;                                        // 0x0E28(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__BP_CWO_OutsideEntry_ActiveAreaCheck_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void BndEvt__BP_CWO_OutsideEntry_ActiveAreaCheck_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void BP_OnActiveGameplay();
	void BP_OnEntryGameplay();
	void BP_OnLeaveGameplay();
	void BPGetInteractEntries(class AHTPlayerController* ByPC, TArray<struct FInteractEntry>* OutInteractEntries);
	void BPInteractFinished(class AHTPlayerController* ByPC, int32 InteractIndex);
	void BPOnMainRoleLoadFinished(class AHTPlayerState* PlayerState);
	void DisableGreyMesh();
	void ExecuteUbergraph_BP_CWO_OutsideEntry(int32 EntryPoint);
	void OnLoaded_4382212A4230E8CEEDCB2B8492B208F6(class UObject* Loaded);
	void OnLoaded_8547015C43A1D66ED0846F9439D3A520(class UObject* Loaded);
	void PlayTwistRotate(bool ForwardPlay_);
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void Timeline__FinishedFunc();
	void Timeline__UpdateFunc();

	struct FVector BP_GetInteractTargetLocation() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_CWO_OutsideEntry_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_CWO_OutsideEntry_C")
	}
	static class ABP_CWO_OutsideEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_CWO_OutsideEntry_C>();
	}
};
DUMPER7_ASSERTS_ABP_CWO_OutsideEntry_C;

}

