#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CityEvent_Gardua_SH_Base

#include "Basic.hpp"

#include "HTGame_structs.hpp"


namespace SDK::Params
{

// Function BP_CityEvent_Gardua_SH_Base.BP_CityEvent_Gardua_SH_Base_C.ExecuteUbergraph_BP_CityEvent_Gardua_SH_Base
// 0x0008 (0x0008 - 0x0000)
struct BP_CityEvent_Gardua_SH_Base_C_ExecuteUbergraph_BP_CityEvent_Gardua_SH_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECityEventVolumeState                         K2Node_Event_OldState;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECityEventVolumeState                         K2Node_Event_NewState;                             // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_CityEvent_Gardua_SH_Base_C_ExecuteUbergraph_BP_CityEvent_Gardua_SH_Base;

// Function BP_CityEvent_Gardua_SH_Base.BP_CityEvent_Gardua_SH_Base_C.VolumeStateChange
// 0x0002 (0x0002 - 0x0000)
struct BP_CityEvent_Gardua_SH_Base_C_VolumeStateChange final
{
public:
	ECityEventVolumeState                         OldState;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECityEventVolumeState                         NewState;                                          // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_CityEvent_Gardua_SH_Base_C_VolumeStateChange;

}

