#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CityEvent_Gardua_IB_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_CityEvent_Base_classes.hpp"
#include "HTGame_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_CityEvent_Gardua_IB_Base.BP_CityEvent_Gardua_IB_Base_C
// 0x0040 (0x0D10 - 0x0CD0)
class ABP_CityEvent_Gardua_IB_Base_C final : public ABP_CityEvent_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_CityEvent_Gardua_IB_Base_C;      // 0x0CD0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AHTAISpawnManager*                      Spawn_NPC;                                         // 0x0CD8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AHTAISpawnManager*                      AISpawn_NPC;                                       // 0x0CE0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	struct FRandomNPCMsgEntry                     NPCMsg_CityEvent_Finish;                           // 0x0CE8(0x0018)(Edit, BlueprintVisible)
	int32                                         IdleState_Int_CityEvent;                           // 0x0D00(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         IdleState_Int_CityEvent_Finish;                    // 0x0D04(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ForceChangeIdleStateIndex;                         // 0x0D08(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void VolumeStateChange(ECityEventVolumeState OldState, ECityEventVolumeState NewState);
	void ExecuteUbergraph_BP_CityEvent_Gardua_IB_Base(int32 EntryPoint);
	void EventOn_SpawnWaveEnd_Monster(class AHTAISpawnManager* SpawnMgr, int32 WaveIndex);
	void EnableIdleState();
	void DisableIdleState();
	void BP_FinishCityEvent();
	void BP_ActivateCityEvent();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_CityEvent_Gardua_IB_Base_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_CityEvent_Gardua_IB_Base_C")
	}
	static class ABP_CityEvent_Gardua_IB_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_CityEvent_Gardua_IB_Base_C>();
	}
};
DUMPER7_ASSERTS_ABP_CityEvent_Gardua_IB_Base_C;

}

