#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CityEvent_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HTGame_structs.hpp"
#include "HTGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_CityEvent_Base.BP_CityEvent_Base_C
// 0x0030 (0x0CD0 - 0x0CA0)
class ABP_CityEvent_Base_C : public AHTCityEventVolumeLogicActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0CA0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBillboardComponent*                    Billboard;                                         // 0x0CA8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FString                                 EventType;                                         // 0x0CB0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class AHTMassCrowdHideAndAvoidVolume*         HTMassCrowdHideAndAvoidVolume;                     // 0x0CC0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	bool                                          IsActivateShow;                                    // 0x0CC8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BP_ActivateCityEvent();
	void BP_FinishCityEvent();
	void CustomEvent(class AHTAISpawnManager* SpawnMgr, class AHTCharacter* OwnerPlayer);
	void ExecuteUbergraph_BP_CityEvent_Base(int32 EntryPoint);
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void VolumeStateChange(ECityEventVolumeState OldState, ECityEventVolumeState NewState);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_CityEvent_Base_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_CityEvent_Base_C")
	}
	static class ABP_CityEvent_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_CityEvent_Base_C>();
	}
};
DUMPER7_ASSERTS_ABP_CityEvent_Base_C;

}

