#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ChangeActorStencil

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "HTGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ChangeActorStencil.BP_ChangeActorStencil_C
// 0x0090 (0x0C10 - 0x0B80)
class ABP_ChangeActorStencil_C final : public AHTVisualActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B80(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USphereComponent*                       GetRange;                                          // 0x0B88(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                    Billboard;                                         // 0x0B90(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         StencilValue;                                      // 0x0B98(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9C[0x4];                                      // 0x0B9C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TSoftObjectPtr<class AActor>>          PCGHouses;                                         // 0x0BA0(0x0010)(Edit, BlueprintVisible)
	TArray<TSoftObjectPtr<class AStaticMeshActor>> StaticMeshActors;                                 // 0x0BB0(0x0010)(Edit, BlueprintVisible)
	TArray<TSoftObjectPtr<class AInstancedFoliageActor>> InstancedFoliageActors;                     // 0x0BC0(0x0010)(Edit, BlueprintVisible)
	TArray<TSoftObjectPtr<class AActor>>          PBGHouses;                                         // 0x0BD0(0x0010)(Edit, BlueprintVisible)
	TArray<TSoftObjectPtr<class ASnappyRoadWorldPartitionActor>> SnappyRoadLights;                   // 0x0BE0(0x0010)(Edit, BlueprintVisible)
	struct FVector                                AnomalyCenterLocation;                             // 0x0BF0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        AnomalyRange;                                      // 0x0C08(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void StaticMeshActorsUseStencilValueEvent(bool Use_);
	void RoadLightsUseStencilValueEvent(bool Use_);
	void PCGUseStencilValueEvent(bool Use_);
	void PBGUseStencilValueEvent(bool Use_);
	void OnLoaded_94BE412740AF78D5651197B3B1CB1CA2(class UObject* Loaded);
	void OnLoaded_642F4CE04F27DB9FFF53DC9682F68932(class UObject* Loaded);
	void OnLoaded_4FD7CD184D91BA4F776FC0A0AB137F5E(class UObject* Loaded);
	void OnLoaded_4C8B23234C5201FBB3FEB0BC87380398(class UObject* Loaded);
	void OnLoaded_32A3ED924C4BA1287006A68A767FC8B3(class UObject* Loaded);
	void InstancedFoliageActorsUseStencilValueEvent(bool Use_);
	void GetRangeStaticMeshActors();
	void GetRangeInstancedFoliageActors();
	void ExecuteUbergraph_BP_ChangeActorStencil(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_ChangeActorStencil_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_ChangeActorStencil_C")
	}
	static class ABP_ChangeActorStencil_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ChangeActorStencil_C>();
	}
};
DUMPER7_ASSERTS_ABP_ChangeActorStencil_C;

}

