#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DialogueNPC_Sub_027_World_Boxing

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HTGame_structs.hpp"
#include "BP_DialogueNPC_Sub_027_World_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_DialogueNPC_Sub_027_World_Boxing.BP_DialogueNPC_Sub_027_World_Boxing_C
// 0x0060 (0x3340 - 0x32E0)
class ABP_DialogueNPC_Sub_027_World_Boxing_C final : public ABP_DialogueNPC_Sub_027_World_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x32E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBPBubbleComponent_C*                   BPBubbleComponent;                                 // 0x32E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       BoxingBB;                                          // 0x32F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          GameplayCompleted;                                 // 0x32F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          BeThreatened;                                      // 0x32F9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Flee;                                              // 0x32FA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32FB[0x5];                                     // 0x32FB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FNPCMsgID>                      FearBB;                                            // 0x3300(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FNPCMsgID>                      FearBB_1;                                          // 0x3310(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class Amon_21_BP_Vision_Boxing_C*             BoxingRef;                                         // 0x3320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           FearHandle;                                        // 0x3328(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         IdleStateCache;                                    // 0x3330(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Yahaha_Id;                                         // 0x3334(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__BP_DialogueNPC_Sub_027_World_Boxing_BoxingBB_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void BndEvt__BP_DialogueNPC_Sub_027_World_Boxing_HTDialogue_K2Node_ComponentBoundEvent_1_OnDialogueBeginEndDelegate__DelegateSignature(class AHTPlayerCharacter* InPlayer);
	bool CheckDialogueEndRecoverRot();
	void Cus_EnterFlee();
	void Cus_GameplayCompleted();
	void Cus_SetVisionCompletedNPCState();
	void Cus_ShowFearBB();
	void ExecuteUbergraph_BP_DialogueNPC_Sub_027_World_Boxing(int32 EntryPoint);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_DialogueNPC_Sub_027_World_Boxing_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_DialogueNPC_Sub_027_World_Boxing_C")
	}
	static class ABP_DialogueNPC_Sub_027_World_Boxing_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_DialogueNPC_Sub_027_World_Boxing_C>();
	}
};
DUMPER7_ASSERTS_ABP_DialogueNPC_Sub_027_World_Boxing_C;

}

