#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DanManager_None

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_DanManager_None.BP_DanManager_None_C.Cus_GameplayBegin
// 0x0001 (0x0001 - 0x0000)
struct BP_DanManager_None_C_Cus_GameplayBegin final
{
public:
	bool                                          Veh_;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_DanManager_None_C_Cus_GameplayBegin;

// Function BP_DanManager_None.BP_DanManager_None_C.ExecuteUbergraph_BP_DanManager_None
// 0x0018 (0x0018 - 0x0000)
struct BP_DanManager_None_C_ExecuteUbergraph_BP_DanManager_None final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Veh_;                                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Cus_Jutsu__JutsuTime;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_ImplicitCast;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_DanManager_None_C_ExecuteUbergraph_BP_DanManager_None;

}

