#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DanVisionManager_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HTGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_DanVisionManager_Base.BP_DanVisionManager_Base_C
// 0x0060 (0x0DB0 - 0x0D50)
class ABP_DanVisionManager_Base_C final : public AHTPockmonActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0D50(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBillboardComponent*                    Billboard;                                         // 0x0D58(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_DanManager_Base_C*>          Managers;                                          // 0x0D60(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	class FString                                 VisionID;                                          // 0x0D70(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FName                                   SpecialEndYahahaId;                                // 0x0D80(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bHasSpecialEnd_;                                   // 0x0D88(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D89[0x7];                                      // 0x0D89(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHTVisionAreaVolume*                    RelatedRadarVolume;                                // 0x0D90(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	TArray<TSoftObjectPtr<class AActor>>          NeedHideActors;                                    // 0x0D98(0x0010)(Edit, BlueprintVisible)

public:
	void BPOnMainRoleLoadFinished(class AHTPlayerState* PlayerState);
	void Cus_Finish(bool SpecialEnd_);
	void ExecuteUbergraph_BP_DanVisionManager_Base(int32 EntryPoint);
	void OnLoaded_412DFDE3417DE62D230D23A11C647C83(class UObject* Loaded);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_DanVisionManager_Base_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_DanVisionManager_Base_C")
	}
	static class ABP_DanVisionManager_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_DanVisionManager_Base_C>();
	}
};
DUMPER7_ASSERTS_ABP_DanVisionManager_Base_C;

}

