#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FindCat_Interact_K110355_2

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HTGame_structs.hpp"
#include "HTGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_FindCat_Interact_K110355_2.BP_FindCat_Interact_K110355_2_C
// 0x0090 (0x0C10 - 0x0B80)
class ABP_FindCat_Interact_K110355_2_C final : public AHTVisualActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B80(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   SM_billboard_10;                                   // 0x0B88(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       Sphere;                                            // 0x0B90(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FInteractEntry>                 Out_Interact_Entries;                              // 0x0B98(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class FName                                   K110355;                                           // 0x0BA8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Five5Object_ID;                                    // 0x0BB0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FText>                           Msg1;                                              // 0x0BB8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class FText>                           MSG2;                                              // 0x0BC8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class FText>                           MSG3;                                              // 0x0BD8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FName                                   K1103541;                                          // 0x0BE8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K110356;                                           // 0x0BF0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CanInteract_;                                      // 0x0BF8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BF9[0x3];                                      // 0x0BF9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Yahaha_Id;                                         // 0x0BFC(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Objective_ID;                                      // 0x0C04(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BPGetInteractEntries(class AHTPlayerController* ByPC, TArray<struct FInteractEntry>* OutInteractEntries);
	void BPInteractFinished(class AHTPlayerController* ByPC, int32 InteractIndex);
	void BPOnMainRoleLoadFinished(class AHTPlayerState* PlayerState);
	void Complete56(const class FName& QuestId, class AHTPlayerState* thePlayer);
	void ExecuteUbergraph_BP_FindCat_Interact_K110355_2(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_FindCat_Interact_K110355_2_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_FindCat_Interact_K110355_2_C")
	}
	static class ABP_FindCat_Interact_K110355_2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_FindCat_Interact_K110355_2_C>();
	}
};
DUMPER7_ASSERTS_ABP_FindCat_Interact_K110355_2_C;

}

