#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FaiyrSeat_2

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "HTGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_FaiyrSeat_2.BP_FaiyrSeat_2_C
// 0x0068 (0x03E0 - 0x0378)
class ABP_FaiyrSeat_2_C final : public AHTFairySeat
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0378(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHTFairyWheelCollisionComponent*        HTFairyWheelCollision;                             // 0x0380(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0388(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_FairyWheel01_Box_Door;                          // 0x0390(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Cube;                                              // 0x0398(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         ____Value_6245D65548B5E8D545BA87915C15991E;        // 0x03A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            _____Direction_6245D65548B5E8D545BA87915C15991E;   // 0x03A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A5[0x3];                                      // 0x03A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     时间轴; // 0x03A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                DoorCloseLoc;                                      // 0x03B0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                DoorOpenLoc;                                       // 0x03C8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void CloseDoor(bool bImmediate);
	void ExecuteUbergraph_BP_FaiyrSeat_2(int32 EntryPoint);
	void GetPhysicsOptimizePrimComp(TArray<class UPrimitiveComponent*>* OutPrimitiveComponents);
	class UMeshComponent* GetSeatMesh();
	void OpenDoor(bool bImmediate);
	void ReceiveActorBeginOverlap(class AActor* OtherActor);
	void ReceiveActorEndOverlap(class AActor* OtherActor);
	void 时间轴__FinishedFunc();
	void 时间轴__UpdateFunc();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_FaiyrSeat_2_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_FaiyrSeat_2_C")
	}
	static class ABP_FaiyrSeat_2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_FaiyrSeat_2_C>();
	}
};
DUMPER7_ASSERTS_ABP_FaiyrSeat_2_C;

}

