#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_InsideDropProps

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HTGame_structs.hpp"
#include "HTGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_InsideDropProps.BP_InsideDropProps_C
// 0x0070 (0x0D00 - 0x0C90)
class ABP_InsideDropProps_C : public AHTBreakableActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0C90(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          Box;                                               // 0x0C98(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Cone;                                              // 0x0CA0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0CA8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UObject>                 HitSound;                                          // 0x0CB0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UObject>                 DropSound;                                         // 0x0CD8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void BndEvt__BP_InsideDropProps_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void Cus_Drop(bool* Success_);
	void Cus_DropSound(const struct FVector& Location);
	void Cus_HitSound(const struct FVector& Location);
	void ExecuteUbergraph_BP_InsideDropProps(int32 EntryPoint);
	void OnLoaded_4F848C76493CA145ADC1AC80E8C5FC59(class UObject* Loaded);
	void OnLoaded_E5BBBB5245101E7AB2ACFEBFAAFA1490(class UObject* Loaded);
	void ReceiveOnTakeDamage(class AActor* DamageCauser, const struct FHitResult& HitResult, bool bRealDamaged);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_InsideDropProps_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_InsideDropProps_C")
	}
	static class ABP_InsideDropProps_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_InsideDropProps_C>();
	}
};
DUMPER7_ASSERTS_ABP_InsideDropProps_C;

}

