#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LS_AutoDoor_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_AutoDoor_Base_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_LS_AutoDoor_Base.BP_LS_AutoDoor_Base_C
// 0x0050 (0x0CA8 - 0x0C58)
class ABP_LS_AutoDoor_Base_C : public ABP_AutoDoor_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_LS_AutoDoor_Base_C;              // 0x0C58(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   Door;                                              // 0x0C60(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_X_06A6A8524F3C49604EB78E990EFB81B4;     // 0x0C68(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_06A6A8524F3C49604EB78E990EFB81B4; // 0x0C6C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C6D[0x3];                                      // 0x0C6D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x0C70(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        OffestY;                                           // 0x0C78(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              Finished;                                          // 0x0C80(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UAkAudioEvent*                          OpenAkEvent;                                       // 0x0C90(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          CloseAkEvent;                                      // 0x0C98(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        Relative_Location_X;                               // 0x0CA0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Timeline_0__UpdateFunc();
	void Timeline_0__FinishedFunc();
	void OpenDoor(int32 DoorState_0);
	void ExecuteUbergraph_BP_LS_AutoDoor_Base(int32 EntryPoint);
	void CloseDoor();
	void BPOnMainRoleLoadFinished(class AHTPlayerState* PlayerState);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_LS_AutoDoor_Base_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_LS_AutoDoor_Base_C")
	}
	static class ABP_LS_AutoDoor_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_LS_AutoDoor_Base_C>();
	}
};
DUMPER7_ASSERTS_ABP_LS_AutoDoor_Base_C;

}

