#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MB_Graffiti_New_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UDS_MB_Graffiti_State_structs.hpp"
#include "HTGame_structs.hpp"
#include "HTGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_MB_Graffiti_New_Base.BP_MB_Graffiti_New_Base_C
// 0x0268 (0x0DE8 - 0x0B80)
class ABP_MB_Graffiti_New_Base_C final : public AHTVisualActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B80(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          LeaveBattleBox;                                    // 0x0B88(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        Decal;                                             // 0x0B90(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                    TargetPoint;                                       // 0x0B98(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                    Billboard1;                                        // 0x0BA0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          InteractCollision;                                 // 0x0BA8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           ____0_NewTrack_1_D7BC4EF64526B642277B9AA947289655; // 0x0BB0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ____0_Contrast_D7BC4EF64526B642277B9AA947289655;   // 0x0BC0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ____0_NewTrack_0_D7BC4EF64526B642277B9AA947289655; // 0x0BC4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            ____0__Direction_D7BC4EF64526B642277B9AA947289655; // 0x0BC8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC9[0x7];                                      // 0x0BC9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     时间轴_0;                                       // 0x0BD0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           ____NewTrack_1_27F2EC69472600CA7D404EB1C9096B48;   // 0x0BD8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ____Matercial_Instance_27F2EC69472600CA7D404EB1C9096B48; // 0x0BE8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ____Contrast_27F2EC69472600CA7D404EB1C9096B48;     // 0x0BEC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ____NewTrack_0_27F2EC69472600CA7D404EB1C9096B48;   // 0x0BF0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            _____Direction_27F2EC69472600CA7D404EB1C9096B48;   // 0x0BF4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BF5[0x3];                                      // 0x0BF5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     时间轴; // 0x0BF8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AHTAISpawnManager*                      HTAISpawn;                                         // 0x0C00(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class ABP_MB_Graffiti_Decal_Base_C*           BP_MB_Graffiti_Decal;                              // 0x0C08(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class UBP_Monster_tuyaAnim_C*                 As_BP_Monster_tuya_Anim;                           // 0x0C10(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UWorld>                  Level_Art;                                         // 0x0C18(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash)
	class ULevelStreamingDynamic*                 Level_variable;                                    // 0x0C40(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	EUDS_MB_Graffiti_State                        State;                                             // 0x0C48(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C49[0x7];                                      // 0x0C49(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Scene_Actor03;                                     // 0x0C50(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	class FName                                   Level_ID;                                          // 0x0C60(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Scene_Actor02;                                     // 0x0C68(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	TArray<class AActor*>                         Scene_Actor01;                                     // 0x0C78(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	struct FTempCustomTimeDilationParams          In_Params;                                         // 0x0C88(0x00E8)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class ADecalActor*>                    Scene_Decal;                                       // 0x0D70(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	class UMaterialInstanceDynamic*               Material_Instance;                                 // 0x0D80(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FString                                 In_Vision_ID;                                      // 0x0D88(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UAkAudioEvent>           BgmEvent;                                          // 0x0D98(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash)
	class AHTVisionAreaVolume*                    HTVisionAreaVolume;                                // 0x0DC0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class FName                                   Quest_ID;                                          // 0x0DC8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Object_ID;                                         // 0x0DD0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class Amon_012_1_BP_C*                        As_Mon_012_1_BP;                                   // 0x0DD8(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, RepNotify, NoDestructor, HasGetValueTypeHash)
	class Amon_012_2_BP_C*                        As_Mon_012_2_BP;                                   // 0x0DE0(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, RepNotify, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__BP_MB_Graffiti_New_Base_InteractCollision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void BndEvt__BP_MB_Graffiti_New_Base_LeaveBattleBox_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void BndEvt__BP_MB_Graffiti_New_Base_LeaveBattleBox_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void BPOnMainRoleLoadFinished(class AHTPlayerState* PlayerState);
	void Completed_3C6E6CC14A7453E1894608AD1E4A6D24(class UCommonActivatableWidget* WidgetObject);
	void Completed_894009DC43347483C54F1EAB498D8EEB(class UCommonActivatableWidget* WidgetObject);
	void Enent_ProtectLleaveBattle();
	void Event_OnOtherPlayerIntoState2();
	void Event_OnPlayerFight(bool bInFight);
	void EventOn_Ending();
	void EventOn_LeaveBattleBox(class AHTPlayerCharacter* As_HTPlayer_Character);
	void EventOn_Mon12_01EndBattle(class Amon_012_1_BP_C* NewParam);
	void EventOn_Mon12_02EndBattle(class Amon_012_2_BP_C* NewParam);
	void EventOn_Mon12_endbattle(class Amon_012_1_BP_C* NewParam);
	void EventOn_Mon12_endBattleEnd(class Amon_012_2_BP_C* NewParam);
	void EventOn_OverlapBattleBox(class AHTPlayerCharacter* As_HTPlayer_Character);
	void EventOn_OverlapBox(class AHTPlayerCharacter* As_HTPlayer_Character);
	void EventOn_UI(EUDS_MB_Graffiti_State UDS_State);
	void ExecuteUbergraph_BP_MB_Graffiti_New_Base(int32 EntryPoint);
	void Manager_SceneAndMusic(EUDS_MB_Graffiti_State UDS_State);
	void OnAICharacterSpawnedEvent(class AHTAICharacter* AICharacter);
	void OnAllAIDead_Event(class AHTAISpawnManager* SpawnMgr, class AHTCharacter* OwnerPlayer);
	void OnBeginSpawnReset();
	void OnFail_2161F1A843A54F41AD181089C36CD0F3(class AHTAISpawnManager* Spawn);
	void OnMainRoleFinish_2161F1A843A54F41AD181089C36CD0F3(class AHTAISpawnManager* Spawn);
	void OnRep_As_Mon_012_1_BP();
	void OnRep_As_Mon_012_2_BP();
	void OnSpawnStage1Monster(class Amon_012_1_BP_C* MonStage1);
	void OnSpawnStage2Monster(class Amon_012_2_BP_C* MonStage2);
	void QuestAccept(const class FName& QuestId, class AHTPlayerState* thePlayer);
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void RemoveBgm();
	void 时间轴_0__FinishedFunc();
	void 时间轴_0__UpdateFunc();
	void 时间轴__FinishedFunc();
	void 时间轴__UpdateFunc();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_MB_Graffiti_New_Base_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_MB_Graffiti_New_Base_C")
	}
	static class ABP_MB_Graffiti_New_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_MB_Graffiti_New_Base_C>();
	}
};
DUMPER7_ASSERTS_ABP_MB_Graffiti_New_Base_C;

}

