#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ModsCharacter_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HTGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ModsCharacter_Base.BP_ModsCharacter_Base_C
// 0x0030 (0x2A20 - 0x29F0)
class ABP_ModsCharacter_Base_C : public AHTModsCharacter
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x29F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHTGlobalSnowInteractorComponent*       HTGlobalSnowInteractor;                            // 0x29F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPBubbleComponent_C*                   BPBubbleComponent;                                 // 0x2A00(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHTThreatenComponent*                   HTThreaten;                                        // 0x2A08(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCharacterHeadUpComp_BP_C*              CharacterHeadUpComp_BP;                            // 0x2A10(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_MassPlayerAgentComponent_C*         BP_MassPlayerAgentComponent;                       // 0x2A18(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_ModsCharacter_Base(int32 EntryPoint);
	void OnBeginBattle();
	void OnEndBattle();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_ModsCharacter_Base_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_ModsCharacter_Base_C")
	}
	static class ABP_ModsCharacter_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ModsCharacter_Base_C>();
	}
};
DUMPER7_ASSERTS_ABP_ModsCharacter_Base_C;

}

