#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MB_Graffiti_Decal_Common

#include "Basic.hpp"

#include "UDS_MB_Graffiti_State_structs.hpp"


namespace SDK::Params
{

// Function BP_MB_Graffiti_Decal_Common.BP_MB_Graffiti_Decal_Common_C.ExecuteUbergraph_BP_MB_Graffiti_Decal_Common
// 0x0010 (0x0010 - 0x0000)
struct BP_MB_Graffiti_Decal_Common_C_ExecuteUbergraph_BP_MB_Graffiti_Decal_Common final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUDS_MB_Graffiti_State                        K2Node_Event_State;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_MB_Graffiti_Decal_Common_C_ExecuteUbergraph_BP_MB_Graffiti_Decal_Common;

// Function BP_MB_Graffiti_Decal_Common.BP_MB_Graffiti_Decal_Common_C.On_GraffitiPerform
// 0x0001 (0x0001 - 0x0000)
struct BP_MB_Graffiti_Decal_Common_C_On_GraffitiPerform final
{
public:
	EUDS_MB_Graffiti_State                        State;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_MB_Graffiti_Decal_Common_C_On_GraffitiPerform;

}

