#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Monster_Event1

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HTGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Monster_Event1.BP_Monster_Event1_C
// 0x0068 (0x0BE8 - 0x0B80)
class ABP_Monster_Event1_C final : public AHTVisualActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B80(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBillboardComponent*                    Billboard;                                         // 0x0B88(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class AHTAISpawnManager>       Monster_Spawn;                                     // 0x0B90(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class AHTAISpawnManager>       NPC_Spawn;                                         // 0x0BB8(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	int32                                         Selection;                                         // 0x0BE0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void OnSuccess_7E29CDF949156F0D59894B88B3D79914(class AHTAISpawnManager* Spawn);
	void OnMainRoleFinish_4ABAF37441CB631FDA93B48076A88C4C(class AHTAISpawnManager* Spawn);
	void OnLoaded_F3A0F0FA4B465D0D9361DDA212706265(class UObject* Loaded);
	void OnFail_7E29CDF949156F0D59894B88B3D79914(class AHTAISpawnManager* Spawn);
	void OnFail_4ABAF37441CB631FDA93B48076A88C4C(class AHTAISpawnManager* Spawn);
	void ExecuteUbergraph_BP_Monster_Event1(int32 EntryPoint);
	void End_Battle(class AHTAICharacter* AICharacter);
	void BPOnMainRoleLoadFinished(class AHTPlayerState* PlayerState);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Monster_Event1_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Monster_Event1_C")
	}
	static class ABP_Monster_Event1_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Monster_Event1_C>();
	}
};
DUMPER7_ASSERTS_ABP_Monster_Event1_C;

}

