#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MB_LiyuuQi_BigWorld

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Liyuuqi_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "HTGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_MB_LiyuuQi_BigWorld.BP_MB_LiyuuQi_BigWorld_C
// 0x02A8 (0x0E28 - 0x0B80)
class ABP_MB_LiyuuQi_BigWorld_C final : public AHTVisualActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B80(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          Box;                                               // 0x0B88(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box3;                                              // 0x0B90(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box1;                                              // 0x0B98(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box2;                                              // 0x0BA0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Loc_WhiteCloud;                                    // 0x0BA8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Loc_GrassLow;                                      // 0x0BB0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   loc_Fishmidium;                                    // 0x0BB8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   loc_Shine;                                         // 0x0BC0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          CheckBox_Cloud;                                    // 0x0BC8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_mon_25_Scene_1;                                 // 0x0BD0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          CheckBox_Fight;                                    // 0x0BD8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Cylinder;                                          // 0x0BE0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         ____19_TimeLine_Light_14E63D5A41300A757991C7B012508A4B; // 0x0BE8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            ____19__Direction_14E63D5A41300A757991C7B012508A4B; // 0x0BEC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BED[0x3];                                      // 0x0BED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     时间轴_19;                                      // 0x0BF0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         ____17______0_B730B8114ABC474D50D3649A6D4A983C;    // 0x0BF8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            ____17__Direction_B730B8114ABC474D50D3649A6D4A983C; // 0x0BFC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BFD[0x3];                                      // 0x0BFD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     时间轴_17;                                      // 0x0C00(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         ____16______0_E3C93776434F0521BD1CA199C55E0560;    // 0x0C08(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            ____16__Direction_E3C93776434F0521BD1CA199C55E0560; // 0x0C0C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C0D[0x3];                                      // 0x0C0D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     时间轴_16;                                      // 0x0C10(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         ____15_TimeLine_Light_D76881DB4498492E0268C9834A8087E0; // 0x0C18(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            ____15__Direction_D76881DB4498492E0268C9834A8087E0; // 0x0C1C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1D[0x3];                                      // 0x0C1D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     时间轴_15;                                      // 0x0C20(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         ____14______0_48D043BF4E10A96C6CBE559E9BABD37F;    // 0x0C28(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            ____14__Direction_48D043BF4E10A96C6CBE559E9BABD37F; // 0x0C2C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C2D[0x3];                                      // 0x0C2D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     时间轴_14;                                      // 0x0C30(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         ____13_TimeLine_Light_9DF2A60A452265289DB2B4ADCFC9F6A5; // 0x0C38(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            ____13__Direction_9DF2A60A452265289DB2B4ADCFC9F6A5; // 0x0C3C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C3D[0x3];                                      // 0x0C3D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     时间轴_13;                                      // 0x0C40(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         ____10_TimeLine_Light_6CECEE634C4A4B81CEA8F59A29C3370B; // 0x0C48(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            ____10__Direction_6CECEE634C4A4B81CEA8F59A29C3370B; // 0x0C4C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4D[0x3];                                      // 0x0C4D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     时间轴_10;                                      // 0x0C50(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         ____8_TimeLine_Light_D8A71E134804C553B2BB1A85F59F963F; // 0x0C58(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            ____8__Direction_D8A71E134804C553B2BB1A85F59F963F; // 0x0C5C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C5D[0x3];                                      // 0x0C5D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     时间轴_8;                                       // 0x0C60(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         ____7_TimeLine_Light_1EDB4CC443D5DACBBE1787A2AB9E3AD8; // 0x0C68(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            ____7__Direction_1EDB4CC443D5DACBBE1787A2AB9E3AD8; // 0x0C6C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C6D[0x3];                                      // 0x0C6D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     时间轴_7;                                       // 0x0C70(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         ____6_TimeLine_Light_66F5F3B24002CB2B5A3EEBB5A3C02839; // 0x0C78(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            ____6__Direction_66F5F3B24002CB2B5A3EEBB5A3C02839; // 0x0C7C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C7D[0x3];                                      // 0x0C7D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     时间轴_6;                                       // 0x0C80(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         ____5_TimeLine_Light_A1BCAA0A4373A518E6CC80BF845E3362; // 0x0C88(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            ____5__Direction_A1BCAA0A4373A518E6CC80BF845E3362; // 0x0C8C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C8D[0x3];                                      // 0x0C8D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     时间轴_5;                                       // 0x0C90(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         ____4_TimeLine_Light_586CB4234B651B85EDE21595439C045F; // 0x0C98(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            ____4__Direction_586CB4234B651B85EDE21595439C045F; // 0x0C9C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9D[0x3];                                      // 0x0C9D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     时间轴_4;                                       // 0x0CA0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         ____3_TimeLine_Light_23FFADA74AC1626D8C097587F8527DC6; // 0x0CA8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            ____3__Direction_23FFADA74AC1626D8C097587F8527DC6; // 0x0CAC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CAD[0x3];                                      // 0x0CAD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     时间轴_3;                                       // 0x0CB0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         ____2_TimeLine_Light_D5EA0ABF4AC5F2D26981BFBB076CAECD; // 0x0CB8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            ____2__Direction_D5EA0ABF4AC5F2D26981BFBB076CAECD; // 0x0CBC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CBD[0x3];                                      // 0x0CBD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     时间轴_2;                                       // 0x0CC0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         ____1_TimeLine_Light_095BCA0241FD0EF3FD1DE48E3673E3AF; // 0x0CC8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            ____1__Direction_095BCA0241FD0EF3FD1DE48E3673E3AF; // 0x0CCC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CCD[0x3];                                      // 0x0CCD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     时间轴_1;                                       // 0x0CD0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         ____0_TimeLine_Light_E44A84DF4158FD8FFA8EDB81A84BC91D; // 0x0CD8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            ____0__Direction_E44A84DF4158FD8FFA8EDB81A84BC91D; // 0x0CDC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CDD[0x3];                                      // 0x0CDD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     时间轴_0;                                       // 0x0CE0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         _________0_D09E29BC444DCF436F6060B3945A4E7D;       // 0x0CE8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            _____Direction_D09E29BC444DCF436F6060B3945A4E7D;   // 0x0CEC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CED[0x3];                                      // 0x0CED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     时间轴; // 0x0CF0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         Keep_Time;                                         // 0x0CF8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          OnCom;                                             // 0x0CFC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CFD[0x3];                                      // 0x0CFD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AHTAISpawnManager*                      FishReal;                                          // 0x0D00(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	TArray<class Amon_025_BP_C*>                  As_Mon_025_BP;                                     // 0x0D08(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	TSoftObjectPtr<class UNiagaraComponent>       NS_Mon_25_Scene_4;                                 // 0x0D18(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UNiagaraComponent>       NS;                                                // 0x0D40(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class ALv4_TreasureBox_001_C*                 treasure;                                          // 0x0D68(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AHTAISpawnManager*                      NewVar;                                            // 0x0D70(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FVector                                FishLocation;                                      // 0x0D78(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               New_Rotation;                                      // 0x0D90(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class AHTTargetPoint*                         Point;                                             // 0x0DA8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	bool                                          Test;                                              // 0x0DB0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DB1[0x7];                                      // 0x0DB1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHTAreaMusicVolume*                     MusicBox;                                          // 0x0DB8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class ALv2_TreasureBox_Base_C*                TreasureBox;                                       // 0x0DC0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class AHTPlayerCharacter*                     HTPlayerCharacter;                                 // 0x0DC8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         Y__Pitch_;                                         // 0x0DD0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELiyuuqi                                      Selection;                                         // 0x0DD4(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DD5[0x3];                                      // 0x0DD5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Ambient_Light_1;                                   // 0x0DD8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Ambient_light1;                                    // 0x0DE0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Loc_Cloud;                                         // 0x0DE8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class AUltra_Dynamic_Sky_HT_C> HT_Sky;                                            // 0x0DF0(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	class ABP_HTPockmonActor_LiyuuqiBase_C*       HT_PockmonActor_LiyuuQi;                           // 0x0E18(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          IsActivateAI;                                      // 0x0E20(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Add_AllKilled();
	void Add_Change();
	void AllKilled(class AHTAISpawnManager* SpawnMgr, class AHTCharacter* OwnerPlayer);
	void Battle_M();
	void Battle_N();
	void BndEvt__BP_MB_LiyuuQi_Base_CheckBox_Cloud_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void BndEvt__BP_MB_LiyuuQi_Base_CheckBox_Cloud_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void BndEvt__NewBlueprint_Box_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void BPOnMainRoleLoadFinished(class AHTPlayerState* PlayerState);
	void CameraCont();
	void Change(int32 Hour);
	void Change_Material_M();
	void Change_Material_N();
	void CleanAllNiagaraFromMorning();
	void CleanAllNiagaraFromNight();
	void CleanCyclinder();
	void CleanScene_M();
	void CleanScene_N();
	void ClearNight();
	void DisElement_M();
	void Element_State_M();
	void ElementState_N();
	void ExecuteUbergraph_BP_MB_LiyuuQi_BigWorld(int32 EntryPoint);
	void FishONScene();
	void Huidiao(class AHTAICharacter* AICharacter);
	void LoadScene();
	void OnFail_229A1AE74835FDAE349019841B329AC3(class AHTAISpawnManager* Spawn);
	void OnFail_53B3A7964A93D8402E90B69176BBD3EF(class AHTAISpawnManager* Spawn);
	void OnFail_62DC05924E8899860ECA9D997CDCA55C(class AHTAISpawnManager* Spawn);
	void OnFail_9D0B19364B7E8271B4284CB21FC92988(class AHTAISpawnManager* Spawn);
	void OnFail_DE430BCC48A8C43DE7C1B38979E2B3C3(class AHTAISpawnManager* Spawn);
	void ONFight();
	void OnLoaded_4B662AEB49D1069BBC516CA77B848ABC(class UObject* Loaded);
	void OnMainRoleFinish_229A1AE74835FDAE349019841B329AC3(class AHTAISpawnManager* Spawn);
	void OnMainRoleFinish_62DC05924E8899860ECA9D997CDCA55C(class AHTAISpawnManager* Spawn);
	void OnSuccess_53B3A7964A93D8402E90B69176BBD3EF(class AHTAISpawnManager* Spawn);
	void OnSuccess_9D0B19364B7E8271B4284CB21FC92988(class AHTAISpawnManager* Spawn);
	void OnSuccess_DE430BCC48A8C43DE7C1B38979E2B3C3(class AHTAISpawnManager* Spawn);
	void Overlap();
	void ReceiveBeginPlay();
	void ReCoverCyclinder();
	void Reset_FishReal_0();
	void Reset2();
	void Reset_FishReal();
	void Reset_Liyuuqi();
	void Shine_Cloud_();
	void ShowCloud();
	void ShutClou();
	void ShutFish();
	void ShutLine();
	void ShutSh();
	void 时间轴_0__FinishedFunc();
	void 时间轴_0__UpdateFunc();
	void 时间轴_10__FinishedFunc();
	void 时间轴_10__UpdateFunc();
	void 时间轴_13__FinishedFunc();
	void 时间轴_13__UpdateFunc();
	void 时间轴_14__FinishedFunc();
	void 时间轴_14__UpdateFunc();
	void 时间轴_15__FinishedFunc();
	void 时间轴_15__UpdateFunc();
	void 时间轴_16__FinishedFunc();
	void 时间轴_16__UpdateFunc();
	void 时间轴_17__FinishedFunc();
	void 时间轴_17__UpdateFunc();
	void 时间轴_19__FinishedFunc();
	void 时间轴_19__UpdateFunc();
	void 时间轴_1__FinishedFunc();
	void 时间轴_1__UpdateFunc();
	void 时间轴_2__FinishedFunc();
	void 时间轴_2__UpdateFunc();
	void 时间轴_3__FinishedFunc();
	void 时间轴_3__UpdateFunc();
	void 时间轴_4__FinishedFunc();
	void 时间轴_4__UpdateFunc();
	void 时间轴_5__FinishedFunc();
	void 时间轴_5__UpdateFunc();
	void 时间轴_6__FinishedFunc();
	void 时间轴_6__UpdateFunc();
	void 时间轴_7__FinishedFunc();
	void 时间轴_7__UpdateFunc();
	void 时间轴_8__FinishedFunc();
	void 时间轴_8__UpdateFunc();
	void 时间轴__FinishedFunc();
	void 时间轴__UpdateFunc();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_MB_LiyuuQi_BigWorld_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_MB_LiyuuQi_BigWorld_C")
	}
	static class ABP_MB_LiyuuQi_BigWorld_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_MB_LiyuuQi_BigWorld_C>();
	}
};
DUMPER7_ASSERTS_ABP_MB_LiyuuQi_BigWorld_C;

}

