#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Musicactor_BASE

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HTGame_structs.hpp"
#include "HTGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Musicactor_BASE.BP_Musicactor_BASE_C
// 0x0038 (0x0BB8 - 0x0B80)
class ABP_Musicactor_BASE_C : public AHTVisualActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B80(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USphereComponent*                       Sphere;                                            // 0x0B88(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                    Billboard;                                         // 0x0B90(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           Music;                                             // 0x0B98(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          AkPlayMusic;                                       // 0x0BA0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          AkStopMusic;                                       // 0x0BA8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          MusicPlaying;                                      // 0x0BB0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ParentHide;                                        // 0x0BB1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BPOnMainRoleLoadFinished(class AHTPlayerState* PlayerState);
	void ExecuteUbergraph_BP_Musicactor_BASE(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void StartMusicEvent();
	void StateChange(class AHTVisualActor* SelfActor, EVisualActorSpecialState InSpecialState);
	void StopMusicEvent();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Musicactor_BASE_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Musicactor_BASE_C")
	}
	static class ABP_Musicactor_BASE_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Musicactor_BASE_C>();
	}
};
DUMPER7_ASSERTS_ABP_Musicactor_BASE_C;

}

