#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MotoBoss_FinishManager

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "HTGame_structs.hpp"
#include "HTGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_MotoBoss_FinishManager.BP_MotoBoss_FinishManager_C
// 0x0160 (0x0CE0 - 0x0B80)
class ABP_MotoBoss_FinishManager_C final : public AHTVisualActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B80(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBillboardComponent*                    Billboard;                                         // 0x0B88(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       Sphere;                                            // 0x0B90(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         ControlRotatation_Alpha_F670F6C840A1D304391ACA9BB3669F02; // 0x0B98(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            ControlRotatation__Direction_F670F6C840A1D304391ACA9BB3669F02; // 0x0B9C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9D[0x3];                                      // 0x0B9D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     ControlRotatation;                                 // 0x0BA0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NiagaraTimeline2_PostColor_152CF5704B2E3B165FB0D1ABF99BB5CC; // 0x0BA8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         NiagaraTimeline2_PostCrack_152CF5704B2E3B165FB0D1ABF99BB5CC; // 0x0BC0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         NiagaraTimeline2_SpeedLerp_152CF5704B2E3B165FB0D1ABF99BB5CC; // 0x0BC4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         NiagaraTimeline2_WhiteSkewing_152CF5704B2E3B165FB0D1ABF99BB5CC; // 0x0BC8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         NiagaraTimeline2_PostRadius_152CF5704B2E3B165FB0D1ABF99BB5CC; // 0x0BCC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         NiagaraTimeline2_PostOpacity_152CF5704B2E3B165FB0D1ABF99BB5CC; // 0x0BD0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            NiagaraTimeline2__Direction_152CF5704B2E3B165FB0D1ABF99BB5CC; // 0x0BD4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BD5[0x3];                                      // 0x0BD5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     NiagaraTimeline2;                                  // 0x0BD8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Niagara_Timeline1_PostColor_7F1D313D44AB14EFEA51469265604451; // 0x0BE0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Niagara_Timeline1_PostCrack_7F1D313D44AB14EFEA51469265604451; // 0x0BF8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Niagara_Timeline1_SpeedLerp_7F1D313D44AB14EFEA51469265604451; // 0x0BFC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Niagara_Timeline1_WhiteSkewing_7F1D313D44AB14EFEA51469265604451; // 0x0C00(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Niagara_Timeline1_PostRadius_7F1D313D44AB14EFEA51469265604451; // 0x0C04(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Niagara_Timeline1_PostOpacity_7F1D313D44AB14EFEA51469265604451; // 0x0C08(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Niagara_Timeline1__Direction_7F1D313D44AB14EFEA51469265604451; // 0x0C0C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C0D[0x3];                                      // 0x0C0D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Niagara_Timeline1;                                 // 0x0C10(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         FXTimeline_LightIntensity_9FC57BF24A7F09BABE53E796621ACBEE; // 0x0C18(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FXTimeline_ScreenScale_9FC57BF24A7F09BABE53E796621ACBEE; // 0x0C1C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FXTimeline_Len_9FC57BF24A7F09BABE53E796621ACBEE;   // 0x0C20(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FXTimeline_Bias_9FC57BF24A7F09BABE53E796621ACBEE;  // 0x0C24(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FXTimeline_Lerp_9FC57BF24A7F09BABE53E796621ACBEE;  // 0x0C28(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            FXTimeline__Direction_9FC57BF24A7F09BABE53E796621ACBEE; // 0x0C2C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C2D[0x3];                                      // 0x0C2D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     FXTimeline;                                        // 0x0C30(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          bOutside_;                                         // 0x0C38(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C39[0x7];                                      // 0x0C39(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHTAISpawnManager*                      RelatedBossSpawner;                                // 0x0C40(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class FName                                   YahahaId_01;                                       // 0x0C48(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   YahahaId_02;                                       // 0x0C50(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Vision_ID;                                         // 0x0C58(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FName                                   TransformID;                                       // 0x0C68(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHTMapInterferAreaVolume*               RelatedInterfer;                                   // 0x0C70(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               PPDynamic;                                         // 0x0C78(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               FFDynamic;                                         // 0x0C80(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               ControlRotationCache;                              // 0x0C88(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FRotator                               PlayerRotationCache;                               // 0x0CA0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	TSoftObjectPtr<class UObject>                 AK_Fire;                                           // 0x0CB8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void OnAICharacterSpawnedEvent(class AHTAICharacter* AICharacter);
	void NiagaraTimeline2__UpdateFunc();
	void NiagaraTimeline2__PlayNiagara__EventFunc();
	void NiagaraTimeline2__FinishedFunc();
	void Niagara_Timeline1__UpdateFunc();
	void Niagara_Timeline1__FinishedFunc();
	void FXTimeline__UpdateFunc();
	void FXTimeline__FinishedFunc();
	void ExecuteUbergraph_BP_MotoBoss_FinishManager(int32 EntryPoint);
	void CustomEvent(class UHTUIBase* InUI);
	void Cus_UnloadYahaha();
	void Cus_TransferToOutside(const class AHTPlayerCharacter* Player, class AHTPlayerController* Controller);
	void Cus_PlayNiagara();
	void Cus_PlayEffect(bool Play);
	void Cus_FinishNiagara();
	void ControlRotatation__UpdateFunc();
	void ControlRotatation__FinishedFunc();
	void BPOnMainRoleLoadFinished(class AHTPlayerState* PlayerState);
	void BndEvt__BP_MotoBoss_FinishManager_Sphere_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void BndEvt__BP_MotoBoss_FinishManager_Sphere_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void BndEvt__BP_MotoBoss_FinishManager_RelatedBossSpawner_K2Node_ComponentBoundEvent_0_AllAIDeadSignature__DelegateSignature(class AHTAISpawnManager* SpawnMgr, class AHTCharacter* OwnerPlayer);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_MotoBoss_FinishManager_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_MotoBoss_FinishManager_C")
	}
	static class ABP_MotoBoss_FinishManager_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_MotoBoss_FinishManager_C>();
	}
};
DUMPER7_ASSERTS_ABP_MotoBoss_FinishManager_C;

}

