#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_NPC_S027_356

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HTGame_structs.hpp"
#include "BP_NPC_Sub_027_World_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_NPC_S027_356.BP_NPC_S027_356_C
// 0x0030 (0x32F0 - 0x32C0)
class ABP_NPC_S027_356_C final : public ABP_NPC_Sub_027_World_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x32B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBPBubbleComponent_C*                   BPBubbleComponent;                                 // 0x32C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       Dlg_Sphere;                                        // 0x32C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHTDialogueComponent*                   HTDialogue;                                        // 0x32D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FNPCMsgID>                      Msg_Arr;                                           // 0x32D8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          dlgloop;                                           // 0x32E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ReceiveBeginPlay();
	void ExecuteUbergraph_BP_NPC_S027_356(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_NPC_S027_356_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_NPC_S027_356_C")
	}
	static class ABP_NPC_S027_356_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_NPC_S027_356_C>();
	}
};
DUMPER7_ASSERTS_ABP_NPC_S027_356_C;

}

