#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_NPC_10701

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "HTGame_structs.hpp"


namespace SDK::Params
{

// Function BP_NPC_10701.BP_NPC_10701_C.ExecuteUbergraph_BP_NPC_10701
// 0x01B0 (0x01B0 - 0x0000)
struct BP_NPC_10701_C_ExecuteUbergraph_BP_NPC_10701 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_9;                   // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_8;                   // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate;              // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_7;                   // 0x0024(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_1;            // 0x002C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_6;                   // 0x003C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_2;            // 0x0044(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_5;                   // 0x0054(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_3;            // 0x005C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x006C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_4;            // 0x0074(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_4;                   // 0x0084(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_3;                   // 0x008C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_5;            // 0x0094(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_2;                   // 0x00A4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_6;            // 0x00AC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_1;                   // 0x00BC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_7;            // 0x00C4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName;                     // 0x00D4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_8;            // 0x00DC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_1;                              // 0x00EC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x00F8(0x0010)(ConstParm, ReferenceParm)
	class AHTPlayerCharacter*                     CallFunc_GetClientPlayerCharacter_ReturnValue;     // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue; // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_1; // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_122[0x6];                                      // 0x0122(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0128(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_SphereOverlapActors_OutActors;            // 0x0140(0x0010)(ReferenceParm)
	bool                                          CallFunc_SphereOverlapActors_ReturnValue;          // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_151[0x3];                                      // 0x0151(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_9;            // 0x0154(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_164[0x4];                                      // 0x0164(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0170(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0188(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UHTFadeComponent*                       CallFunc_StartFadeOut_ReturnValue;                 // 0x0198(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<struct FNPCMsgID>                      K2Node_MakeArray_Array;                            // 0x01A0(0x0010)(ConstParm, ReferenceParm)
};
DUMPER7_ASSERTS_BP_NPC_10701_C_ExecuteUbergraph_BP_NPC_10701;

// Function BP_NPC_10701.BP_NPC_10701_C.OnBlendOut_A025BCD54DB7556B3A6F2D8A7E8FC47A
// 0x0008 (0x0008 - 0x0000)
struct BP_NPC_10701_C_OnBlendOut_A025BCD54DB7556B3A6F2D8A7E8FC47A final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_NPC_10701_C_OnBlendOut_A025BCD54DB7556B3A6F2D8A7E8FC47A;

// Function BP_NPC_10701.BP_NPC_10701_C.OnBlendOut_F8A6752F4856446D3B1A56A29D520176
// 0x0008 (0x0008 - 0x0000)
struct BP_NPC_10701_C_OnBlendOut_F8A6752F4856446D3B1A56A29D520176 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_NPC_10701_C_OnBlendOut_F8A6752F4856446D3B1A56A29D520176;

// Function BP_NPC_10701.BP_NPC_10701_C.OnCompleted_A025BCD54DB7556B3A6F2D8A7E8FC47A
// 0x0008 (0x0008 - 0x0000)
struct BP_NPC_10701_C_OnCompleted_A025BCD54DB7556B3A6F2D8A7E8FC47A final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_NPC_10701_C_OnCompleted_A025BCD54DB7556B3A6F2D8A7E8FC47A;

// Function BP_NPC_10701.BP_NPC_10701_C.OnCompleted_F8A6752F4856446D3B1A56A29D520176
// 0x0008 (0x0008 - 0x0000)
struct BP_NPC_10701_C_OnCompleted_F8A6752F4856446D3B1A56A29D520176 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_NPC_10701_C_OnCompleted_F8A6752F4856446D3B1A56A29D520176;

// Function BP_NPC_10701.BP_NPC_10701_C.OnInterrupted_A025BCD54DB7556B3A6F2D8A7E8FC47A
// 0x0008 (0x0008 - 0x0000)
struct BP_NPC_10701_C_OnInterrupted_A025BCD54DB7556B3A6F2D8A7E8FC47A final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_NPC_10701_C_OnInterrupted_A025BCD54DB7556B3A6F2D8A7E8FC47A;

// Function BP_NPC_10701.BP_NPC_10701_C.OnInterrupted_F8A6752F4856446D3B1A56A29D520176
// 0x0008 (0x0008 - 0x0000)
struct BP_NPC_10701_C_OnInterrupted_F8A6752F4856446D3B1A56A29D520176 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_NPC_10701_C_OnInterrupted_F8A6752F4856446D3B1A56A29D520176;

// Function BP_NPC_10701.BP_NPC_10701_C.OnNotifyBegin_A025BCD54DB7556B3A6F2D8A7E8FC47A
// 0x0008 (0x0008 - 0x0000)
struct BP_NPC_10701_C_OnNotifyBegin_A025BCD54DB7556B3A6F2D8A7E8FC47A final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_NPC_10701_C_OnNotifyBegin_A025BCD54DB7556B3A6F2D8A7E8FC47A;

// Function BP_NPC_10701.BP_NPC_10701_C.OnNotifyBegin_F8A6752F4856446D3B1A56A29D520176
// 0x0008 (0x0008 - 0x0000)
struct BP_NPC_10701_C_OnNotifyBegin_F8A6752F4856446D3B1A56A29D520176 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_NPC_10701_C_OnNotifyBegin_F8A6752F4856446D3B1A56A29D520176;

// Function BP_NPC_10701.BP_NPC_10701_C.OnNotifyEnd_A025BCD54DB7556B3A6F2D8A7E8FC47A
// 0x0008 (0x0008 - 0x0000)
struct BP_NPC_10701_C_OnNotifyEnd_A025BCD54DB7556B3A6F2D8A7E8FC47A final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_NPC_10701_C_OnNotifyEnd_A025BCD54DB7556B3A6F2D8A7E8FC47A;

// Function BP_NPC_10701.BP_NPC_10701_C.OnNotifyEnd_F8A6752F4856446D3B1A56A29D520176
// 0x0008 (0x0008 - 0x0000)
struct BP_NPC_10701_C_OnNotifyEnd_F8A6752F4856446D3B1A56A29D520176 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_NPC_10701_C_OnNotifyEnd_F8A6752F4856446D3B1A56A29D520176;

}

