#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_NPC_10601

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HTGame_structs.hpp"
#include "BP_DialogueNPC_Sub_106_World_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_NPC_10601.BP_NPC_10601_C
// 0x01C0 (0x34A0 - 0x32E0)
class ABP_NPC_10601_C final : public ABP_DialogueNPC_Sub_106_World_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x32E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBPBubbleComponent_C*                   BPBubbleComponent;                                 // 0x32E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FNPCMsgID                              Msg;                                               // 0x32F0(0x0190)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FName                                   Actor_Tag;                                         // 0x3480(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           Check_If_Rain;                                     // 0x3488(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          Is_Fade;                                           // 0x3490(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ReceiveBeginPlay();
	void OnNotifyEnd_B60B7D5940BC902D8481F3AA5EBA5C7A(class FName NotifyName);
	void OnNotifyEnd_5F2B21574EC3E669DC60838A8B7A77B3(class FName NotifyName);
	void OnNotifyEnd_2E2489534C989B3A7C236EAA63838068(class FName NotifyName);
	void OnNotifyBegin_B60B7D5940BC902D8481F3AA5EBA5C7A(class FName NotifyName);
	void OnNotifyBegin_5F2B21574EC3E669DC60838A8B7A77B3(class FName NotifyName);
	void OnNotifyBegin_2E2489534C989B3A7C236EAA63838068(class FName NotifyName);
	void OnInterrupted_B60B7D5940BC902D8481F3AA5EBA5C7A(class FName NotifyName);
	void OnInterrupted_5F2B21574EC3E669DC60838A8B7A77B3(class FName NotifyName);
	void OnInterrupted_2E2489534C989B3A7C236EAA63838068(class FName NotifyName);
	void OnCompleted_B60B7D5940BC902D8481F3AA5EBA5C7A(class FName NotifyName);
	void OnCompleted_5F2B21574EC3E669DC60838A8B7A77B3(class FName NotifyName);
	void OnCompleted_2E2489534C989B3A7C236EAA63838068(class FName NotifyName);
	void OnBlendOut_B60B7D5940BC902D8481F3AA5EBA5C7A(class FName NotifyName);
	void OnBlendOut_5F2B21574EC3E669DC60838A8B7A77B3(class FName NotifyName);
	void OnBlendOut_2E2489534C989B3A7C236EAA63838068(class FName NotifyName);
	void Npc_Flee();
	void NPC_Confused();
	void ExecuteUbergraph_BP_NPC_10601(int32 EntryPoint);
	void CheckWeather();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_NPC_10601_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_NPC_10601_C")
	}
	static class ABP_NPC_10601_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_NPC_10601_C>();
	}
};
DUMPER7_ASSERTS_ABP_NPC_10601_C;

}

