#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Portal_Circle_OceanChase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HTGame_structs.hpp"
#include "BP_Portal_Circle_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Portal_Circle_OceanChase.BP_Portal_Circle_OceanChase_C
// 0x00D0 (0x0588 - 0x04B8)
class ABP_Portal_Circle_OceanChase_C final : public ABP_Portal_Circle_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Portal_Circle_OceanChase_C;      // 0x04B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          ProtectPoliceCarBox;                               // 0x04C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          CaptureFadeInBox;                                  // 0x04C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          TipBox;                                            // 0x04D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHTNiagaraComponent*                    NiagaraPortalFront;                                // 0x04D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   PlaneRef;                                          // 0x04E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Scale_Mask_011A22574E8BA75E6E44A4AB4BE7F28F;       // 0x04E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Scale__Direction_011A22574E8BA75E6E44A4AB4BE7F28F; // 0x04EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4ED[0x3];                                      // 0x04ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Scale;                                             // 0x04F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        BackPortalRelativeScale;                           // 0x04F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          TipCD;                                             // 0x0500(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_501[0x7];                                      // 0x0501(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Massege;                                           // 0x0508(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FName                                   HiddenTag;                                         // 0x0518(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ShowOnlyTag;                                       // 0x0520(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           标签;                                            // 0x0528(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TSoftObjectPtr<class ABP_InSpecialArea_ProtectionBox_C> ProtectBox;                              // 0x0538(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TArray<EVehicleKeyUseType>                    EmptyTypes;                                        // 0x0560(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<EVehicleKeyUseType>                    DesignedTypes;                                     // 0x0570(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FTimerHandle                           ProtectPoliceCar;                                  // 0x0580(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ActiveDynamicPortal();
	void BndEvt__BP_Portal_Circle_OceanChase_ProtectPoliceCarBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void BndEvt__BP_Portal_Circle_OceanChase_ProtectPoliceCarBox_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void BndEvt__BP_Portal_Circle_OceanChase_TipBox_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void CheckIfPlayerDrivingPoliceCar();
	void CollectHiddenActors();
	void CollectShowOnlyActors();
	void Cus_SwitchTriggerCollision(bool On);
	void DeactiveDynamicPortal();
	void ExecuteUbergraph_BP_Portal_Circle_OceanChase(int32 EntryPoint);
	void ReceiveBeginPlay();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ReceiveTick(float DeltaSeconds);
	void Scale__FinishedFunc();
	void Scale__UpdateFunc();
	void TestSetHiddenActorInvisi();
	void TestSetHiddenActorVisi();
	void TriggerSFX(class AHTPortaltActor* Portal);

	class UBoxComponent* GetTextureBlendTriggerBox() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Portal_Circle_OceanChase_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Portal_Circle_OceanChase_C")
	}
	static class ABP_Portal_Circle_OceanChase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Portal_Circle_OceanChase_C>();
	}
};
DUMPER7_ASSERTS_ABP_Portal_Circle_OceanChase_C;

}

