#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_StoreSiteTestingAppoint

#include "Basic.hpp"

#include "HTGame_structs.hpp"


namespace SDK::Params
{

// Function BP_StoreSiteTestingAppoint.BP_StoreSiteTestingAppoint_C.BPGetInteractEntries
// 0x01A0 (0x01A0 - 0x0000)
struct BP_StoreSiteTestingAppoint_C_BPGetInteractEntries final
{
public:
	class AHTPlayerController*                    ByPC;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FInteractEntry>                 OutInteractEntries;                                // 0x0008(0x0010)(Parm, OutParm, ContainsInstancedReference)
	TArray<struct FInteractEntry>                 NewLocalVar;                                       // 0x0018(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	struct FInteractEntry                         K2Node_MakeStruct_InteractEntry;                   // 0x0028(0x0168)(ContainsInstancedReference)
	TArray<struct FInteractEntry>                 K2Node_MakeArray_Array;                            // 0x0190(0x0010)(ReferenceParm, ContainsInstancedReference)
};
DUMPER7_ASSERTS_BP_StoreSiteTestingAppoint_C_BPGetInteractEntries;

}

