#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_StoreBrandHeadLogoActor_small

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_StoreBrandHeadLogoActor1_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_StoreBrandHeadLogoActor_small.BP_StoreBrandHeadLogoActor_small_C
// 0x0058 (0x0C20 - 0x0BC8)
class ABP_StoreBrandHeadLogoActor_small_C final : public ABP_StoreBrandHeadLogoActor1_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0BC8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          Box;                                               // 0x0BD0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_4Slight_ZYF;                                    // 0x0BD8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   PointLight;                                        // 0x0BE0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_4Slight_ZYF2;                                   // 0x0BE8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_4Slight_ZYF1;                                   // 0x0BF0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Store_Brand_light;                                 // 0x0BF8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLight2;                                        // 0x0C00(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLight1;                                        // 0x0C08(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLight;                                         // 0x0C10(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        Decal;                                             // 0x0C18(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void BP_LoadStoreBrandHeadLogo();
	void BP_UnLoadStoreBrandHeadLogo();
	void ExecuteUbergraph_BP_StoreBrandHeadLogoActor_small(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_StoreBrandHeadLogoActor_small_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_StoreBrandHeadLogoActor_small_C")
	}
	static class ABP_StoreBrandHeadLogoActor_small_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_StoreBrandHeadLogoActor_small_C>();
	}
};
DUMPER7_ASSERTS_ABP_StoreBrandHeadLogoActor_small_C;

}

