#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_StoreOnlineUIAnimationActor

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HTGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_StoreOnlineUIAnimationActor.BP_StoreOnlineUIAnimationActor_C
// 0x0038 (0x0BB8 - 0x0B80)
class ABP_StoreOnlineUIAnimationActor_C final : public AHTStoreOnlineUIAnimationActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B80(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         Timeline_1_NewTrack_0_BD008E7B481A8C4EAB86E69567255F22; // 0x0B88(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_1__Direction_BD008E7B481A8C4EAB86E69567255F22; // 0x0B8C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B8D[0x3];                                      // 0x0B8D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_1;                                        // 0x0B90(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_NewTrack_0_DC1002FA4F9AF193851AA2A0DC3844EB; // 0x0B98(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_DC1002FA4F9AF193851AA2A0DC3844EB; // 0x0B9C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9D[0x3];                                      // 0x0B9D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x0BA0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_NewTrack_0_2838DB0D47EF7B4F523B51831C51C49E; // 0x0BA8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline__Direction_2838DB0D47EF7B4F523B51831C51C49E; // 0x0BAC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BAD[0x3];                                      // 0x0BAD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline;                                          // 0x0BB0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void BP_PlayBreadAnimation(class UHTUI_StoreBrandOnlineMainForm* InStoreBrandOnlineMainForm, const struct FVector2D& InCurPosition, const struct FVector2D& InTargetPosition);
	void BP_PlayCakeAnimation(class UHTUI_StoreBrandOnlineMainForm* InStoreBrandOnlineMainForm, const struct FVector2D& InCurPosition, const struct FVector2D& InTargetPosition);
	void BP_PlayCoffeeAnimation(class UHTUI_StoreBrandOnlineMainForm* InStoreBrandOnlineMainForm, const struct FVector2D& InCurPosition, const struct FVector2D& InTargetPosition);
	void ExecuteUbergraph_BP_StoreOnlineUIAnimationActor(int32 EntryPoint);
	void Timeline_0__FinishedFunc();
	void Timeline_0__UpdateFunc();
	void Timeline_1__FinishedFunc();
	void Timeline_1__UpdateFunc();
	void Timeline__FinishedFunc();
	void Timeline__UpdateFunc();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_StoreOnlineUIAnimationActor_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_StoreOnlineUIAnimationActor_C")
	}
	static class ABP_StoreOnlineUIAnimationActor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_StoreOnlineUIAnimationActor_C>();
	}
};
DUMPER7_ASSERTS_ABP_StoreOnlineUIAnimationActor_C;

}

