#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SkeletalLowVehicle_Bus_Base

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_SkeletalLowVehicle_Bus_Base.BP_SkeletalLowVehicle_Bus_Base_C.UserConstructionScript
// 0x0030 (0x0030 - 0x0000)
struct BP_SkeletalLowVehicle_Bus_Base_C_UserConstructionScript final
{
public:
	class AHTVehicleLightActor*                   K2Node_DynamicCast_AsHTVehicle_Light_Actor;        // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHTVehicleLightActor*                   K2Node_DynamicCast_AsHTVehicle_Light_Actor_1;      // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AHTVehicleLightActor*>           K2Node_MakeArray_Array;                            // 0x0020(0x0010)(ReferenceParm)
};
DUMPER7_ASSERTS_BP_SkeletalLowVehicle_Bus_Base_C_UserConstructionScript;

}

