#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SellerSank

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "HTGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_SellerSank.BP_SellerSank_C
// 0x0110 (0x0C90 - 0x0B80)
class ABP_SellerSank_C final : public AHTVisualActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B80(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   StaticMesh7;                                       // 0x0B88(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh6;                                       // 0x0B90(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh5;                                       // 0x0B98(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh4;                                       // 0x0BA0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh3;                                       // 0x0BA8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh2;                                       // 0x0BB0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh1;                                       // 0x0BB8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Niagara;                                           // 0x0BC0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshRoot;                                    // 0x0BC8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UObject>                 Pebbles;                                           // 0x0BD0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UObject>                 AK;                                                // 0x0BF8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	double                                        DelayTime;                                         // 0x0C20(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class AStaticMeshActor>        RelatedMesh;                                       // 0x0C28(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FVector                                InitialLoc;                                        // 0x0C50(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class AStaticMeshActor>        RelatedMeshStair;                                  // 0x0C68(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)

public:
	void Cus_Sink();
	void ExecuteUbergraph_BP_SellerSank(int32 EntryPoint);
	void OnLoaded_100433F541EDC95D45F160A572E9EDE0(class UObject* Loaded);
	void OnLoaded_2728F00C40E7D1BFE2F5A5974562D3F1(class UObject* Loaded);
	void OnLoaded_CF4662AE498F6A7E06A36DA7AE72F2E1(class UObject* Loaded);
	void OnLoaded_D26588E341E8AA1911DE95AC2FC5A4E4(class UObject* Loaded);
	void ReceiveBeginPlay();
	void SetRelative(class UStaticMeshComponent* MeshComp);
	void StoneMove(class UStaticMeshComponent* MeshComp);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_SellerSank_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_SellerSank_C")
	}
	static class ABP_SellerSank_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_SellerSank_C>();
	}
};
DUMPER7_ASSERTS_ABP_SellerSank_C;

}

