#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SnowWeather_CVarVolume

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_SnowWeather_CVarVolume.BP_SnowWeather_CVarVolume_C.ExecuteUbergraph_BP_SnowWeather_CVarVolume
// 0x0030 (0x0030 - 0x0000)
struct BP_SnowWeather_CVarVolume_C_ExecuteUbergraph_BP_SnowWeather_CVarVolume final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsClientOrStandalone_ReturnValue;         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool bSnowy)>                  K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bSnowy;                         // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_SnowWeather_CVarVolume_C_ExecuteUbergraph_BP_SnowWeather_CVarVolume;

// Function BP_SnowWeather_CVarVolume.BP_SnowWeather_CVarVolume_C.OnWheaterSnowStateChangeDelegate_Event
// 0x0001 (0x0001 - 0x0000)
struct BP_SnowWeather_CVarVolume_C_OnWheaterSnowStateChangeDelegate_Event final
{
public:
	bool                                          bSnowy;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_SnowWeather_CVarVolume_C_OnWheaterSnowStateChangeDelegate_Event;

}

