#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SkeletalLowResVehicle_Base

#include "Basic.hpp"

#include "HTGame_structs.hpp"
#include "HTGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_SkeletalLowResVehicle_Base.BP_SkeletalLowResVehicle_Base_C
// 0x0040 (0x0770 - 0x0730)
#pragma pack(push, 0x1)
class alignas(0x10) ABP_SkeletalLowResVehicle_Base_C : public AHTLowResVehicleBase
{
public:
	uint8                                         Pad_728[0x8];                                      // 0x0728(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   CollisionMesh;                                     // 0x0730(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHTAIRVOComponent*                      HTAIRVO;                                           // 0x0738(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   FrontLight_L;                                      // 0x0740(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   FrontLight_R;                                      // 0x0748(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UVehicleDeformableComponent*            VehicleDeformable;                                 // 0x0750(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UMassTrafficVehicleComponent*           MassTrafficVehicle;                                // 0x0758(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SkeletalMesh;                                      // 0x0760(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_SkeletalLowResVehicle_Base_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_SkeletalLowResVehicle_Base_C")
	}
	static class ABP_SkeletalLowResVehicle_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_SkeletalLowResVehicle_Base_C>();
	}
};
#pragma pack(pop)
DUMPER7_ASSERTS_ABP_SkeletalLowResVehicle_Base_C;

}

