#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TrafficMonsterPerformanceState_Mon_015

#include "Basic.hpp"

#include "HTGame_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_TrafficMonsterPerformanceState_Mon_015.BP_TrafficMonsterPerformanceState_Mon_015_C.ExecuteUbergraph_BP_TrafficMonsterPerformanceState_Mon_015
// 0x02E0 (0x02E0 - 0x0000)
struct BP_TrafficMonsterPerformanceState_Mon_015_C_ExecuteUbergraph_BP_TrafficMonsterPerformanceState_Mon_015 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UNiagaraComponent* SpawnedComp)> K2Node_CreateDelegate_OutputDelegate;      // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      Temp_object_Variable;                              // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded_1;                       // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_1;                            // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         K2Node_DynamicCast_AsNiagara__;                    // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_2;                            // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          K2Node_DynamicCast_AsAk_Audio_Event;               // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostEventGlobal_ReturnValue;              // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTrafficMonsterTranslateParams         K2Node_Event_Params_1;                             // 0x0060(0x0060)(ConstParm, NoDestructor)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x00C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x00E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x00F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHTGameplayEffectTask_AsyncSpawnEmitter* CallFunc_AsyncTaskSpawnEmitterAtLocation_ReturnValue; // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119[0x3];                                      // 0x0119(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_TrafficMonsterIndex_2;                // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTrafficMonsterTranslateParams         K2Node_Event_Params;                               // 0x0120(0x0060)(ConstParm, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location_1;                // 0x0180(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation_1;                // 0x0198(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale_1;                   // 0x01B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue_1; // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C9[0x7];                                      // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x01D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue_2; // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D9[0x3];                                      // 0x01D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_1;            // 0x01DC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1EC[0x4];                                      // 0x01EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Volume_1;                             // 0x01F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHTPlayerState*                         CallFunc_GetClientPlayerState_ReturnValue;         // 0x01F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasEncounteredTrafficMonster_ReturnValue; // 0x0201(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_202[0x6];                                      // 0x0202(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Volume;                               // 0x0208(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_TrafficMonsterIndex_1;                // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_214[0x4];                                      // 0x0214(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AHTPlayerState*                         CallFunc_GetClientPlayerState_ReturnValue_1;       // 0x0218(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      K2Node_CustomEvent_SpawnedComp;                    // 0x0220(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_229[0x7];                                      // 0x0229(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHTPlayerState*                         CallFunc_GetClientPlayerState_ReturnValue_2;       // 0x0230(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHTTrafficMonsterSpawnAIState*          CallFunc_FindActiveAIState_ReturnValue;            // 0x0238(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHTTrafficMonsterMapIconState*          K2Node_DynamicCast_AsMapIcon_State;                // 0x0240(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasEncounteredTrafficMonster_ReturnValue_1; // 0x0249(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24A[0x6];                                      // 0x024A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UHTTrafficMonsterSpawnAIState*          CallFunc_FindActiveAIState_ReturnValue_1;          // 0x0250(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHTTrafficMonsterSpawnAIState*          CallFunc_FindActiveAIState_ReturnValue_2;          // 0x0258(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHTTrafficMonsterMapIconState*          K2Node_DynamicCast_AsMapIcon_State_1;              // 0x0260(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_269[0x7];                                      // 0x0269(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHTTrafficMonsterMapIconState*          K2Node_DynamicCast_AsMapIcon_State_2;              // 0x0270(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_279[0x3];                                      // 0x0279(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_TrafficMonsterIndex;                  // 0x027C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHTPlayerState*                         CallFunc_GetClientPlayerState_ReturnValue_3;       // 0x0280(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_289[0x3];                                      // 0x0289(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_2;            // 0x028C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29C[0x4];                                      // 0x029C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHTTrafficMonsterSpawnAIState*          CallFunc_FindActiveAIState_ReturnValue_3;          // 0x02A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasEncounteredTrafficMonster_ReturnValue_2; // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A9[0x7];                                      // 0x02A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHTTrafficMonsterMapIconState*          K2Node_DynamicCast_AsMapIcon_State_3;              // 0x02B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B9[0x7];                                      // 0x02B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 CallFunc_GetAllTrafficMonsterIndex_OutIndex;       // 0x02C0(0x0010)(ReferenceParm)
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue;             // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D1[0x3];                                      // 0x02D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Get_Item;                           // 0x02D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_TrafficMonsterPerformanceState_Mon_015_C_ExecuteUbergraph_BP_TrafficMonsterPerformanceState_Mon_015;

// Function BP_TrafficMonsterPerformanceState_Mon_015.BP_TrafficMonsterPerformanceState_Mon_015_C.OnEmitterSpawned_E1E9A1344E98129105E20DA51EAA96F1
// 0x0008 (0x0008 - 0x0000)
struct BP_TrafficMonsterPerformanceState_Mon_015_C_OnEmitterSpawned_E1E9A1344E98129105E20DA51EAA96F1 final
{
public:
	class UNiagaraComponent*                      SpawnedComp;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_TrafficMonsterPerformanceState_Mon_015_C_OnEmitterSpawned_E1E9A1344E98129105E20DA51EAA96F1;

// Function BP_TrafficMonsterPerformanceState_Mon_015.BP_TrafficMonsterPerformanceState_Mon_015_C.OnEnterTriggerVolume
// 0x0008 (0x0008 - 0x0000)
struct BP_TrafficMonsterPerformanceState_Mon_015_C_OnEnterTriggerVolume final
{
public:
	class AActor*                                 Volume;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_TrafficMonsterPerformanceState_Mon_015_C_OnEnterTriggerVolume;

// Function BP_TrafficMonsterPerformanceState_Mon_015.BP_TrafficMonsterPerformanceState_Mon_015_C.OnExitTriggerVolume
// 0x0008 (0x0008 - 0x0000)
struct BP_TrafficMonsterPerformanceState_Mon_015_C_OnExitTriggerVolume final
{
public:
	class AActor*                                 Volume;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_TrafficMonsterPerformanceState_Mon_015_C_OnExitTriggerVolume;

// Function BP_TrafficMonsterPerformanceState_Mon_015.BP_TrafficMonsterPerformanceState_Mon_015_C.OnLoaded_2BCB620D46AC8881432357BA9737A012
// 0x0008 (0x0008 - 0x0000)
struct BP_TrafficMonsterPerformanceState_Mon_015_C_OnLoaded_2BCB620D46AC8881432357BA9737A012 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_TrafficMonsterPerformanceState_Mon_015_C_OnLoaded_2BCB620D46AC8881432357BA9737A012;

// Function BP_TrafficMonsterPerformanceState_Mon_015.BP_TrafficMonsterPerformanceState_Mon_015_C.OnLoaded_CBC24F73494CF5F1DBAD81A850FCA425
// 0x0008 (0x0008 - 0x0000)
struct BP_TrafficMonsterPerformanceState_Mon_015_C_OnLoaded_CBC24F73494CF5F1DBAD81A850FCA425 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_TrafficMonsterPerformanceState_Mon_015_C_OnLoaded_CBC24F73494CF5F1DBAD81A850FCA425;

// Function BP_TrafficMonsterPerformanceState_Mon_015.BP_TrafficMonsterPerformanceState_Mon_015_C.OnPostPlaySpawnMonsterPerformance
// 0x0060 (0x0060 - 0x0000)
struct BP_TrafficMonsterPerformanceState_Mon_015_C_OnPostPlaySpawnMonsterPerformance final
{
public:
	struct FTrafficMonsterTranslateParams         Params_0;                                          // 0x0000(0x0060)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
DUMPER7_ASSERTS_BP_TrafficMonsterPerformanceState_Mon_015_C_OnPostPlaySpawnMonsterPerformance;

// Function BP_TrafficMonsterPerformanceState_Mon_015.BP_TrafficMonsterPerformanceState_Mon_015_C.OnPostSpawnedAI
// 0x0004 (0x0004 - 0x0000)
struct BP_TrafficMonsterPerformanceState_Mon_015_C_OnPostSpawnedAI final
{
public:
	int32                                         TrafficMonsterIndex;                               // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_TrafficMonsterPerformanceState_Mon_015_C_OnPostSpawnedAI;

// Function BP_TrafficMonsterPerformanceState_Mon_015.BP_TrafficMonsterPerformanceState_Mon_015_C.OnPostSpawnedMass
// 0x0004 (0x0004 - 0x0000)
struct BP_TrafficMonsterPerformanceState_Mon_015_C_OnPostSpawnedMass final
{
public:
	int32                                         TrafficMonsterIndex;                               // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_TrafficMonsterPerformanceState_Mon_015_C_OnPostSpawnedMass;

// Function BP_TrafficMonsterPerformanceState_Mon_015.BP_TrafficMonsterPerformanceState_Mon_015_C.OnPreSpawnedAI
// 0x0070 (0x0070 - 0x0000)
struct BP_TrafficMonsterPerformanceState_Mon_015_C_OnPreSpawnedAI final
{
public:
	int32                                         TrafficMonsterIndex;                               // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0xC];                                        // 0x0004(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTrafficMonsterTranslateParams         Params_0;                                          // 0x0010(0x0060)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
DUMPER7_ASSERTS_BP_TrafficMonsterPerformanceState_Mon_015_C_OnPreSpawnedAI;

}

