#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Taxi_NPC_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_DialogueNPC_Base_classes.hpp"
#include "HTGame_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Taxi_NPC_Base.BP_Taxi_NPC_Base_C
// 0x0040 (0x31C0 - 0x3180)
class ABP_Taxi_NPC_Base_C final : public ABP_DialogueNPC_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Taxi_NPC_Base_C;                 // 0x3178(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBPBubbleComponent_C*                   BPBubbleComponent;                                 // 0x3180(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHTMotionWarpingComponent*              HTMotionWarping;                                   // 0x3188(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UContextualAnimSceneActorComponent*     ContextualAnimSceneActor;                          // 0x3190(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHTToonLightComponent*                  HTToonLight;                                       // 0x3198(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          genda;                                             // 0x31A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Bubble_Weak;                                       // 0x31A1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Bubble_Strong;                                     // 0x31A2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31A3[0x5];                                     // 0x31A3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AHTWheeledVehicleDrivable*              Vehicle;                                           // 0x31A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          Looking;                                           // 0x31B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CD;                                                // 0x31B1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31B2[0x2];                                     // 0x31B2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   NPC_ID;                                            // 0x31B4(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Bubble_Bye();
	void Bubble_Complain();
	void Bubble_Hello();
	void Bubble_Random();
	void DestroyNPC();
	void ExecuteUbergraph_BP_Taxi_NPC_Base(int32 EntryPoint);
	void Random_Idle();
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void Satisfaction_Change(float SatisfactionPercent);
	void Set_Bubble_Strong();
	void Set_Bubble_Weak();
	void Taxi(const class FName& TaxiOrderID, ETaxiGameplayState CurTaxiGameplayState);
	void Vehicle_hit(const struct FHTAIAccumulatedHitRecord& HitRecord);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Taxi_NPC_Base_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Taxi_NPC_Base_C")
	}
	static class ABP_Taxi_NPC_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Taxi_NPC_Base_C>();
	}
};
DUMPER7_ASSERTS_ABP_Taxi_NPC_Base_C;

}

