#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TrainBarrierGate

#include "Basic.hpp"

#include "MassTraffic_structs.hpp"


namespace SDK::Params
{

// Function BP_TrainBarrierGate.BP_TrainBarrierGate_C.ExecuteUbergraph_BP_TrainBarrierGate
// 0x001C (0x001C - 0x0000)
struct BP_TrainBarrierGate_C_ExecuteUbergraph_BP_TrainBarrierGate final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMassTrafficLightStateFlags                   Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMassTrafficLightStateFlags                   Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bOpen;                          // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bOpen)>                   K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EMassTrafficLightStateFlags                   K2Node_Select_Default;                             // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsClientOrStandalone_ReturnValue;         // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_TrainBarrierGate_C_ExecuteUbergraph_BP_TrainBarrierGate;

// Function BP_TrainBarrierGate.BP_TrainBarrierGate_C.OnTrafficLightOpenChanged
// 0x0001 (0x0001 - 0x0000)
struct BP_TrainBarrierGate_C_OnTrafficLightOpenChanged final
{
public:
	bool                                          bOpen;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_TrainBarrierGate_C_OnTrafficLightOpenChanged;

}

