#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TriggerSequencePlayer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "MovieScene_structs.hpp"
#include "HTGame_structs.hpp"
#include "HTGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_TriggerSequencePlayer.BP_TriggerSequencePlayer_C
// 0x00E0 (0x0C60 - 0x0B80)
class ABP_TriggerSequencePlayer_C final : public AHTVisualActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B80(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBillboardComponent*                    Billboard;                                         // 0x0B88(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box;                                               // 0x0B90(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class ULevelSequence>          SequenceToPlay;                                    // 0x0B98(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	bool                                          Retrigger_;                                        // 0x0BC0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC1[0x7];                                      // 0x0BC1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              PlayFinished;                                      // 0x0BC8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          PauseAtEnd_;                                       // 0x0BD8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HidePlayer_;                                       // 0x0BD9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMovieSceneCompletionModeOverride             CompletionState;                                   // 0x0BDA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BDB[0x5];                                      // 0x0BDB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        DelayTime;                                         // 0x0BE0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FMovieSceneObjectBindingID>     NewVar;                                            // 0x0BE8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMulticastInlineDelegate<void()>              TriggerPlay;                                       // 0x0BF8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class ALevelSequenceActor*                    CurrentPlayer;                                     // 0x0C08(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          NeedCameraBlend_;                                  // 0x0C10(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C11[0x7];                                      // 0x0C11(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACameraActor*                           Camera;                                            // 0x0C18(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	double                                        BlendInTime;                                       // 0x0C20(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        BlendOutTime;                                      // 0x0C28(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        HoldTime;                                          // 0x0C30(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PlayToFrame;                                       // 0x0C38(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NeedVoiceTips_;                                    // 0x0C3C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C3D[0x3];                                      // 0x0C3D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   DebugVoiceMsg;                                     // 0x0C40(0x0010)(Edit, BlueprintVisible)
	double                                        VoiceStartDelay;                                   // 0x0C50(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsInside_;                                         // 0x0C58(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void StopSequence(bool ToStart_);
	void ResetSequencePlayer();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void PlaySequence();
	void JumpToEnd();
	void JumpTo(double ToSubFrame, int32 ToFrameNumber, double Time);
	void FromFrameTo();
	void FinishStopPlaying();
	void ExecuteUbergraph_BP_TriggerSequencePlayer(int32 EntryPoint);
	void EndDestroy();
	void Completed_E284F72344C4C51B2AA45BAA838840D0(class ALevelSequenceActor* LevelSequenceActor, class ULevelSequencePlayer* LevelSequencePlayer);
	void Completed_851A67A34D2962400F547A91DA4D73CD(class ALevelSequenceActor* LevelSequenceActor, class ULevelSequencePlayer* LevelSequencePlayer);
	void Completed_4F84CBC948E8E59A59041AA68A08EA76(class ALevelSequenceActor* LevelSequenceActor, class ULevelSequencePlayer* LevelSequencePlayer);
	void ChangeCollision();
	void BPOnMainRoleLoadFinished(class AHTPlayerState* PlayerState);
	void BndEvt__BP_TriggerSequencePlayer_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_TriggerSequencePlayer_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_TriggerSequencePlayer_C")
	}
	static class ABP_TriggerSequencePlayer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_TriggerSequencePlayer_C>();
	}
};
DUMPER7_ASSERTS_ABP_TriggerSequencePlayer_C;

}

