#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Trigger_UnloadDTMotoBoss

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HTGame_structs.hpp"
#include "HTGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Trigger_UnloadDTMotoBoss.BP_Trigger_UnloadDTMotoBoss_C
// 0x0078 (0x0BF8 - 0x0B80)
class ABP_Trigger_UnloadDTMotoBoss_C final : public AHTVisualActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B80(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBillboardComponent*                    Billboard;                                         // 0x0B88(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDataLayerAsset*                        ToUnloadLoadDT;                                    // 0x0B90(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ATriggerVolume*                         TriggerVolume;                                     // 0x0B98(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class FString                                 VisionID;                                          // 0x0BA0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class ABP_Vehicle_Base_C*                     PlayerVeh;                                         // 0x0BB0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bMusicPlaying_;                                    // 0x0BB8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BB9[0x7];                                      // 0x0BB9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_TriggerCleanVehicle_Boss013_C*      RelatedCleaner;                                    // 0x0BC0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class UDataLayerAsset*                        ToUnloadLoadDT_Race;                               // 0x0BC8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UAkAudioEvent>           Boss13_BgmEvent;                                   // 0x0BD0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void BndEvt__BP_Trigger_UnloadDTMotoBoss_TriggerVolume_K2Node_ComponentBoundEvent_1_ActorBeginOverlapSignature__DelegateSignature(class AActor* OverlappedActor, class AActor* OtherActor);
	void BndEvt__BP_Trigger_UnloadDTMotoBoss_TriggerVolume_K2Node_ComponentBoundEvent_2_ActorEndOverlapSignature__DelegateSignature(class AActor* OverlappedActor, class AActor* OtherActor);
	void BPOnMainRoleLoadFinished(class AHTPlayerState* PlayerState);
	void Cus_ResetTimeUnload();
	void ExecuteUbergraph_BP_Trigger_UnloadDTMotoBoss(int32 EntryPoint);
	void OnDelegateMessageHourChange(int32 Hour);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Trigger_UnloadDTMotoBoss_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Trigger_UnloadDTMotoBoss_C")
	}
	static class ABP_Trigger_UnloadDTMotoBoss_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Trigger_UnloadDTMotoBoss_C>();
	}
};
DUMPER7_ASSERTS_ABP_Trigger_UnloadDTMotoBoss_C;

}

