#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Vehicle_018_Hight

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Vehicle_018_Hight.BP_Vehicle_018_Hight_C.BndEvt__BP_Vehicle_018_Hight_VehicleDeformable_K2Node_ComponentBoundEvent_0_OnVehicleExplode__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_Vehicle_018_Hight_C_BndEvt__BP_Vehicle_018_Hight_VehicleDeformable_K2Node_ComponentBoundEvent_0_OnVehicleExplode__DelegateSignature final
{
public:
	class AActor*                                 TargetVehicle;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Vehicle_018_Hight_C_BndEvt__BP_Vehicle_018_Hight_VehicleDeformable_K2Node_ComponentBoundEvent_0_OnVehicleExplode__DelegateSignature;

// Function BP_Vehicle_018_Hight.BP_Vehicle_018_Hight_C.ExecuteUbergraph_BP_Vehicle_018_Hight
// 0x0020 (0x0020 - 0x0000)
struct BP_Vehicle_018_Hight_C_ExecuteUbergraph_BP_Vehicle_018_Hight final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UChaosWheeledVehicleMovementComponent*  K2Node_DynamicCast_AsChaos________;                // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_ComponentBoundEvent_TargetVehicle;          // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Vehicle_018_Hight_C_ExecuteUbergraph_BP_Vehicle_018_Hight;

}

