#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_WA011

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HTGame_structs.hpp"
#include "HTGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_WA011.BP_WA011_C
// 0x0050 (0x0BD0 - 0x0B80)
class ABP_WA011_C final : public AHTVisualActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B80(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USphereComponent*                       BubbleSphere;                                      // 0x0B88(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPBubbleComponent_C*                   BPBubbleComponent;                                 // 0x0B90(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       Sphere;                                            // 0x0B98(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_LacrimosaCase_01_Top;                           // 0x0BA0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_LacrimosaCase_01_Bottom;                        // 0x0BA8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FText                                   In_Msg;                                            // 0x0BB0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FNPCMsgID>                      Msg_Arr;                                           // 0x0BC0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_BP_WA011(int32 EntryPoint);
	void BPInteractFinished(class AHTPlayerController* ByPC, int32 InteractIndex);
	void BPGetInteractEntries(class AHTPlayerController* ByPC, TArray<struct FInteractEntry>* OutInteractEntries);
	void BndEvt__BP_WA011_BubbleSphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_WA011_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_WA011_C")
	}
	static class ABP_WA011_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_WA011_C>();
	}
};
DUMPER7_ASSERTS_ABP_WA011_C;

}

