#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPUI_StrengthBar

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HTGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BPUI_StrengthBar.BPUI_StrengthBar_C
// 0x0088 (0x0FA0 - 0x0F18)
class UBPUI_StrengthBar_C final : public UHTUI_StrengthBar
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0F18(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_Fx_2;                                        // 0x0F20(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Fx_1;                                        // 0x0F28(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Fx;                                          // 0x0F30(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_34;                                          // 0x0F38(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       ChargeAnim;                                        // 0x0F40(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       BarAnim_Loop;                                      // 0x0F48(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	TMap<int32, class UNiagaraSystem*>            NiagaraMap;                                        // 0x0F50(0x0050)(Edit, BlueprintVisible)

public:
	void BP_PlayStrengthUIEffect(float StrengthPercent);
	void ExecuteUbergraph_BPUI_StrengthBar(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BPUI_StrengthBar_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BPUI_StrengthBar_C")
	}
	static class UBPUI_StrengthBar_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPUI_StrengthBar_C>();
	}
};
DUMPER7_ASSERTS_UBPUI_StrengthBar_C;

}

