#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPUI_MiniMap

#include "Basic.hpp"


namespace SDK::Params
{

// Function BPUI_MiniMap.BPUI_MiniMap_C.BP_SetInterferValue
// 0x0004 (0x0004 - 0x0000)
struct BPUI_MiniMap_C_BP_SetInterferValue final
{
public:
	float                                         InInterferValue;                                   // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPUI_MiniMap_C_BP_SetInterferValue;

// Function BPUI_MiniMap.BPUI_MiniMap_C.ExecuteUbergraph_BPUI_MiniMap
// 0x0018 (0x0018 - 0x0000)
struct BPUI_MiniMap_C_ExecuteUbergraph_BPUI_MiniMap final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_InInterferValue;                      // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetEffectMaterial_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPUI_MiniMap_C_ExecuteUbergraph_BPUI_MiniMap;

}

