#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPWeaponAnimBase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "HTGame_structs.hpp"
#include "HTGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass BPWeaponAnimBase.BPWeaponAnimBase_C
// 0x0CB0 (0x1120 - 0x0470)
class UBPWeaponAnimBase_C : public UWeaponAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0470(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0478(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0480(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x0488(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x04A8(0x00B8)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0560(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_9;                  // 0x0580(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_8;                  // 0x05A8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_7;                  // 0x05D0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6;                  // 0x05F8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5;                  // 0x0620(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4;                  // 0x0648(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x0670(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x0698(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_5;                    // 0x06C0(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_7;                       // 0x0708(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4;                    // 0x0728(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_6;                       // 0x0770(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x0790(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_5;                       // 0x07D8(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x07F8(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_4;                       // 0x0840(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x0860(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0x08A8(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_2;                      // 0x08C8(0x00C8)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x0990(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_2;                    // 0x09D8(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x0A58(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x0A80(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_4;                     // 0x0AA8(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0AD0(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x0B18(0x00E8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x0C00(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_3;                     // 0x0C20(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x0C48(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_1;                      // 0x0C68(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x0D30(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x0D50(0x00C8)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer;                     // 0x0E18(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1;                    // 0x0EE0(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0x0F60(0x0028)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend;                         // 0x0F88(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x1050(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x10D0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x10F8(0x0028)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void BPOwnerCharacterStateChange(EOwnerCharacterState NewState, EOwnerCharacterState OldState);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BPWeaponAnimBase_AnimGraphNode_TransitionResult_0CEE8C68457757D2A2EF17BE3B25F363();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BPWeaponAnimBase_AnimGraphNode_TransitionResult_1A7EF53A47AA2B3E4C44AC81FBC058B2();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BPWeaponAnimBase_AnimGraphNode_TransitionResult_2A67BE1649340A7BF6D7E69DCA568C1A();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BPWeaponAnimBase_AnimGraphNode_TransitionResult_317FDF614AEDC9BCD4E92D85159ABCE4();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BPWeaponAnimBase_AnimGraphNode_TransitionResult_5EFEF7C54BD2058042C5FA95DBD73EC6();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BPWeaponAnimBase_AnimGraphNode_TransitionResult_718F189B403124CEBCBD63AF9B84D842();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BPWeaponAnimBase_AnimGraphNode_TransitionResult_8C44C21C4891A84CE5FFF6900BF20811();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BPWeaponAnimBase_AnimGraphNode_TransitionResult_B5C3661D4A444ADB78E49CBB7F140040();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BPWeaponAnimBase_AnimGraphNode_TransitionResult_DCDA260F4FDADF2D476D57890D73F33F();
	void ExecuteUbergraph_BPWeaponAnimBase(int32 EntryPoint);
	void PhysicsAnimInterface(const struct FPoseLink& InPose, struct FPoseLink* PhysicsAnimInterface_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BPWeaponAnimBase_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BPWeaponAnimBase_C")
	}
	static class UBPWeaponAnimBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPWeaponAnimBase_C>();
	}
};
DUMPER7_ASSERTS_UBPWeaponAnimBase_C;

}

