#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BS_FluxCaptureVisibility

#include "Basic.hpp"

#include "BE_FluxCaptureVisibilityMode_structs.hpp"


namespace SDK
{

// UserDefinedStruct BS_FluxCaptureVisibility.BS_FluxCaptureVisibility
// 0x0038 (0x0038 - 0x0000)
struct FBS_FluxCaptureVisibility final
{
public:
	EBE_FluxCaptureVisibilityMode                 VisibilityMode_42_9273EC4643AD4C97A94CBCB277A4531E; // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ActorsWithTags_47_FB1C9D8B486CC31A912C34BC8E3BB996; // 0x0004(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TSoftClassPtr<class UClass>>           ActorsOfClass_46_F474F1354A588E438BA2FF9CD3391A78; // 0x0010(0x0010)(Edit, BlueprintVisible)
	TArray<TSoftObjectPtr<class AActor>>          ActorsReferences_50_4C28C99249390853BC748A99A92DADF8; // 0x0020(0x0010)(Edit, BlueprintVisible)
	bool                                          UseFoliageMeshes_63_108019E4475E89156CB35DA9D2A91E33; // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseInstancedMeshes_64_5640381C4A7506AD66F872A101E54AB7; // 0x0031(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ApplyBottomPlaneCap_40_C31ED51F4B8AA49C2D6869BAB750BD82; // 0x0032(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ApplyInteriorCap_66_17CEF7AF4E946F34D09884B50E8E5643; // 0x0033(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         ApplyEdgeBlend_54_09C8CBBB4483F8EE11879CBEE5246C09; // 0x0034(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FBS_FluxCaptureVisibility;

}

