#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BS_MeshDefinition

#include "Basic.hpp"

#include "ProceduralMeshComponent_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct BS_MeshDefinition.BS_MeshDefinition
// 0x0060 (0x0060 - 0x0000)
struct FBS_MeshDefinition final
{
public:
	TArray<int32>                                 Triangles_14_6262AA3F4E1CE218A85115AA4BE96C1C;     // 0x0000(0x0010)(Edit, BlueprintVisible)
	TArray<struct FVector>                        Vertices_15_E8AFE418453520476FA3CBA576C886DE;      // 0x0010(0x0010)(Edit, BlueprintVisible)
	TArray<struct FVector2D>                      TexCoords_16_4C629A5E484407F609EAB4932C6E33F0;     // 0x0020(0x0010)(Edit, BlueprintVisible)
	TArray<struct FVector>                        Normals_17_80A7A73240297AC2D8766FB9FC89FE85;       // 0x0030(0x0010)(Edit, BlueprintVisible)
	TArray<struct FLinearColor>                   Colors_19_5726C34D4367889BC6A2DFB5779F300E;        // 0x0040(0x0010)(Edit, BlueprintVisible)
	TArray<struct FProcMeshTangent>               Tangents_23_DF4C41A04FE61FAEA5266EBD5BFCFDA3;      // 0x0050(0x0010)(Edit, BlueprintVisible)
};
DUMPER7_ASSERTS_FBS_MeshDefinition;

}

