#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTService_CheckShouldFindCover

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BTService_CheckShouldFindCover.BTService_CheckShouldFindCover_C
// 0x0070 (0x0108 - 0x0098)
class UBTService_CheckShouldFindCover_C final : public UBTService_BlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0098(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FBlackboardKeySelector                 TargetActor;                                       // 0x00A0(0x0028)(Edit, BlueprintVisible)
	double                                        BulletNum;                                         // 0x00C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	double                                        Distance;                                          // 0x00D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	double                                        DistanceZ;                                         // 0x00D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBlackboardKeySelector                 ShouldFindCover;                                   // 0x00E0(0x0028)(Edit, BlueprintVisible)

public:
	void ExecuteUbergraph_BTService_CheckShouldFindCover(int32 EntryPoint);
	void ReceiveTickAI(class AAIController* OwnerController, class APawn* ControlledPawn, float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BTService_CheckShouldFindCover_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BTService_CheckShouldFindCover_C")
	}
	static class UBTService_CheckShouldFindCover_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTService_CheckShouldFindCover_C>();
	}
};
DUMPER7_ASSERTS_UBTService_CheckShouldFindCover_C;

}

