#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTService_ClearAlert

#include "Basic.hpp"


namespace SDK::Params
{

// Function BTService_ClearAlert.BTService_ClearAlert_C.ExecuteUbergraph_BTService_ClearAlert
// 0x0018 (0x0018 - 0x0000)
struct BTService_ClearAlert_C_ExecuteUbergraph_BTService_ClearAlert final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BTService_ClearAlert_C_ExecuteUbergraph_BTService_ClearAlert;

// Function BTService_ClearAlert.BTService_ClearAlert_C.ReceiveDeactivationAI
// 0x0010 (0x0010 - 0x0000)
struct BTService_ClearAlert_C_ReceiveDeactivationAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BTService_ClearAlert_C_ReceiveDeactivationAI;

}

