#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTService_ShouldAlert

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HTGame_structs.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BTService_ShouldAlert.BTService_ShouldAlert_C
// 0x0068 (0x0100 - 0x0098)
class UBTService_ShouldAlert_C final : public UBTService_BlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0098(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AHTAIController*                        HTAIController;                                    // 0x00A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FBlackboardKeySelector                 ShouldAlert;                                       // 0x00A8(0x0028)(Edit, BlueprintVisible)
	struct FBlackboardKeySelector                 AlertLocation;                                     // 0x00D0(0x0028)(Edit, BlueprintVisible)
	class AHTAICharacter*                         As_HTAICharacter;                                  // 0x00F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BTService_ShouldAlert(int32 EntryPoint);
	void GetTargetInRoomType(class UObject* Target, ERoomVolumeType* RoomVolume);
	void OnPerceptionUpdated(class AActor* Actor, const struct FAIStimulus& Stimulus);
	void ReceiveActivationAI(class AAIController* OwnerController, class APawn* ControlledPawn);
	void ReceiveDeactivationAI(class AAIController* OwnerController, class APawn* ControlledPawn);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BTService_ShouldAlert_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BTService_ShouldAlert_C")
	}
	static class UBTService_ShouldAlert_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTService_ShouldAlert_C>();
	}
};
DUMPER7_ASSERTS_UBTService_ShouldAlert_C;

}

