#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTTask_ModsSetFleeLoc

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HTGame_structs.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BTTask_ModsSetFleeLoc.BTTask_ModsSetFleeLoc_C
// 0x0080 (0x0128 - 0x00A8)
class UBTTask_ModsSetFleeLoc_C final : public UBTTask_BlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FBlackboardKeySelector                 TargetLoc;                                         // 0x00B0(0x0028)(Edit, BlueprintVisible)
	float                                         RandomRadius;                                      // 0x00D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBlackboardKeySelector                 FleeNearHome;                                      // 0x00E0(0x0028)(Edit, BlueprintVisible)
	struct FVector                                Random_Location;                                   // 0x0108(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHTAICharacter*                         As_HTAICharacter;                                  // 0x0120(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BTTask_ModsSetFleeLoc(int32 EntryPoint);
	void GetRandomPointInRadius(double Radius, const struct FVector& Origin, struct FVector* OutputPin);
	void ReceiveExecuteAI(class AAIController* OwnerController, class APawn* ControlledPawn);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BTTask_ModsSetFleeLoc_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BTTask_ModsSetFleeLoc_C")
	}
	static class UBTTask_ModsSetFleeLoc_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTTask_ModsSetFleeLoc_C>();
	}
};
DUMPER7_ASSERTS_UBTTask_ModsSetFleeLoc_C;

}

