#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTTask_Boss019StageSequence

#include "Basic.hpp"


namespace SDK::Params
{

// Function BTTask_Boss019StageSequence.BTTask_Boss019StageSequence_C.ExecuteUbergraph_BTTask_Boss019StageSequence
// 0x0028 (0x0028 - 0x0000)
struct BTTask_Boss019StageSequence_C_ExecuteUbergraph_BTTask_Boss019StageSequence final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class Aboss_19_BP_C*                          K2Node_DynamicCast_AsBoss_19_BP;                   // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BTTask_Boss019StageSequence_C_ExecuteUbergraph_BTTask_Boss019StageSequence;

// Function BTTask_Boss019StageSequence.BTTask_Boss019StageSequence_C.ReceiveExecuteAI
// 0x0010 (0x0010 - 0x0000)
struct BTTask_Boss019StageSequence_C_ReceiveExecuteAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BTTask_Boss019StageSequence_C_ReceiveExecuteAI;

}

