#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BulletActor_KuharaBranchPower

#include "Basic.hpp"


namespace SDK::Params
{

// Function BulletActor_KuharaBranchPower.BulletActor_KuharaBranchPower_C.ExecuteUbergraph_BulletActor_KuharaBranchPower
// 0x0020 (0x0020 - 0x0000)
struct BulletActor_KuharaBranchPower_C_ExecuteUbergraph_BulletActor_KuharaBranchPower final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHTAbilityCharacter*                    K2Node_DynamicCast_AsHTAbility_Character;          // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BulletActor_KuharaBranchPower_C_ExecuteUbergraph_BulletActor_KuharaBranchPower;

}

