#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CR_ClampProtect

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "ControlRig_classes.hpp"


namespace SDK
{

// RigVMBlueprintGeneratedClass CR_ClampProtect.CR_ClampProtect_C
// 0x0068 (0x0BD8 - 0x0B70)
class UCR_ClampProtect_C final : public UControlRig
{
public:
	struct FVector                                MinimumLocRelativeToPivot;                         // 0x0B70(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                MaximumLocRelativeToPivot;                         // 0x0B88(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MaxAngularDistance;                                // 0x0BA0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Target_Translation;                                // 0x0BA8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Target_Rotation;                                   // 0x0BC0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("CR_ClampProtect_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CR_ClampProtect_C")
	}
	static class UCR_ClampProtect_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCR_ClampProtect_C>();
	}
};
DUMPER7_ASSERTS_UCR_ClampProtect_C;

}

