#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: End_Chase_RemoveBoss

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "HTGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass End_Chase_RemoveBoss.End_Chase_RemoveBoss_C
// 0x0058 (0x0090 - 0x0038)
class UEnd_Chase_RemoveBoss_C final : public URollerCoasterEvent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0038(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class FName                                   Seq_name;                                          // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NewVar;                                            // 0x0048(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULevelSequence*                         NewVar_0;                                          // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UObject>                 Asset;                                             // 0x0068(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void BPTriggerEvent(class AHTAbilityCharacter* OwnerCharacter, const struct FVector& TriggerLocation);
	void ExecuteUbergraph_End_Chase_RemoveBoss(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("End_Chase_RemoveBoss_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"End_Chase_RemoveBoss_C")
	}
	static class UEnd_Chase_RemoveBoss_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEnd_Chase_RemoveBoss_C>();
	}
};
DUMPER7_ASSERTS_UEnd_Chase_RemoveBoss_C;

}

