#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_boss_019_ChangeStageSkill_BP

#include "Basic.hpp"


namespace SDK::Params
{

// Function GA_boss_019_ChangeStageSkill_BP.GA_boss_019_ChangeStageSkill_BP_C.ExecuteUbergraph_GA_boss_019_ChangeStageSkill_BP
// 0x0020 (0x0020 - 0x0000)
struct GA_boss_019_ChangeStageSkill_BP_C_ExecuteUbergraph_GA_boss_019_ChangeStageSkill_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue;  // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHTAICharacter*                         K2Node_DynamicCast_AsHTAICharacter;                // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_boss_019_ChangeStageSkill_BP_C_ExecuteUbergraph_GA_boss_019_ChangeStageSkill_BP;

// Function GA_boss_019_ChangeStageSkill_BP.GA_boss_019_ChangeStageSkill_BP_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_boss_019_ChangeStageSkill_BP_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_boss_019_ChangeStageSkill_BP_C_K2_OnEndAbility;

}

