#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_boss_01_act_07_startBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HTGame_structs.hpp"


namespace SDK::Params
{

// Function GA_boss_01_act_07_startBP.GA_boss_01_act_07_startBP_C.ExecuteUbergraph_GA_boss_01_act_07_startBP
// 0x04B0 (0x04B0 - 0x0000)
struct GA_boss_01_act_07_startBP_C_ExecuteUbergraph_GA_boss_01_act_07_startBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_CustomEvent_HitResult_1;                    // 0x0008(0x0108)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	TDelegate<void(const struct FHitResult& HitResult)> K2Node_CreateDelegate_OutputDelegate;        // 0x0110(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_CustomEvent_HitResult;                      // 0x0120(0x0108)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	TDelegate<void(const struct FHitResult& HitResult)> K2Node_CreateDelegate_OutputDelegate_1;      // 0x0228(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Temp_struct_Variable;                              // 0x0238(0x0108)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FTractionInnerBoxParams                K2Node_MakeStruct_TractionInnerBoxParams;          // 0x0340(0x0030)(NoDestructor)
	class UHTAbilityTask_ApplyTractionForce*      CallFunc_HTApplyTractionForce_ReturnValue;         // 0x0370(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0378(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_379[0x7];                                      // 0x0379(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_CustomEvent_HitResult_2;                    // 0x0380(0x0108)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	TDelegate<void(const struct FHitResult& HitResult)> K2Node_CreateDelegate_OutputDelegate_2;      // 0x0488(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue;  // 0x0498(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class Aboss_01_BP_C*                          K2Node_DynamicCast_AsBoss_01_BP;                   // 0x04A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x04A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_boss_01_act_07_startBP_C_ExecuteUbergraph_GA_boss_01_act_07_startBP;

// Function GA_boss_01_act_07_startBP.GA_boss_01_act_07_startBP_C.OnOverlapCharacter_484146584F298B4A53B815A2320A3728
// 0x0108 (0x0108 - 0x0000)
struct GA_boss_01_act_07_startBP_C_OnOverlapCharacter_484146584F298B4A53B815A2320A3728 final
{
public:
	struct FHitResult                             HitResult;                                         // 0x0000(0x0108)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
DUMPER7_ASSERTS_GA_boss_01_act_07_startBP_C_OnOverlapCharacter_484146584F298B4A53B815A2320A3728;

// Function GA_boss_01_act_07_startBP.GA_boss_01_act_07_startBP_C.OnOverlapGeometryCollection_484146584F298B4A53B815A2320A3728
// 0x0108 (0x0108 - 0x0000)
struct GA_boss_01_act_07_startBP_C_OnOverlapGeometryCollection_484146584F298B4A53B815A2320A3728 final
{
public:
	struct FHitResult                             HitResult;                                         // 0x0000(0x0108)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
DUMPER7_ASSERTS_GA_boss_01_act_07_startBP_C_OnOverlapGeometryCollection_484146584F298B4A53B815A2320A3728;

// Function GA_boss_01_act_07_startBP.GA_boss_01_act_07_startBP_C.OnOverlapPhyActor_484146584F298B4A53B815A2320A3728
// 0x0108 (0x0108 - 0x0000)
struct GA_boss_01_act_07_startBP_C_OnOverlapPhyActor_484146584F298B4A53B815A2320A3728 final
{
public:
	struct FHitResult                             HitResult;                                         // 0x0000(0x0108)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
DUMPER7_ASSERTS_GA_boss_01_act_07_startBP_C_OnOverlapPhyActor_484146584F298B4A53B815A2320A3728;

}

