#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_MontageBase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HTGame_structs.hpp"
#include "GA_HTAbilityBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_MontageBase.GA_MontageBase_C
// 0x0010 (0x0BC0 - 0x0BB0)
class UGA_MontageBase_C : public UGA_HTAbilityBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GA_MontageBase_C;                   // 0x0BA8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAimingTaskParams                      Aiming_Task_Params;                                // 0x0BB0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	bool                                          bHasCommit;                                        // 0x0BB8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CommitResult;                                      // 0x0BB9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          JumpSectionTaskCreated;                            // 0x0BBA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          P_RIsPressed;                                      // 0x0BBB(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void TriggerJumpSectionImpl(class FName JumpSectionName);
	void OnTriggerNextSection_A46B470745030951E66252ABC1169A79(class FName NextSectionName);
	void OnReleaseFire_F412C28D45D0207108BE7F8920600ACE();
	void OnRelease_09EC101B4BF38E1DD11EF9AD3FC2BBA1(float TimeHeld, bool bAuto);
	void OnReceiveEvent(const struct FGameplayTag& ContainerTag, const struct FGameplayEventData& EventData);
	void OnInterrupted_F7C45E2243E75F2961A2289F04DE722F(const struct FGameplayTag& EventTag, const struct FGameplayEventData& EventData);
	void OnEnterAiming_F412C28D45D0207108BE7F8920600ACE();
	void OnCompleted_F7C45E2243E75F2961A2289F04DE722F(const struct FGameplayTag& EventTag, const struct FGameplayEventData& EventData);
	void OnCancelled_F7C45E2243E75F2961A2289F04DE722F(const struct FGameplayTag& EventTag, const struct FGameplayEventData& EventData);
	void OnBlendOut_F7C45E2243E75F2961A2289F04DE722F(const struct FGameplayTag& EventTag, const struct FGameplayEventData& EventData);
	void K2_TriggerJumpSection(class FName JumpSectionName);
	void K2_ActivateAbility();
	void IsOwnerAiming(bool* IsAiming);
	void ExecuteUbergraph_GA_MontageBase(int32 EntryPoint);
	void EventReceived_F7C45E2243E75F2961A2289F04DE722F(const struct FGameplayTag& EventTag, const struct FGameplayEventData& EventData);
	void CanExec(bool* can);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GA_MontageBase_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GA_MontageBase_C")
	}
	static class UGA_MontageBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_MontageBase_C>();
	}
};
DUMPER7_ASSERTS_UGA_MontageBase_C;

}

