#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_TriggerGEBase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GA_HTAbilityBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_TriggerGEBase.GA_TriggerGEBase_C
// 0x0030 (0x0BE0 - 0x0BB0)
class UGA_TriggerGEBase_C : public UGA_HTAbilityBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GA_TriggerGEBase_C;                 // 0x0BA8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<struct FGameplayTag>                   TriggerEventTags;                                  // 0x0BB0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	double                                        DelayEndAbility;                                   // 0x0BC0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DelayExecContainer;                                // 0x0BC8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FirstExecute;                                      // 0x0BD0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void OnFinish_E44B65F545DF26B69D9E58BE9996F973();
	void K2_ActivateAbility();
	void ExecuteUbergraph_GA_TriggerGEBase(int32 EntryPoint);
	void CustomEvent(const struct FGameplayTag& TagParam);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GA_TriggerGEBase_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GA_TriggerGEBase_C")
	}
	static class UGA_TriggerGEBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_TriggerGEBase_C>();
	}
};
DUMPER7_ASSERTS_UGA_TriggerGEBase_C;

}

