#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_Jin_UltraskillEffect

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GC_BuffBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GC_Jin_UltraskillEffect.GC_Jin_UltraskillEffect_C
// 0x0028 (0x0478 - 0x0450)
class AGC_Jin_UltraskillEffect_C final : public AGC_BuffBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0450(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         Timeline_NewTrack_0_49FF67B24696C3A7EC9F73989E04736B; // 0x0458(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline__Direction_49FF67B24696C3A7EC9F73989E04736B; // 0x045C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45D[0x3];                                      // 0x045D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline;                                          // 0x0460(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      SaveDparticle;                                     // 0x0468(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         Emitter_Template;                                  // 0x0470(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void CustomEvent(bool bHideCharacter);
	void ExecuteUbergraph_GC_Jin_UltraskillEffect(int32 EntryPoint);
	void HideParticle(bool Hide, bool hideonend, bool destroyonend);
	void OnCueParticleEffectsSpawned(class AActor* OwnerCharacter, class UNiagaraComponent* NiagaraComponent);
	void OnRemoveEvent(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters);
	void OnWhileActiveEvent(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters);
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void Timeline__FinishedFunc();
	void Timeline__UpdateFunc();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GC_Jin_UltraskillEffect_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GC_Jin_UltraskillEffect_C")
	}
	static class AGC_Jin_UltraskillEffect_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGC_Jin_UltraskillEffect_C>();
	}
};
DUMPER7_ASSERTS_AGC_Jin_UltraskillEffect_C;

}

