#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Gliding_Fashion_1052_ABP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "HTGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Gliding_Fashion_1052_ABP.Gliding_Fashion_1052_ABP_C
// 0x0440 (0x0EB0 - 0x0A70)
class UGliding_Fashion_1052_ABP_C final : public UHTGlideAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0A70(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0A78(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0A80(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0A88(0x0020)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x0AA8(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x0AF0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x0B18(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x0B40(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0x0B68(0x0020)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x0B88(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_1;                      // 0x0BA8(0x00C8)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x0C70(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x0C98(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x0CE0(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0D00(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x0D48(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x0D68(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x0E30(0x0080)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Gliding_Fashion_1052_ABP_AnimGraphNode_TransitionResult_850476D3412B656DDE249695D8C70841();
	void ExecuteUbergraph_Gliding_Fashion_1052_ABP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Gliding_Fashion_1052_ABP_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Gliding_Fashion_1052_ABP_C")
	}
	static class UGliding_Fashion_1052_ABP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGliding_Fashion_1052_ABP_C>();
	}
};
DUMPER7_ASSERTS_UGliding_Fashion_1052_ABP_C;

}

