#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HTDrone_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HTGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass HTDrone_BP.HTDrone_BP_C
// 0x0030 (0x11D0 - 0x11A0)
class AHTDrone_BP_C final : public AHTDroneCharacter
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x11A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      WaterInteraction;                                  // 0x11A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHTFluxInteractionComponent*            HTFluxInteraction;                                 // 0x11B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDroneForceFieldComponent*              DroneForceField;                                   // 0x11B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x11C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_HTDrone_BP(int32 EntryPoint);
	TArray<struct FFluxInteractionData> GetInteractions(double Ratio, int32 Iteration);
	void ReceiveBeginPlay();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ReceiveTick(float DeltaSeconds);
	void SwitchVoice(bool bSwitch);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("HTDrone_BP_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HTDrone_BP_C")
	}
	static class AHTDrone_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AHTDrone_BP_C>();
	}
};
DUMPER7_ASSERTS_AHTDrone_BP_C;

}

