#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HtNPCInteractAnimLayerBase

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function HtNPCInteractAnimLayerBase.HtNPCInteractAnimLayerBase_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct HtNPCInteractAnimLayerBase_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_HtNPCInteractAnimLayerBase_C_AnimGraph;

// Function HtNPCInteractAnimLayerBase.HtNPCInteractAnimLayerBase_C.InteractAnimationLayer
// 0x0020 (0x0020 - 0x0000)
struct HtNPCInteractAnimLayerBase_C_InteractAnimationLayer final
{
public:
	struct FPoseLink                              InPose;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              InteractAnimationLayer_0;                          // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_HtNPCInteractAnimLayerBase_C_InteractAnimationLayer;

// Function HtNPCInteractAnimLayerBase.HtNPCInteractAnimLayerBase_C.InteractIKLayer
// 0x0020 (0x0020 - 0x0000)
struct HtNPCInteractAnimLayerBase_C_InteractIKLayer final
{
public:
	struct FPoseLink                              InPose_0;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              InteractIKLayer_0;                                 // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_HtNPCInteractAnimLayerBase_C_InteractIKLayer;

}

