#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HtPlayerCharacterAniminstanceBase

#include "Basic.hpp"

#include "ControlRig_structs.hpp"
#include "Engine_structs.hpp"
#include "HtPlayerCharacterAniminstanceBase_structs.hpp"
#include "PoseSearch_structs.hpp"
#include "HTGame_structs.hpp"
#include "HTGame_classes.hpp"
#include "IKRig_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass HtPlayerCharacterAniminstanceBase.HtPlayerCharacterAniminstanceBase_C
// 0x13F10 (0x18050 - 0x4140)
class UHtPlayerCharacterAniminstanceBase_C : public UHTPlayerAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x4140(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct HtPlayerCharacterAniminstanceBase::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables; // 0x4148(0x0158)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x42A0(0x0008)()
	struct FAnimSubsystemInstance_NodeRelevancy   AnimBlueprintExtension_NodeRelevancy;              // 0x42A8(0x00A8)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x4350(0x0008)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_21;                  // 0x4358(0x00C8)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_20;                  // 0x4420(0x00C8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_27;                             // 0x44E8(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_19;                  // 0x4508(0x00B8)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_19;                  // 0x45C0(0x00C8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_26;                             // 0x4688(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_18;                  // 0x46A8(0x00B8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_38;                   // 0x4760(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_231;                // 0x47E0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_230;                // 0x4808(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_229;                // 0x4830(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_228;                // 0x4858(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_227;                // 0x4880(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_226;                // 0x48A8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_225;                // 0x48D0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_224;                // 0x48F8(0x0028)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve_43;                      // 0x4920(0x0120)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve_42;                      // 0x4A40(0x0120)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_87;                   // 0x4B60(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_122;                     // 0x4BA8(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_84;                    // 0x4BC8(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_121;                     // 0x4BF0(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_35;                     // 0x4C10(0x00C8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_25;                             // 0x4CD8(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_17;                  // 0x4CF8(0x00B8)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_18;                  // 0x4DB0(0x00C8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_24;                             // 0x4E78(0x0020)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_4;                 // 0x4E98(0x0040)()
	struct FAnimNode_Root                         AnimGraphNode_Root_23;                             // 0x4ED8(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_223;                // 0x4EF8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_222;                // 0x4F20(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_221;                // 0x4F48(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_220;                // 0x4F70(0x0028)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_3;                 // 0x4F98(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_120;                     // 0x4FD8(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_219;                // 0x4FF8(0x0028)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_2;                 // 0x5020(0x0040)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_34;                  // 0x5060(0x0050)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_86;                   // 0x50B0(0x0048)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_1;                 // 0x50F8(0x0040)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_7;                     // 0x5138(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_119;                     // 0x5200(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_34;                     // 0x5220(0x00C8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_22;                             // 0x52E8(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_218;                // 0x5308(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_217;                // 0x5330(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_216;                // 0x5358(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_215;                // 0x5380(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_214;                // 0x53A8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_213;                // 0x53D0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_212;                // 0x53F8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_211;                // 0x5420(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_210;                // 0x5448(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_209;                // 0x5470(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_208;                // 0x5498(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_207;                // 0x54C0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_206;                // 0x54E8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_205;                // 0x5510(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_204;                // 0x5538(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_203;                // 0x5560(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_83;                    // 0x5588(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_118;                     // 0x55B0(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_202;                // 0x55D0(0x0028)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve_41;                      // 0x55F8(0x0120)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_85;                   // 0x5718(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_117;                     // 0x5760(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_33;                     // 0x5780(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_116;                     // 0x5848(0x0020)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve_40;                      // 0x5868(0x0120)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_84;                   // 0x5988(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_115;                     // 0x59D0(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_32;                     // 0x59F0(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_114;                     // 0x5AB8(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_201;                // 0x5AD8(0x0028)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve_39;                      // 0x5B00(0x0120)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_83;                   // 0x5C20(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_113;                     // 0x5C68(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_31;                     // 0x5C88(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_112;                     // 0x5D50(0x0020)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve_38;                      // 0x5D70(0x0120)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_82;                   // 0x5E90(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_111;                     // 0x5ED8(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_30;                     // 0x5EF8(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_110;                     // 0x5FC0(0x0020)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve_37;                      // 0x5FE0(0x0120)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_81;                   // 0x6100(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_109;                     // 0x6148(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_29;                     // 0x6168(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_108;                     // 0x6230(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_200;                // 0x6250(0x0028)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve_36;                      // 0x6278(0x0120)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_80;                   // 0x6398(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_107;                     // 0x63E0(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_28;                     // 0x6400(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_106;                     // 0x64C8(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_199;                // 0x64E8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_198;                // 0x6510(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_197;                // 0x6538(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_196;                // 0x6560(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_195;                // 0x6588(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_194;                // 0x65B0(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_79;                   // 0x65D8(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_105;                     // 0x6620(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_78;                   // 0x6640(0x0048)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve_35;                      // 0x6688(0x0120)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_104;                     // 0x67A8(0x0020)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_33;                  // 0x67C8(0x0050)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_23;                 // 0x6818(0x0070)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_22;                 // 0x6888(0x0070)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_103;                     // 0x68F8(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_27;                     // 0x6918(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_102;                     // 0x69E0(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_193;                // 0x6A00(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_192;                // 0x6A28(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_191;                // 0x6A50(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_190;                // 0x6A78(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_189;                // 0x6AA0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_188;                // 0x6AC8(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_77;                   // 0x6AF0(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_101;                     // 0x6B38(0x0020)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve_34;                      // 0x6B58(0x0120)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_76;                   // 0x6C78(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_100;                     // 0x6CC0(0x0020)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_32;                  // 0x6CE0(0x0050)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_21;                 // 0x6D30(0x0070)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_20;                 // 0x6DA0(0x0070)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_99;                      // 0x6E10(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_26;                     // 0x6E30(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_98;                      // 0x6EF8(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_25;                     // 0x6F18(0x00C8)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_187;                // 0x6FE0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_186;                // 0x7008(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_185;                // 0x7030(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_184;                // 0x7058(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_183;                // 0x7080(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_182;                // 0x70A8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_181;                // 0x70D0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_82;                    // 0x70F8(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_97;                      // 0x7120(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_180;                // 0x7140(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_179;                // 0x7168(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_81;                    // 0x7190(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_96;                      // 0x71B8(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_75;                   // 0x71D8(0x0048)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_6;                     // 0x7220(0x00C8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_80;                    // 0x72E8(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_95;                      // 0x7310(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_74;                   // 0x7330(0x0048)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_5;                     // 0x7378(0x00C8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_79;                    // 0x7440(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_94;                      // 0x7468(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_24;                     // 0x7488(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_93;                      // 0x7550(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_78;                    // 0x7570(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_92;                      // 0x7598(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_77;                    // 0x75B8(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_31;                  // 0x75E0(0x0050)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_15;                 // 0x7630(0x00E8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_76;                    // 0x7718(0x0028)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_4;                     // 0x7740(0x00C8)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_19;                 // 0x7808(0x0070)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_75;                    // 0x7878(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_91;                      // 0x78A0(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_74;                    // 0x78C0(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_90;                      // 0x78E8(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_23;                     // 0x7908(0x00C8)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_178;                // 0x79D0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_177;                // 0x79F8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_176;                // 0x7A20(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_175;                // 0x7A48(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_174;                // 0x7A70(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_173;                // 0x7A98(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_172;                // 0x7AC0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_171;                // 0x7AE8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_170;                // 0x7B10(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_169;                // 0x7B38(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_168;                // 0x7B60(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_167;                // 0x7B88(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_166;                // 0x7BB0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_165;                // 0x7BD8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_164;                // 0x7C00(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_163;                // 0x7C28(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_162;                // 0x7C50(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_161;                // 0x7C78(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_160;                // 0x7CA0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_159;                // 0x7CC8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_158;                // 0x7CF0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_157;                // 0x7D18(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_156;                // 0x7D40(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_155;                // 0x7D68(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_154;                // 0x7D90(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_153;                // 0x7DB8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_152;                // 0x7DE0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_151;                // 0x7E08(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_150;                // 0x7E30(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_149;                // 0x7E58(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_148;                // 0x7E80(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_147;                // 0x7EA8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_146;                // 0x7ED0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_145;                // 0x7EF8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_144;                // 0x7F20(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_143;                // 0x7F48(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_142;                // 0x7F70(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_141;                // 0x7F98(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_140;                // 0x7FC0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_139;                // 0x7FE8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_138;                // 0x8010(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_137;                // 0x8038(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_136;                // 0x8060(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_73;                   // 0x8088(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_89;                      // 0x80D0(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_135;                // 0x80F0(0x0028)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve_33;                      // 0x8118(0x0120)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_72;                   // 0x8238(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_88;                      // 0x8280(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_134;                // 0x82A0(0x0028)()
	uint8                                         Pad_82C8[0x8];                                     // 0x82C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_Inertialization              AnimGraphNode_Inertialization_1;                   // 0x82D0(0x0550)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_133;                // 0x8820(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_132;                // 0x8848(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_131;                // 0x8870(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_130;                // 0x8898(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_129;                // 0x88C0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_128;                // 0x88E8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_127;                // 0x8910(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_126;                // 0x8938(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_125;                // 0x8960(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_71;                   // 0x8988(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_87;                      // 0x89D0(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_70;                   // 0x89F0(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_86;                      // 0x8A38(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_69;                   // 0x8A58(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_85;                      // 0x8AA0(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_22;                     // 0x8AC0(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_84;                      // 0x8B88(0x0020)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve_32;                      // 0x8BA8(0x0120)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_73;                    // 0x8CC8(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_83;                      // 0x8CF0(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_124;                // 0x8D10(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_123;                // 0x8D38(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_122;                // 0x8D60(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_121;                // 0x8D88(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_120;                // 0x8DB0(0x0028)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve_31;                      // 0x8DD8(0x0120)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_72;                    // 0x8EF8(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_82;                      // 0x8F20(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_68;                   // 0x8F40(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_81;                      // 0x8F88(0x0020)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve_30;                      // 0x8FA8(0x0120)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_67;                   // 0x90C8(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_80;                      // 0x9110(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_21;                     // 0x9130(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_79;                      // 0x91F8(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_119;                // 0x9218(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_118;                // 0x9240(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_117;                // 0x9268(0x0028)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve_29;                      // 0x9290(0x0120)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_71;                    // 0x93B0(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_78;                      // 0x93D8(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_66;                   // 0x93F8(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_77;                      // 0x9440(0x0020)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve_28;                      // 0x9460(0x0120)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_65;                   // 0x9580(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_76;                      // 0x95C8(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_20;                     // 0x95E8(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_75;                      // 0x96B0(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_19;                     // 0x96D0(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_74;                      // 0x9798(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_64;                   // 0x97B8(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_73;                      // 0x9800(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_63;                   // 0x9820(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_72;                      // 0x9868(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_116;                // 0x9888(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_115;                // 0x98B0(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_62;                   // 0x98D8(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_71;                      // 0x9920(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_61;                   // 0x9940(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_70;                      // 0x9988(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_60;                   // 0x99A8(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_69;                      // 0x99F0(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_18;                     // 0x9A10(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_68;                      // 0x9AD8(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_17;                     // 0x9AF8(0x00C8)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve_27;                      // 0x9BC0(0x0120)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_67;                      // 0x9CE0(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_114;                // 0x9D00(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_113;                // 0x9D28(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_112;                // 0x9D50(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_111;                // 0x9D78(0x0028)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve_26;                      // 0x9DA0(0x0120)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve_25;                      // 0x9EC0(0x0120)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_110;                // 0x9FE0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_109;                // 0xA008(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_108;                // 0xA030(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_107;                // 0xA058(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_106;                // 0xA080(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_70;                    // 0xA0A8(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_66;                      // 0xA0D0(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_69;                    // 0xA0F0(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_65;                      // 0xA118(0x0020)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve_24;                      // 0xA138(0x0120)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_59;                   // 0xA258(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_64;                      // 0xA2A0(0x0020)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve_23;                      // 0xA2C0(0x0120)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_58;                   // 0xA3E0(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_63;                      // 0xA428(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_57;                   // 0xA448(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_62;                      // 0xA490(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_16;                     // 0xA4B0(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_61;                      // 0xA578(0x0020)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve_22;                      // 0xA598(0x0120)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve_21;                      // 0xA6B8(0x0120)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_105;                // 0xA7D8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_104;                // 0xA800(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_103;                // 0xA828(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_102;                // 0xA850(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_101;                // 0xA878(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_68;                    // 0xA8A0(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_60;                      // 0xA8C8(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_67;                    // 0xA8E8(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_59;                      // 0xA910(0x0020)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve_20;                      // 0xA930(0x0120)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_56;                   // 0xAA50(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_58;                      // 0xAA98(0x0020)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve_19;                      // 0xAAB8(0x0120)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_55;                   // 0xABD8(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_57;                      // 0xAC20(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_54;                   // 0xAC40(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_56;                      // 0xAC88(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_15;                     // 0xACA8(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_55;                      // 0xAD70(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_100;                // 0xAD90(0x0028)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve_18;                      // 0xADB8(0x0120)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_22;                             // 0xAED8(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_66;                    // 0xAF20(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_54;                      // 0xAF48(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_65;                    // 0xAF68(0x0028)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve_17;                      // 0xAF90(0x0120)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve_16;                      // 0xB0B0(0x0120)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_21;                             // 0xB1D0(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_53;                      // 0xB218(0x0020)()
	struct FHTAnimNode_GetRootSpeed               HTGetRootSpeedGraphNode_3;                         // 0xB238(0x0060)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_30;                  // 0xB298(0x0050)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_53;                   // 0xB2E8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_52;                   // 0xB330(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_52;                      // 0xB378(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_99;                 // 0xB398(0x0028)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve_15;                      // 0xB3C0(0x0120)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_20;                             // 0xB4E0(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_98;                 // 0xB528(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_97;                 // 0xB550(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_64;                    // 0xB578(0x0028)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_18;                 // 0xB5A0(0x0070)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_17;                 // 0xB610(0x0070)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_16;                 // 0xB680(0x0070)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt;                      // 0xB6F0(0x0050)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_51;                      // 0xB740(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_63;                    // 0xB760(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_50;                      // 0xB788(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_14;                     // 0xB7A8(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_49;                      // 0xB870(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_62;                    // 0xB890(0x0028)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve_14;                      // 0xB8B8(0x0120)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve_13;                      // 0xB9D8(0x0120)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_19;                             // 0xBAF8(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_48;                      // 0xBB40(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_13;                     // 0xBB60(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_37;                   // 0xBC28(0x0080)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_36;                   // 0xBCA8(0x0080)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_35;                   // 0xBD28(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_96;                 // 0xBDA8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_95;                 // 0xBDD0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_94;                 // 0xBDF8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_93;                 // 0xBE20(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_92;                 // 0xBE48(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_91;                 // 0xBE70(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_90;                 // 0xBE98(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_89;                 // 0xBEC0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_88;                 // 0xBEE8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_87;                 // 0xBF10(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_86;                 // 0xBF38(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_85;                 // 0xBF60(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_84;                 // 0xBF88(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_83;                 // 0xBFB0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_82;                 // 0xBFD8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_81;                 // 0xC000(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_80;                 // 0xC028(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_79;                 // 0xC050(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_78;                 // 0xC078(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_77;                 // 0xC0A0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_76;                 // 0xC0C8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_75;                 // 0xC0F0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_74;                 // 0xC118(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_73;                 // 0xC140(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_72;                 // 0xC168(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_71;                 // 0xC190(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_70;                 // 0xC1B8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_69;                 // 0xC1E0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_68;                 // 0xC208(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_67;                 // 0xC230(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_66;                 // 0xC258(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_65;                 // 0xC280(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_64;                 // 0xC2A8(0x0028)()
	struct FHTAnimNode_GetRootSpeed               HTGetRootSpeedGraphNode_2;                         // 0xC2D0(0x0060)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_51;                   // 0xC330(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_50;                   // 0xC378(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_29;                  // 0xC3C0(0x0050)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_47;                      // 0xC410(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_63;                 // 0xC430(0x0028)()
	struct FHTAnimNode_GetRootSpeed               HTGetRootSpeedGraphNode_1;                         // 0xC458(0x0060)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_49;                   // 0xC4B8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_48;                   // 0xC500(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_28;                  // 0xC548(0x0050)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_46;                      // 0xC598(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_47;                   // 0xC5B8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_46;                   // 0xC600(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_27;                  // 0xC648(0x0050)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_45;                      // 0xC698(0x0020)()
	struct FHTAnimNode_GetRootSpeed               HTGetRootSpeedGraphNode;                           // 0xC6B8(0x0060)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_61;                    // 0xC718(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_44;                      // 0xC740(0x0020)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve_12;                      // 0xC760(0x0120)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_45;                   // 0xC880(0x0048)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_5;                   // 0xC8C8(0x0050)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_44;                   // 0xC918(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_43;                      // 0xC960(0x0020)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_26;                  // 0xC980(0x0050)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_43;                   // 0xC9D0(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_42;                   // 0xCA18(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_41;                   // 0xCA60(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_40;                   // 0xCAA8(0x0048)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_4;                   // 0xCAF0(0x0050)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_42;                      // 0xCB40(0x0020)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve_11;                      // 0xCB60(0x0120)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_39;                   // 0xCC80(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_41;                      // 0xCCC8(0x0020)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_3;                     // 0xCCE8(0x00C8)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_15;                 // 0xCDB0(0x0070)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_38;                   // 0xCE20(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_25;                  // 0xCE68(0x0050)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve_10;                      // 0xCEB8(0x0120)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_24;                  // 0xCFD8(0x0050)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve_9;                       // 0xD028(0x0120)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_14;                 // 0xD148(0x0070)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve_8;                       // 0xD1B8(0x0120)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_13;                 // 0xD2D8(0x0070)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_40;                      // 0xD348(0x0020)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve_7;                       // 0xD368(0x0120)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_37;                   // 0xD488(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_23;                  // 0xD4D0(0x0050)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_36;                   // 0xD520(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_35;                   // 0xD568(0x0048)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_3;                   // 0xD5B0(0x0050)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_39;                      // 0xD600(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_34;                   // 0xD620(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_38;                      // 0xD668(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_60;                    // 0xD688(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_37;                      // 0xD6B0(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_59;                    // 0xD6D0(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_36;                      // 0xD6F8(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_12;                     // 0xD718(0x00C8)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_18;                             // 0xD7E0(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_34;                   // 0xD828(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_62;                 // 0xD8A8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_61;                 // 0xD8D0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_60;                 // 0xD8F8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_59;                 // 0xD920(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_58;                 // 0xD948(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_57;                 // 0xD970(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_56;                 // 0xD998(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_33;                   // 0xD9C0(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_14;                 // 0xDA08(0x00E8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_58;                    // 0xDAF0(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_35;                      // 0xDB18(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_32;                   // 0xDB38(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_22;                  // 0xDB80(0x0050)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig_1;                        // 0xDBD0(0x04B8)(ContainsInstancedReference)
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_31;                   // 0xE088(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_13;                 // 0xE0D0(0x00E8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_57;                    // 0xE1B8(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_34;                      // 0xE1E0(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_30;                   // 0xE200(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_12;                 // 0xE248(0x00E8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_56;                    // 0xE330(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_21;                  // 0xE358(0x0050)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_29;                   // 0xE3A8(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_11;                 // 0xE3F0(0x00E8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_55;                    // 0xE4D8(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_33;                      // 0xE500(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_54;                    // 0xE520(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_32;                      // 0xE548(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_11;                     // 0xE568(0x00C8)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_55;                 // 0xE630(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_54;                 // 0xE658(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_53;                 // 0xE680(0x0028)()
