#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HtPlayerInteractAnimLayerBase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HTGame_classes.hpp"
#include "HtPlayerInteractAnimLayerBase_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass HtPlayerInteractAnimLayerBase.HtPlayerInteractAnimLayerBase_C
// 0x0640 (0x0AB0 - 0x0470)
class UHtPlayerInteractAnimLayerBase_C : public UHTPlayerInteractAnimLayer
{
public:
	struct HtPlayerInteractAnimLayerBase::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables; // 0x0470(0x0018)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0488(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0490(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root_2;                              // 0x0498(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_1;                   // 0x04B8(0x00B8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x0570(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x0590(0x00B8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x0648(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x06C8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x06F0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_3;                     // 0x0718(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1;                   // 0x0740(0x0050)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator;                   // 0x0790(0x0040)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0x07D0(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x07F8(0x00E8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x08E0(0x0050)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x0930(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x0958(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x0978(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x09A0(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x09C0(0x00C8)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0A88(0x0020)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void InteractAnimationLayer(const struct FPoseLink& InPose, struct FPoseLink* InteractAnimationLayer_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("HtPlayerInteractAnimLayerBase_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HtPlayerInteractAnimLayerBase_C")
	}
	static class UHtPlayerInteractAnimLayerBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHtPlayerInteractAnimLayerBase_C>();
	}
};
DUMPER7_ASSERTS_UHtPlayerInteractAnimLayerBase_C;

}

