#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HTUmbrellaAnimBP

#include "Basic.hpp"

#include "HTUmbrellaAnimBP_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "HTGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass HTUmbrellaAnimBP.HTUmbrellaAnimBP_C
// 0x0160 (0x0550 - 0x03F0)
class UHTUmbrellaAnimBP_C final : public UHTUmbrellaAnimInstance
{
public:
	struct HTUmbrellaAnimBP::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;             // 0x03F0(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F2[0x6];                                      // 0x03F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x03F8(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0400(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0408(0x0020)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x0428(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0470(0x0048)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator;                   // 0x04B8(0x0040)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x04F8(0x0050)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("HTUmbrellaAnimBP_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HTUmbrellaAnimBP_C")
	}
	static class UHTUmbrellaAnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHTUmbrellaAnimBP_C>();
	}
};
DUMPER7_ASSERTS_UHTUmbrellaAnimBP_C;

}

