#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: InteractBox_Base_LV1

#include "Basic.hpp"

#include "HTGame_structs.hpp"


namespace SDK::Params
{

// Function InteractBox_Base_LV1.InteractBox_Base_LV1_C.BPGetInteractEntries
// 0x0018 (0x0018 - 0x0000)
struct InteractBox_Base_LV1_C_BPGetInteractEntries final
{
public:
	class AHTPlayerController*                    ByPC;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FInteractEntry>                 OutInteractEntries;                                // 0x0008(0x0010)(Parm, OutParm, ContainsInstancedReference)
};
DUMPER7_ASSERTS_InteractBox_Base_LV1_C_BPGetInteractEntries;

// Function InteractBox_Base_LV1.InteractBox_Base_LV1_C.ExecuteUbergraph_InteractBox_Base_LV1
// 0x0010 (0x0010 - 0x0000)
struct InteractBox_Base_LV1_C_ExecuteUbergraph_InteractBox_Base_LV1 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHTFadeComponent*                       CallFunc_StartFadeOut_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_InteractBox_Base_LV1_C_ExecuteUbergraph_InteractBox_Base_LV1;

}

