#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Interact_S110206_2

#include "Basic.hpp"

#include "HTGame_structs.hpp"


namespace SDK::Params
{

// Function Interact_S110206_2.Interact_S110206_2_C.BndEvt__Break_S110201_HTDialogue_K2Node_ComponentBoundEvent_0_OnDialogueEventDelegate__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct Interact_S110206_2_C_BndEvt__Break_S110201_HTDialogue_K2Node_ComponentBoundEvent_0_OnDialogueEventDelegate__DelegateSignature final
{
public:
	class FName                                   InParticipant;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   InEventName;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Interact_S110206_2_C_BndEvt__Break_S110201_HTDialogue_K2Node_ComponentBoundEvent_0_OnDialogueEventDelegate__DelegateSignature;

// Function Interact_S110206_2.Interact_S110206_2_C.BPGetInteractEntries
// 0x0038 (0x0038 - 0x0000)
struct Interact_S110206_2_C_BPGetInteractEntries final
{
public:
	class AHTPlayerController*                    ByPC;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FInteractEntry>                 OutInteractEntries;                                // 0x0008(0x0010)(Parm, OutParm, ContainsInstancedReference)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHTPlayerState*                         CallFunc_GetClientPlayerState_ReturnValue;         // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue_1;            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsQuestObjectInProgress_ReturnValue;      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Interact_S110206_2_C_BPGetInteractEntries;

// Function Interact_S110206_2.Interact_S110206_2_C.BPInteractFinished
// 0x0010 (0x0010 - 0x0000)
struct Interact_S110206_2_C_BPInteractFinished final
{
public:
	class AHTPlayerController*                    ByPC;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         InteractIndex;                                     // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Interact_S110206_2_C_BPInteractFinished;

// Function Interact_S110206_2.Interact_S110206_2_C.ExecuteUbergraph_Interact_S110206_2
// 0x0028 (0x0028 - 0x0000)
struct Interact_S110206_2_C_ExecuteUbergraph_Interact_S110206_2 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_ComponentBoundEvent_InParticipant;          // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_ComponentBoundEvent_InEventName;            // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AHTPlayerController*                    K2Node_Event_ByPC;                                 // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_InteractIndex;                        // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Interact_S110206_2_C_ExecuteUbergraph_Interact_S110206_2;

}

