#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: InteractBox_Base_LV1

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HTGame_structs.hpp"
#include "HTGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass InteractBox_Base_LV1.InteractBox_Base_LV1_C
// 0x0030 (0x0BC8 - 0x0B98)
class AInteractBox_Base_LV1_C : public AHTRandomItemActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B98(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBP_SMC_PlaneOutline_C*                 BP_SMC_PlaneOutline;                               // 0x0BA0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       Sphere;                                            // 0x0BA8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0BB0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FInteractEntry>                 Out_Interact_Entries;                              // 0x0BB8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)

public:
	void BP_DestroyItem();
	void BPGetInteractEntries(class AHTPlayerController* ByPC, TArray<struct FInteractEntry>* OutInteractEntries);
	void ExecuteUbergraph_InteractBox_Base_LV1(int32 EntryPoint);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("InteractBox_Base_LV1_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"InteractBox_Base_LV1_C")
	}
	static class AInteractBox_Base_LV1_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AInteractBox_Base_LV1_C>();
	}
};
DUMPER7_ASSERTS_AInteractBox_Base_LV1_C;

}

