#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: k111306_htb

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HTGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass k111306_htb.k111306_htb_C
// 0x0040 (0x04F8 - 0x04B8)
class Ak111306_htb_C final : public AHTQuestTriggerBox
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class FName                                   Quest_ID;                                          // 0x04C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Object_ID;                                         // 0x04C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHTVisualSpawnManager*                  Target;                                            // 0x04D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class AHTVisualSpawnManager*                  Target_0;                                          // 0x04D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class FName                                   TeleportID;                                        // 0x04E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        BlackScreenTime;                                   // 0x04E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Black_Time;                                        // 0x04F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnDialogueEvent(const class FName& EventName);
	void Completed_2328E9E74DDCF0FB01B94E8E01EDC09B(class UCommonActivatableWidget* WidgetObject);
	void Completed_2328E9E74DDCF0FB01B94E8EE40B5F34(class UCommonActivatableWidget* WidgetObject);
	void ExecuteUbergraph_k111306_htb(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("k111306_htb_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"k111306_htb_C")
	}
	static class Ak111306_htb_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<Ak111306_htb_C>();
	}
};
DUMPER7_ASSERTS_Ak111306_htb_C;

}

