#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: L110003_QTB_CA

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HTGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass L110003_QTB_CA.L110003_QTB_CA_C
// 0x0088 (0x0540 - 0x04B8)
class AL110003_QTB_CA_C final : public AHTQuestTriggerBox
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBillboardComponent*                    Billboard;                                         // 0x04C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class AHTCineCameraActor>      Camera_1;                                          // 0x04C8(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class AHTCineCameraActor>      Camera_2;                                          // 0x04F0(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	class AActor*                                 Target;                                            // 0x0518(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class AHTAISpawnManager*                      NPC_WTR;                                           // 0x0520(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	TArray<class FText>                           L110003;                                           // 0x0528(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class AHTWheeledVehicleDrivable*              Vhhicle;                                           // 0x0538(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__QTB_CA_CollisionComponent_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void ExecuteUbergraph_L110003_QTB_CA(int32 EntryPoint);
	void OnLoaded_F08A2AB348C3C3F6A5AC0B9EB25C4D33(class UObject* Loaded);
	void OnLoaded_F08A2AB348C3C3F6A5AC0B9EB33971E9(class UObject* Loaded);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("L110003_QTB_CA_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"L110003_QTB_CA_C")
	}
	static class AL110003_QTB_CA_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AL110003_QTB_CA_C>();
	}
};
DUMPER7_ASSERTS_AL110003_QTB_CA_C;

}

