#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: L110106_QTB_CA

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HTGame_structs.hpp"
#include "HTGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass L110106_QTB_CA.L110106_QTB_CA_C
// 0x00E0 (0x0598 - 0x04B8)
class AL110106_QTB_CA_C final : public AHTQuestTriggerBox
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBillboardComponent*                    Billboard;                                         // 0x04C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class AHTCineCameraActor>      Camera_1;                                          // 0x04C8(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class AHTCineCameraActor>      Camera_2;                                          // 0x04F0(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TArray<struct FNPCMultiMsgID>                 Msg_Arr;                                           // 0x0518(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<int32, class AHTAICharacter*>            Target_Npc_Map;                                    // 0x0528(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	class AHTAISpawnManager*                      NPC;                                               // 0x0578(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	int32                                         NewVar_0;                                          // 0x0580(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_584[0x4];                                      // 0x0584(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Target;                                            // 0x0588(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class AHTWheeledVehicleDrivable*              Vehicle;                                           // 0x0590(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void OnLoaded_F08A2AB348C3C3F6A5AC0B9EE3BC6E20(class UObject* Loaded);
	void OnLoaded_F08A2AB348C3C3F6A5AC0B9E20513B82(class UObject* Loaded);
	void ExecuteUbergraph_L110106_QTB_CA(int32 EntryPoint);
	void BndEvt__QTB_CA_CollisionComponent_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("L110106_QTB_CA_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"L110106_QTB_CA_C")
	}
	static class AL110106_QTB_CA_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AL110106_QTB_CA_C>();
	}
};
DUMPER7_ASSERTS_AL110106_QTB_CA_C;

}

