#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MassNpc_AnimBP_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function MassNpc_AnimBP_Base.MassNpc_AnimBP_Base_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct MassNpc_AnimBP_Base_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_MassNpc_AnimBP_Base_C_AnimGraph;

// Function MassNpc_AnimBP_Base.MassNpc_AnimBP_Base_C.ExecuteUbergraph_MassNpc_AnimBP_Base
// 0x0004 (0x0004 - 0x0000)
struct MassNpc_AnimBP_Base_C_ExecuteUbergraph_MassNpc_AnimBP_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_MassNpc_AnimBP_Base_C_ExecuteUbergraph_MassNpc_AnimBP_Base;

// Function MassNpc_AnimBP_Base.MassNpc_AnimBP_Base_C.FootIK
// 0x0020 (0x0020 - 0x0000)
struct MassNpc_AnimBP_Base_C_FootIK final
{
public:
	struct FPoseLink                              InPose;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              FootIK_0;                                          // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_MassNpc_AnimBP_Base_C_FootIK;

// Function MassNpc_AnimBP_Base.MassNpc_AnimBP_Base_C.FootIKLayer
// 0x0020 (0x0020 - 0x0000)
struct MassNpc_AnimBP_Base_C_FootIKLayer final
{
public:
	struct FPoseLink                              InPose;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              FootIKLayer_0;                                     // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_MassNpc_AnimBP_Base_C_FootIKLayer;

// Function MassNpc_AnimBP_Base.MassNpc_AnimBP_Base_C.LayerBlending
// 0x0040 (0x0040 - 0x0000)
struct MassNpc_AnimBP_Base_C_LayerBlending final
{
public:
	struct FPoseLink                              Onest_Layer;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Twond_Layer;                                       // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Base_Pose_Layer;                                   // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              LayerBlending_0;                                   // 0x0030(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_MassNpc_AnimBP_Base_C_LayerBlending;

// Function MassNpc_AnimBP_Base.MassNpc_AnimBP_Base_C.Overlay
// 0x0020 (0x0020 - 0x0000)
struct MassNpc_AnimBP_Base_C_Overlay final
{
public:
	struct FPoseLink                              InPose;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Overlay_0;                                         // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_MassNpc_AnimBP_Base_C_Overlay;

// Function MassNpc_AnimBP_Base.MassNpc_AnimBP_Base_C.UpperBodyBlending
// 0x0030 (0x0030 - 0x0000)
struct MassNpc_AnimBP_Base_C_UpperBodyBlending final
{
public:
	struct FPoseLink                              InPoseBase;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              InPoseUppperbody;                                  // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              UpperBodyBlending_0;                               // 0x0020(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_MassNpc_AnimBP_Base_C_UpperBodyBlending;

}

