#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MiniGameAnimLayerBase_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function MiniGameAnimLayerBase_BP.MiniGameAnimLayerBase_BP_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct MiniGameAnimLayerBase_BP_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_MiniGameAnimLayerBase_BP_C_AnimGraph;

// Function MiniGameAnimLayerBase_BP.MiniGameAnimLayerBase_BP_C.ExecuteUbergraph_MiniGameAnimLayerBase_BP
// 0x0018 (0x0018 - 0x0000)
struct MiniGameAnimLayerBase_BP_C_ExecuteUbergraph_MiniGameAnimLayerBase_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_1;          // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue; // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_2;          // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast;         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_MiniGameAnimLayerBase_BP_C_ExecuteUbergraph_MiniGameAnimLayerBase_BP;

// Function MiniGameAnimLayerBase_BP.MiniGameAnimLayerBase_BP_C.MiniGameBaseAiming
// 0x0020 (0x0020 - 0x0000)
struct MiniGameAnimLayerBase_BP_C_MiniGameBaseAiming final
{
public:
	struct FPoseLink                              InPose_0;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              MiniGameBaseAiming_0;                              // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_MiniGameAnimLayerBase_BP_C_MiniGameBaseAiming;

// Function MiniGameAnimLayerBase_BP.MiniGameAnimLayerBase_BP_C.MiniGameBaseMove
// 0x0020 (0x0020 - 0x0000)
struct MiniGameAnimLayerBase_BP_C_MiniGameBaseMove final
{
public:
	struct FPoseLink                              InPose;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              MiniGameBaseMove_0;                                // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_MiniGameAnimLayerBase_BP_C_MiniGameBaseMove;

}

