#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MLPS_BridFly_B_SLY

#include "Basic.hpp"


namespace SDK::Params
{

// Function MLPS_BridFly_B_SLY.MLPS_BridFly_B_SLY_DirectorBP_C.SequenceEvent__ENTRYPOINTMLPS_BridFly_B_SLY_DirectorBP_0
// 0x0008 (0x0008 - 0x0000)
struct MLPS_BridFly_B_SLY_DirectorBP_C_SequenceEvent__ENTRYPOINTMLPS_BridFly_B_SLY_DirectorBP_0 final
{
public:
	class AMLPS_Bird_SLY_C*                       MLPS_Bird_SLY;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_MLPS_BridFly_B_SLY_DirectorBP_C_SequenceEvent__ENTRYPOINTMLPS_BridFly_B_SLY_DirectorBP_0;

// Function MLPS_BridFly_B_SLY.MLPS_BridFly_B_SLY_DirectorBP_C.SequenceEvent__ENTRYPOINTMLPS_BridFly_B_SLY_DirectorBP
// 0x0008 (0x0008 - 0x0000)
struct MLPS_BridFly_B_SLY_DirectorBP_C_SequenceEvent__ENTRYPOINTMLPS_BridFly_B_SLY_DirectorBP final
{
public:
	class AMLPS_Bird_SLY_C*                       MLPS_Bird_SLY;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_MLPS_BridFly_B_SLY_DirectorBP_C_SequenceEvent__ENTRYPOINTMLPS_BridFly_B_SLY_DirectorBP;

// Function MLPS_BridFly_B_SLY.MLPS_BridFly_B_SLY_DirectorBP_C.MLPS_Bird_SLY_Event_0
// 0x0008 (0x0008 - 0x0000)
struct MLPS_BridFly_B_SLY_DirectorBP_C_MLPS_Bird_SLY_Event_0 final
{
public:
	class AMLPS_Bird_SLY_C*                       MLPS_Bird_SLY;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_MLPS_BridFly_B_SLY_DirectorBP_C_MLPS_Bird_SLY_Event_0;

// Function MLPS_BridFly_B_SLY.MLPS_BridFly_B_SLY_DirectorBP_C.MLPS_Bird_SLY_Event
// 0x0008 (0x0008 - 0x0000)
struct MLPS_BridFly_B_SLY_DirectorBP_C_MLPS_Bird_SLY_Event final
{
public:
	class AMLPS_Bird_SLY_C*                       MLPS_Bird_SLY;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_MLPS_BridFly_B_SLY_DirectorBP_C_MLPS_Bird_SLY_Event;

// Function MLPS_BridFly_B_SLY.MLPS_BridFly_B_SLY_DirectorBP_C.ExecuteUbergraph_MLPS_BridFly_B_SLY_DirectorBP
// 0x0018 (0x0018 - 0x0000)
struct MLPS_BridFly_B_SLY_DirectorBP_C_ExecuteUbergraph_MLPS_BridFly_B_SLY_DirectorBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMLPS_Bird_SLY_C*                       K2Node_CustomEvent_MLPS_Bird_SLY;                  // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AMLPS_Bird_SLY_C*                       K2Node_CustomEvent_MLPS_Bird_SLY_1;                // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_MLPS_BridFly_B_SLY_DirectorBP_C_ExecuteUbergraph_MLPS_BridFly_B_SLY_DirectorBP;

}

