#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: mon_02_BP_AnomalyDoorMelee_Drop

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "mon_02_BP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass mon_02_BP_AnomalyDoorMelee_Drop.mon_02_BP_AnomalyDoorMelee_Drop_C
// 0x0030 (0x2A70 - 0x2A40)
class Amon_02_BP_AnomalyDoorMelee_Drop_C final : public Amon_02_BP_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_mon_02_BP_AnomalyDoorMelee_Drop_C;  // 0x2A38(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         ____Alpha_B0EAB36445D79F01226B19BE4F954002;        // 0x2A40(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            _____Direction_B0EAB36445D79F01226B19BE4F954002;   // 0x2A44(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A45[0x3];                                     // 0x2A45(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     时间轴; // 0x2A48(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                InitialLoc;                                        // 0x2A50(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Cus_Drop();
	void ExecuteUbergraph_mon_02_BP_AnomalyDoorMelee_Drop(int32 EntryPoint);
	void 时间轴__FinishedFunc();
	void 时间轴__UpdateFunc();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("mon_02_BP_AnomalyDoorMelee_Drop_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"mon_02_BP_AnomalyDoorMelee_Drop_C")
	}
	static class Amon_02_BP_AnomalyDoorMelee_Drop_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<Amon_02_BP_AnomalyDoorMelee_Drop_C>();
	}
};
DUMPER7_ASSERTS_Amon_02_BP_AnomalyDoorMelee_Drop_C;

}

