#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Mon_38_IdleStates_Pose_stand2

#include "Basic.hpp"


namespace SDK::Params
{

// Function Mon_38_IdleStates_Pose_stand2.Mon_38_IdleStates_Pose_stand2_C.ExecuteUbergraph_Mon_38_IdleStates_Pose_stand2
// 0x0018 (0x0018 - 0x0000)
struct Mon_38_IdleStates_Pose_stand2_C_ExecuteUbergraph_Mon_38_IdleStates_Pose_stand2 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class Amon_38_BP_AIMods_C*                    K2Node_DynamicCast_AsMon_38_BP_AIMods;             // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Mon_38_IdleStates_Pose_stand2_C_ExecuteUbergraph_Mon_38_IdleStates_Pose_stand2;

}

