#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: mon_016_BP_World

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "mon_016_BP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass mon_016_BP_World.mon_016_BP_World_C
// 0x0050 (0x2AC0 - 0x2A70)
#pragma pack(push, 0x1)
class alignas(0x10) Amon_016_BP_World_C : public Amon_016_BP_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_mon_016_BP_World_C;                 // 0x2A70(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         ____0______0_D696BE10483F07FAB57D34917C8D6A13;     // 0x2A78(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            ____0__Direction_D696BE10483F07FAB57D34917C8D6A13; // 0x2A7C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A7D[0x3];                                     // 0x2A7D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     时间轴_0;                                       // 0x2A80(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Return_Value_Location;                             // 0x2A88(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Return_Value_Rotation;                             // 0x2AA0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void BodyMove();
	void ExecuteUbergraph_mon_016_BP_World(int32 EntryPoint);
	void OnBeginBattle();
	void ReceiveBeginPlay();
	void 时间轴_0__FinishedFunc();
	void 时间轴_0__UpdateFunc();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("mon_016_BP_World_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"mon_016_BP_World_C")
	}
	static class Amon_016_BP_World_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<Amon_016_BP_World_C>();
	}
};
#pragma pack(pop)
DUMPER7_ASSERTS_Amon_016_BP_World_C;

}

