#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: mon_016_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "MonsterCharacterBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass mon_016_BP.mon_016_BP_C
// 0x0040 (0x2A70 - 0x2A30)
class Amon_016_BP_C : public AMonsterCharacterBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_mon_016_BP_C;                       // 0x2A28(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          BodyCollisiion;                                    // 0x2A30(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box;                                               // 0x2A38(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           _________1_7E7A95A44AB3E14E99E2EFA3C38C3DAB;       // 0x2A40(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _________4_7E7A95A44AB3E14E99E2EFA3C38C3DAB;       // 0x2A50(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _________3_7E7A95A44AB3E14E99E2EFA3C38C3DAB;       // 0x2A54(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _________2_7E7A95A44AB3E14E99E2EFA3C38C3DAB;       // 0x2A58(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _________0_7E7A95A44AB3E14E99E2EFA3C38C3DAB;       // 0x2A5C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            _____Direction_7E7A95A44AB3E14E99E2EFA3C38C3DAB;   // 0x2A60(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A61[0x7];                                     // 0x2A61(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     时间轴; // 0x2A68(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void BPOnAICharacterDead();
	void ExecuteUbergraph_mon_016_BP(int32 EntryPoint);
	void 时间轴__FinishedFunc();
	void 时间轴__UpdateFunc();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("mon_016_BP_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"mon_016_BP_C")
	}
	static class Amon_016_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<Amon_016_BP_C>();
	}
};
DUMPER7_ASSERTS_Amon_016_BP_C;

}

