#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: mon_016_BP_World_Interaction

#include "Basic.hpp"

#include "HTGame_structs.hpp"


namespace SDK::Params
{

// Function mon_016_BP_World_Interaction.mon_016_BP_World_Interaction_C.ExecuteUbergraph_mon_016_BP_World_Interaction
// 0x0048 (0x0048 - 0x0000)
struct mon_016_BP_World_Interaction_C_ExecuteUbergraph_mon_016_BP_World_Interaction final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AHTPlayerController*                    K2Node_Event_ByPC;                                 // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_InteractIndex;                        // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AHTPlayerCharacter*                     CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_ComponentBoundEvent_InParticipant;          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_ComponentBoundEvent_InEventName;            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAIController*                          CallFunc_GetAIController_ReturnValue;              // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AMonsterControllerBP_Base_C*            K2Node_DynamicCast_AsMonster_Controller_BP_Base;   // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_mon_016_BP_World_Interaction_C_ExecuteUbergraph_mon_016_BP_World_Interaction;

// Function mon_016_BP_World_Interaction.mon_016_BP_World_Interaction_C.BPInteractFinished
// 0x0010 (0x0010 - 0x0000)
struct mon_016_BP_World_Interaction_C_BPInteractFinished final
{
public:
	class AHTPlayerController*                    ByPC;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         InteractIndex;                                     // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_mon_016_BP_World_Interaction_C_BPInteractFinished;

// Function mon_016_BP_World_Interaction.mon_016_BP_World_Interaction_C.BPGetInteractEntries
// 0x0028 (0x0028 - 0x0000)
struct mon_016_BP_World_Interaction_C_BPGetInteractEntries final
{
public:
	class AHTPlayerController*                    ByPC;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FInteractEntry>                 OutInteractEntries;                                // 0x0008(0x0010)(Parm, OutParm, ContainsInstancedReference)
	TArray<struct FInteractEntry>                 K2Node_MakeArray_Array;                            // 0x0018(0x0010)(ReferenceParm, ContainsInstancedReference)
};
DUMPER7_ASSERTS_mon_016_BP_World_Interaction_C_BPGetInteractEntries;

// Function mon_016_BP_World_Interaction.mon_016_BP_World_Interaction_C.BndEvt__mon_016_BP_World_Interaction_HTDialogue_K2Node_ComponentBoundEvent_1_OnDialogueEventDelegate__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct mon_016_BP_World_Interaction_C_BndEvt__mon_016_BP_World_Interaction_HTDialogue_K2Node_ComponentBoundEvent_1_OnDialogueEventDelegate__DelegateSignature final
{
public:
	class FName                                   InParticipant;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   InEventName;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_mon_016_BP_World_Interaction_C_BndEvt__mon_016_BP_World_Interaction_HTDialogue_K2Node_ComponentBoundEvent_1_OnDialogueEventDelegate__DelegateSignature;

}

