#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: mon_21_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "MonsterCharacterBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass mon_21_BP.mon_21_BP_C
// 0x0060 (0x2A90 - 0x2A30)
class Amon_21_BP_C : public AMonsterCharacterBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_mon_21_BP_C;                        // 0x2A28(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          Skill5Box2;                                        // 0x2A30(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box;                                               // 0x2A38(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_Anomaly_023_Skill7_02;                          // 0x2A40(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_Anomaly_023_Skill7_03;                          // 0x2A48(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_Anomaly_023_M;                                  // 0x2A50(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCapsuleComponent*                      Capsule;                                           // 0x2A58(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         _________0_EAA2EC434C6325E5D25D1AB1D306D23D;       // 0x2A60(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            _____Direction_EAA2EC434C6325E5D25D1AB1D306D23D;   // 0x2A64(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A65[0x3];                                     // 0x2A65(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     时间轴; // 0x2A68(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Count;                                             // 0x2A70(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bToShowTimeBuff_;                                  // 0x2A74(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A75[0x3];                                     // 0x2A75(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Probability;                                       // 0x2A78(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          TriggerBlock;                                      // 0x2A80(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Broken;                                            // 0x2A81(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A82[0x2];                                     // 0x2A82(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   data_Yahaha;                                       // 0x2A84(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnArmorBroken();
	void BPOnAICharacterDead();
	void Combo(bool Left);
	void ExecuteUbergraph_mon_21_BP(int32 EntryPoint);
	void NSFlameActivate();
	void On_Block(bool Open);
	void OnDamaged(float DamageAmount, const struct FHitResult& HitInfo, const struct FGameplayTagContainer& DamageTags, const class UHTGamePlayEffect* DamageGameplayEffect, class AHTAbilityCharacter* InstigatorCharacter, class AActor* DamageCauser);
	void OnSeenTarget(bool bSeenOrLost, class AActor* Target);
	void ReceiveBeginPlay();
	void 时间轴__FinishedFunc();
	void 时间轴__UpdateFunc();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("mon_21_BP_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"mon_21_BP_C")
	}
	static class Amon_21_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<Amon_21_BP_C>();
	}
};
DUMPER7_ASSERTS_Amon_21_BP_C;

}

