#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: mon_016_BP_World_Perform

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "mon_016_BP_World_Interaction_classes.hpp"
#include "HTGame_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass mon_016_BP_World_Perform.mon_016_BP_World_Perform_C
// 0x01D0 (0x2E10 - 0x2C40)
class Amon_016_BP_World_Perform_C final : public Amon_016_BP_World_Interaction_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_mon_016_BP_World_Perform_C;         // 0x2C38(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          Check_If_Shaking;                                  // 0x2C40(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                    Billboard_vomit;                                   // 0x2C48(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                    Billboard_overhaul;                                // 0x2C50(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         ____1______0_BCB71FEE4BC78D0905BF86B7D9ECBF3A;     // 0x2C58(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            ____1__Direction_BCB71FEE4BC78D0905BF86B7D9ECBF3A; // 0x2C5C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C5D[0x3];                                     // 0x2C5D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     时间轴_1;                                       // 0x2C60(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           Check_Player_Distance;                             // 0x2C68(0x0008)(Edit, BlueprintVisible, Net, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              Machine_Shaking;                                   // 0x2C70(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              Npc_Flee_Begin;                                    // 0x2C80(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          AI_Activated;                                      // 0x2C90(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C91[0x7];                                     // 0x2C91(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInteractEntry                         IntoBattle_Interact_Entry_0;                       // 0x2C98(0x0168)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class AHTPlayerCharacter*                     As_HTPlayer_Character;                             // 0x2E00(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void 时间轴_1__UpdateFunc();
	void 时间轴_1__FinishedFunc();
	void ReceiveBeginPlay();
	void OnBeginBattle();
	void Monster_Born();
	void ExecuteUbergraph_mon_016_BP_World_Perform(int32 EntryPoint);
	void Checking_Distance();
	void BPOnLeaveBattleEnd();
	void BPOnLeaveBattleBegin();
	void BPInteractFinished(class AHTPlayerController* ByPC, int32 InteractIndex);
	void BPGetInteractEntries_0(class AHTPlayerController* ByPC, TArray<struct FInteractEntry>* OutInteractEntries);
	void BndEvt__mon_016_BP_World_Perform_Check_If_Shaking_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("mon_016_BP_World_Perform_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"mon_016_BP_World_Perform_C")
	}
	static class Amon_016_BP_World_Perform_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<Amon_016_BP_World_Perform_C>();
	}
};
DUMPER7_ASSERTS_Amon_016_BP_World_Perform_C;

}

