#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: mon_14_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "MonsterCharacterBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass mon_14_BP.mon_14_BP_C
// 0x00F0 (0x2B20 - 0x2A30)
class Amon_14_BP_C : public AMonsterCharacterBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_mon_14_BP_C;                        // 0x2A28(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHTNiagaraComponent*                    HTNiagara;                                         // 0x2A30(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          ACT0501;                                           // 0x2A38(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box1;                                              // 0x2A40(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box;                                               // 0x2A48(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         ____6_NewTrack_0_34F04B5445956ED0BD6118BAA617B6F7; // 0x2A50(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            ____6__Direction_34F04B5445956ED0BD6118BAA617B6F7; // 0x2A54(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A55[0x3];                                     // 0x2A55(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     时间轴_6;                                       // 0x2A58(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         ____5_NewTrack_0_CB7A45E9440DB279CD1202B3BDFC627B; // 0x2A60(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            ____5__Direction_CB7A45E9440DB279CD1202B3BDFC627B; // 0x2A64(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A65[0x3];                                     // 0x2A65(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     时间轴_5;                                       // 0x2A68(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         ____4______0_499877F14C01F3B40221AF9E3AEA4A89;     // 0x2A70(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            ____4__Direction_499877F14C01F3B40221AF9E3AEA4A89; // 0x2A74(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A75[0x3];                                     // 0x2A75(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     时间轴_4;                                       // 0x2A78(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           ____3______1_5E98AD3D468ABA01B5C08A884A3E9F22;     // 0x2A80(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ____3______0_5E98AD3D468ABA01B5C08A884A3E9F22;     // 0x2A90(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            ____3__Direction_5E98AD3D468ABA01B5C08A884A3E9F22; // 0x2A94(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A95[0x3];                                     // 0x2A95(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     时间轴_3;                                       // 0x2A98(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         ____0_NewTrack_0_EBFC8D9C4AF615B8E70077A4DC2DF035; // 0x2AA0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            ____0__Direction_EBFC8D9C4AF615B8E70077A4DC2DF035; // 0x2AA4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2AA5[0x3];                                     // 0x2AA5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     时间轴_0;                                       // 0x2AA8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         _________0_17DD541145E45D89021A18AC8D4E900F;       // 0x2AB0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            _____Direction_17DD541145E45D89021A18AC8D4E900F;   // 0x2AB4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2AB5[0x3];                                     // 0x2AB5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     时间轴; // 0x2AB8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_1______0_7D567E0A45A88F357753B996F132C9AE; // 0x2AC0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_1__Direction_7D567E0A45A88F357753B996F132C9AE; // 0x2AC4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2AC5[0x3];                                     // 0x2AC5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_1;                                        // 0x2AC8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_NewTrack_0_16A431E745AE5D20BABEFEA57173024F; // 0x2AD0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_16A431E745AE5D20BABEFEA57173024F; // 0x2AD4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2AD5[0x3];                                     // 0x2AD5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x2AD8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      SwordNigara;                                       // 0x2AE0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         CompleteSword;                                     // 0x2AE8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         BreakSword;                                        // 0x2AF0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         CompleteSwordDisap;                                // 0x2AF8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         BreakSwordDisap;                                   // 0x2B00(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      SwordNigarChange;                                  // 0x2B08(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UHTNiagaraComponent*                    Sword_Break;                                       // 0x2B10(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          IsChange;                                          // 0x2B18(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Isswordend;                                        // 0x2B19(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Isbodyplay;                                        // 0x2B1A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void One1();
	void BP_OnArmorBroken();
	void BPOnAICharacterDead();
	void BPOnLeaveBattleEnd();
	void end_plus();
	void EndBattle();
	void ExecuteUbergraph_mon_14_BP(int32 EntryPoint);
	void IntoBattle();
	void OnBeginBattle();
	void PlayBodyDisplay();
	void PlayBodyHide();
	void ReceiveBeginPlay();
	void shieldbegin();
	void shieldend();
	void swordbegin();
	void SwordChange();
	void swordend();
	void Timeline_0__FinishedFunc();
	void Timeline_0__UpdateFunc();
	void Timeline_1__FinishedFunc();
	void Timeline_1__UpdateFunc();
	void tonghide();
	void 时间轴_0__FinishedFunc();
	void 时间轴_0__UpdateFunc();
	void 时间轴_3__FinishedFunc();
	void 时间轴_3__UpdateFunc();
	void 时间轴_4__FinishedFunc();
	void 时间轴_4__UpdateFunc();
	void 时间轴_5__FinishedFunc();
	void 时间轴_5__UpdateFunc();
	void 时间轴_6__FinishedFunc();
	void 时间轴_6__UpdateFunc();
	void 时间轴__FinishedFunc();
	void 时间轴__UpdateFunc();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("mon_14_BP_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"mon_14_BP_C")
	}
	static class Amon_14_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<Amon_14_BP_C>();
	}
};
DUMPER7_ASSERTS_Amon_14_BP_C;

}

