#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: mon_38_BP_AIMods

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_ModsCharacter_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass mon_38_BP_AIMods.mon_38_BP_AIMods_C
// 0x0040 (0x2A60 - 0x2A20)
class Amon_38_BP_AIMods_C : public ABP_ModsCharacter_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_mon_38_BP_AIMods_C;                 // 0x2A20(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          CanDIsplayWeapon;                                  // 0x2A28(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsBornWithWeapon;                                  // 0x2A29(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A2A[0x6];                                     // 0x2A2A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMaterialInterface*>             HideWeapon;                                        // 0x2A30(0x0010)(Edit, BlueprintVisible)
	TArray<class UMaterialInterface*>             ShowWeapon;                                        // 0x2A40(0x0010)(Edit, BlueprintVisible)
	class UAnimMontage*                           IntoWithWeaponMontage;                             // 0x2A50(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           IntoWithOutWeaponMontage;                          // 0x2A58(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_mon_38_BP_AIMods(int32 EntryPoint);
	void MontageNoftiy_ShowWeapon(class FName NotifyName, const struct FBranchingPointNotifyPayload& BranchingPointPayload);
	void OnBattleStateChange(bool bInFight);
	void OnBeginBattle();
	void OnEndBattle();
	void ReceiveBeginPlay();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void WeaponDisplay();
	void 自定义事件(const struct FVehicleInteractInfo& VehicleInfo);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("mon_38_BP_AIMods_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"mon_38_BP_AIMods_C")
	}
	static class Amon_38_BP_AIMods_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<Amon_38_BP_AIMods_C>();
	}
};
DUMPER7_ASSERTS_Amon_38_BP_AIMods_C;

}

