#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: mon_Trigger_CrowdShoot

#include "Basic.hpp"

#include "HTGame_structs.hpp"


namespace SDK::Params
{

// Function mon_Trigger_CrowdShoot.mon_Trigger_CrowdShoot_C.BndEvt__Bp_ActiveBasketball_HTDialogue_K2Node_ComponentBoundEvent_0_OnDialogueEventDelegate__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct mon_Trigger_CrowdShoot_C_BndEvt__Bp_ActiveBasketball_HTDialogue_K2Node_ComponentBoundEvent_0_OnDialogueEventDelegate__DelegateSignature final
{
public:
	class FName                                   InParticipant;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   InEventName;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_mon_Trigger_CrowdShoot_C_BndEvt__Bp_ActiveBasketball_HTDialogue_K2Node_ComponentBoundEvent_0_OnDialogueEventDelegate__DelegateSignature;

// Function mon_Trigger_CrowdShoot.mon_Trigger_CrowdShoot_C.BPGetInteractEntries
// 0x0028 (0x0028 - 0x0000)
struct mon_Trigger_CrowdShoot_C_BPGetInteractEntries final
{
public:
	class AHTPlayerController*                    ByPC;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FInteractEntry>                 OutInteractEntries;                                // 0x0008(0x0010)(Parm, OutParm, ContainsInstancedReference)
	TArray<struct FInteractEntry>                 K2Node_MakeArray_Array;                            // 0x0018(0x0010)(ReferenceParm, ContainsInstancedReference)
};
DUMPER7_ASSERTS_mon_Trigger_CrowdShoot_C_BPGetInteractEntries;

// Function mon_Trigger_CrowdShoot.mon_Trigger_CrowdShoot_C.BPInteractFinished
// 0x0010 (0x0010 - 0x0000)
struct mon_Trigger_CrowdShoot_C_BPInteractFinished final
{
public:
	class AHTPlayerController*                    ByPC;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         InteractIndex;                                     // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_mon_Trigger_CrowdShoot_C_BPInteractFinished;

// Function mon_Trigger_CrowdShoot.mon_Trigger_CrowdShoot_C.ExecuteUbergraph_mon_Trigger_CrowdShoot
// 0x0068 (0x0068 - 0x0000)
struct mon_Trigger_CrowdShoot_C_ExecuteUbergraph_mon_Trigger_CrowdShoot final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_DoubleToString_ReturnValue;          // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AHTPlayerController*                    K2Node_Event_ByPC;                                 // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_InteractIndex;                        // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AHTPlayerCharacter*                     CallFunc_GetClientPlayerCharacter_ReturnValue;     // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_ComponentBoundEvent_InParticipant;          // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_ComponentBoundEvent_InEventName;            // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable;                                // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_ImplicitCast;              // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_mon_Trigger_CrowdShoot_C_ExecuteUbergraph_mon_Trigger_CrowdShoot;

// Function mon_Trigger_CrowdShoot.mon_Trigger_CrowdShoot_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct mon_Trigger_CrowdShoot_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_mon_Trigger_CrowdShoot_C_ReceiveTick;

}

