#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: mon_38_BP_AIMods

#include "Basic.hpp"

#include "HTGame_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function mon_38_BP_AIMods.mon_38_BP_AIMods_C.ExecuteUbergraph_mon_38_BP_AIMods
// 0x0088 (0x0088 - 0x0000)
struct mon_38_BP_AIMods_C_ExecuteUbergraph_mon_38_BP_AIMods final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bInFight)>                K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName, const struct FBranchingPointNotifyPayload& BranchingPointPayload)> K2Node_CreateDelegate_OutputDelegate_1; // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVehicleInteractInfo                   K2Node_CustomEvent_VehicleInfo;                    // 0x0024(0x001C)(NoDestructor)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bInFight;                       // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName;                     // 0x0044(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBranchingPointNotifyPayload           K2Node_CustomEvent_BranchingPointPayload;          // 0x0050(0x0020)(ConstParm, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_1;        // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_72[0x2];                                       // 0x0072(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FVehicleInteractInfo& VehicleInfo)> K2Node_CreateDelegate_OutputDelegate_2; // 0x0074(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_mon_38_BP_AIMods_C_ExecuteUbergraph_mon_38_BP_AIMods;

// Function mon_38_BP_AIMods.mon_38_BP_AIMods_C.MontageNoftiy_ShowWeapon
// 0x0028 (0x0028 - 0x0000)
struct mon_38_BP_AIMods_C_MontageNoftiy_ShowWeapon final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBranchingPointNotifyPayload           BranchingPointPayload;                             // 0x0008(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
DUMPER7_ASSERTS_mon_38_BP_AIMods_C_MontageNoftiy_ShowWeapon;

// Function mon_38_BP_AIMods.mon_38_BP_AIMods_C.OnBattleStateChange
// 0x0001 (0x0001 - 0x0000)
struct mon_38_BP_AIMods_C_OnBattleStateChange final
{
public:
	bool                                          bInFight;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_mon_38_BP_AIMods_C_OnBattleStateChange;

// Function mon_38_BP_AIMods.mon_38_BP_AIMods_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct mon_38_BP_AIMods_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_mon_38_BP_AIMods_C_ReceiveEndPlay;

// Function mon_38_BP_AIMods.mon_38_BP_AIMods_C.自定义事件
// 0x001C (0x001C - 0x0000)
struct mon_38_BP_AIMods_C_自定义事件 final
{
public:
	struct FVehicleInteractInfo                   VehicleInfo;                                       // 0x0000(0x001C)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
DUMPER7_ASSERTS_mon_38_BP_AIMods_C_自定义事件;

}

