#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: mon_016_bullet_act01_2_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_ProjectileBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass mon_016_bullet_act01_2_BP.mon_016_bullet_act01_2_BP_C
// 0x0030 (0x07C0 - 0x0790)
class Amon_016_bullet_act01_2_BP_C final : public ABP_ProjectileBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0790(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          BoxTriggerLinkTime;                                // 0x0798(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         _________1_D8138A2D472D3B9B5BD99DB9F627B2A3;       // 0x07A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _________0_D8138A2D472D3B9B5BD99DB9F627B2A3;       // 0x07A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            _____Direction_D8138A2D472D3B9B5BD99DB9F627B2A3;   // 0x07A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7A9[0x7];                                      // 0x07A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     时间轴; // 0x07B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_mon_016_bullet_act01_2_BP(int32 EntryPoint);
	void ReceiveBeginPlay();
	void 时间轴__FinishedFunc();
	void 时间轴__UpdateFunc();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("mon_016_bullet_act01_2_BP_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"mon_016_bullet_act01_2_BP_C")
	}
	static class Amon_016_bullet_act01_2_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<Amon_016_bullet_act01_2_BP_C>();
	}
};
DUMPER7_ASSERTS_Amon_016_bullet_act01_2_BP_C;

}

