#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MonsterCharacterBase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HTGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass MonsterCharacterBase.MonsterCharacterBase_C
// 0x0050 (0x2A30 - 0x29E0)
#pragma pack(push, 0x1)
class alignas(0x10) AMonsterCharacterBase_C : public AHTMonsterCharacter
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x29E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHTGlobalSnowInteractorComponent*       HTGlobalSnowInteractor;                            // 0x29E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHTThreatenComponent*                   HTThreaten;                                        // 0x29F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCharacterHeadUpComp_BP_C*              CharacterHeadUpComp_BP;                            // 0x29F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_PostEffect_UVDistortion_3FF93D5049DA29A889E088BC3756BF50; // 0x2A00(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_PostEffect__Direction_3FF93D5049DA29A889E088BC3756BF50; // 0x2A04(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A05[0x3];                                     // 0x2A05(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_PostEffect;                               // 0x2A08(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_NewTrack_0_C1BE75FF4B3898347575E19E6315FC8E; // 0x2A10(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline__Direction_C1BE75FF4B3898347575E19E6315FC8E; // 0x2A14(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A15[0x3];                                     // 0x2A15(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline;                                          // 0x2A18(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               PostMaterialDynamic;                               // 0x2A20(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void Timeline_PostEffect__UpdateFunc();
	void Timeline_PostEffect__FinishedFunc();
	void Timeline__UpdateFunc();
	void Timeline__FinishedFunc();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void PlayPostGlithEffect(bool PlayForward);
	void ExecuteUbergraph_MonsterCharacterBase(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("MonsterCharacterBase_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MonsterCharacterBase_C")
	}
	static class AMonsterCharacterBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMonsterCharacterBase_C>();
	}
};
#pragma pack(pop)
DUMPER7_ASSERTS_AMonsterCharacterBase_C;

}

