#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NPCAnimWithPhyBP_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "HTGame_structs.hpp"
#include "HTGame_classes.hpp"
#include "NPCAnimWithPhyBP_Base_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass NPCAnimWithPhyBP_Base.NPCAnimWithPhyBP_Base_C
// 0x3870 (0x4790 - 0x0F20)
class UNPCAnimWithPhyBP_Base_C : public UHTNPCAnimInstance
{
public:
	uint8                                         Pad_F18[0x8];                                      // 0x0F18(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0F20(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct NPCAnimWithPhyBP_Base::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;        // 0x0F28(0x0048)(HasGetValueTypeHash)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0F70(0x0008)()
	struct FAnimSubsystemInstance_NodeRelevancy   AnimBlueprintExtension_NodeRelevancy;              // 0x0F78(0x00A8)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x1020(0x0008)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_8;                   // 0x1028(0x00B8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_10;                             // 0x10E0(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_7;                   // 0x1100(0x00B8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_9;                              // 0x11B8(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_6;                   // 0x11D8(0x00B8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_8;                              // 0x1290(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_5;                   // 0x12B0(0x00B8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_7;                              // 0x1368(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_4;                   // 0x1388(0x00B8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_6;                              // 0x1440(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_5;                              // 0x1460(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_3;                   // 0x1480(0x00B8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_16;                   // 0x1538(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_30;                    // 0x15B8(0x0028)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_4;                   // 0x15E0(0x00C8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_4;                              // 0x16A8(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_2;                   // 0x16C8(0x00B8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_3;                              // 0x1780(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_1;                   // 0x17A0(0x00B8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_2;                              // 0x1858(0x0020)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_11;                             // 0x1878(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_15;                   // 0x18C0(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_29;                    // 0x1940(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_10;                             // 0x1968(0x0048)()
	struct FHTAnimNode_Slot                       HTAnimMontageSlotAGN;                              // 0x19B0(0x0050)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_14;                   // 0x1A00(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_28;                    // 0x1A80(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_4;                  // 0x1AA8(0x00E8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_27;                    // 0x1B90(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_13;                   // 0x1BB8(0x0080)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_9;                              // 0x1C38(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_3;                  // 0x1C80(0x00E8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_12;                   // 0x1D68(0x0080)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_8;                              // 0x1DE8(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_11;                   // 0x1E30(0x0080)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_11;                  // 0x1EB0(0x0050)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_10;                  // 0x1F00(0x0050)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_26;                    // 0x1F50(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_7;                              // 0x1F78(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_25;                    // 0x1FC0(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_2;                  // 0x1FE8(0x00E8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_9;                   // 0x20D0(0x0050)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_10;                   // 0x2120(0x0080)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_1;                  // 0x21A0(0x00E8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_24;                    // 0x2288(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_9;                    // 0x22B0(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_23;                    // 0x2330(0x0028)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x2358(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x2378(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x2398(0x00B8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_8;                    // 0x2450(0x0080)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x24D0(0x0020)()
	struct FHTAimOffsetAnimNode                   HTAimOffsetAnimGraphNode;                          // 0x24F0(0x0168)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_3;                   // 0x2658(0x00C8)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x2720(0x0020)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace;            // 0x2740(0x0118)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5;                  // 0x2858(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4;                  // 0x2880(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x28A8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x28D0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x28F8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x2920(0x0028)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve_3;                       // 0x2948(0x0120)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x2A68(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x2AB0(0x0020)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_3;                  // 0x2AD0(0x0070)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_8;                   // 0x2B40(0x0050)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve_2;                       // 0x2B90(0x0120)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_2;                  // 0x2CB0(0x0070)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_7;                   // 0x2D20(0x0050)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_1;                  // 0x2D70(0x0070)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x2DE0(0x0020)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer;                    // 0x2E00(0x0070)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_6;                   // 0x2E70(0x0050)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve_1;                       // 0x2EC0(0x0120)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_5;                   // 0x2FE0(0x0050)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x3030(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x3078(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x30C0(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x30E0(0x00C8)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_6;                              // 0x31A8(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_7;                    // 0x31F0(0x0080)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_2;                   // 0x3270(0x00C8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_22;                    // 0x3338(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_21;                    // 0x3360(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_4;                   // 0x3388(0x0050)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_20;                    // 0x33D8(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_6;                    // 0x3400(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_19;                    // 0x3480(0x0028)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve;                         // 0x34A8(0x0120)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_18;                    // 0x35C8(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_5;                              // 0x35F0(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_5;                    // 0x3638(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_17;                    // 0x36B8(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_4;                              // 0x36E0(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_3;                              // 0x3728(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x3770(0x00E8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_16;                    // 0x3858(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_15;                    // 0x3880(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_2;                              // 0x38A8(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_4;                    // 0x38F0(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_14;                    // 0x3970(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_13;                    // 0x3998(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_12;                    // 0x39C0(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_3;                    // 0x39E8(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_11;                    // 0x3A68(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1;                              // 0x3A90(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_3;                   // 0x3AD8(0x0050)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_10;                    // 0x3B28(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_2;                   // 0x3B50(0x0050)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_9;                     // 0x3BA0(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1;                   // 0x3BC8(0x0050)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_8;                     // 0x3C18(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x3C40(0x0050)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_7;                     // 0x3C90(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_6;                     // 0x3CB8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_5;                     // 0x3CE0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_4;                     // 0x3D08(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_3;                     // 0x3D30(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x3D58(0x0048)()
	struct FAnimNode_Inertialization              AnimGraphNode_Inertialization;                     // 0x3DA0(0x0550)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_1;                   // 0x42F0(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_2;                    // 0x43B8(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0x4438(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x4460(0x0028)()
	struct FAnimNode_SlotSequence                 AnimGraphNode_SlotSequence;                        // 0x4488(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1;                    // 0x44D0(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x4550(0x0028)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer;                     // 0x4578(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x4640(0x0080)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend;                         // 0x46C0(0x00C8)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void BlueprintLinkedAnimationLayersInitialized();
	void CleanIdleImmediately();
	void DriveLayer(const struct FPoseLink& InPose, struct FPoseLink* DriveLayer_0);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_NPCAnimWithPhyBP_Base_AnimGraphNode_TransitionResult_540F4B1C43086653EA444E9266134FC9();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_NPCAnimWithPhyBP_Base_AnimGraphNode_TransitionResult_8522AC404C673755876056866FDCC7DA();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_NPCAnimWithPhyBP_Base_AnimGraphNode_TransitionResult_8E9428314966C4258345279A35AC9885();
	void ExecuteUbergraph_NPCAnimWithPhyBP_Base(int32 EntryPoint);
	void FootIKLayer(const struct FPoseLink& InPose, struct FPoseLink* FootIKLayer_0);
	void HTAITurnL_BP(float TurnAngle, float fPlayRate);
	void HTAITurnR_BP(float TurnAngle, float fPlayRate);
	void InteractAnimationLayer(const struct FPoseLink& InPose, struct FPoseLink* InteractAnimationLayer_0);
	void InteractIKLayer(const struct FPoseLink& InPose_0, struct FPoseLink* InteractIKLayer_0);
	void NPCBoneShakeLayer(const struct FPoseLink& InPose, double Push_Scale, double BlendAlpha_0, struct FPoseLink* NPCBoneShakeLayer_0);
	void NPCControlRigLayer(struct FPoseLink* NPCControlRigLayer_0);
	void NPCFootIK(const struct FPoseLink& InPose_1, struct FPoseLink* NPCFootIK_0);
	void NPCHitAnim(const struct FPoseLink& InPose_2, struct FPoseLink* NPCHitAnim_0);
	void NPCIKAnimation_Layer(const struct FPoseLink& InPose_0, double InputParam, struct FPoseLink* NPCIKAnimation_Layer_0);
	void PhysicsAnimInterface(const struct FPoseLink& InPose, struct FPoseLink* PhysicsAnimInterface_0);
	void PlayDynamicTransition(const struct FDynamicMontageParams& Parameters, double RetriggerDelay);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("NPCAnimWithPhyBP_Base_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NPCAnimWithPhyBP_Base_C")
	}
	static class UNPCAnimWithPhyBP_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNPCAnimWithPhyBP_Base_C>();
	}
};
DUMPER7_ASSERTS_UNPCAnimWithPhyBP_Base_C;

}

