#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: paperairplane_Perform

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function paperairplane_Perform.paperairplane_Perform_C.BndEvt__paperairplane_Perform_Perform_range_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature
// 0x0128 (0x0128 - 0x0000)
struct paperairplane_Perform_C_BndEvt__paperairplane_Perform_Perform_range_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x0108)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
DUMPER7_ASSERTS_paperairplane_Perform_C_BndEvt__paperairplane_Perform_Perform_range_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature;

// Function paperairplane_Perform.paperairplane_Perform_C.BPInteractFinishEffect
// 0x0010 (0x0010 - 0x0000)
struct paperairplane_Perform_C_BPInteractFinishEffect final
{
public:
	class AHTPlayerController*                    ByPC;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         InteractIndex;                                     // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_paperairplane_Perform_C_BPInteractFinishEffect;

// Function paperairplane_Perform.paperairplane_Perform_C.ExecuteUbergraph_paperairplane_Perform
// 0x0408 (0x0408 - 0x0000)
struct paperairplane_Perform_C_ExecuteUbergraph_paperairplane_Perform final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHTSpawnAsyncAction_Query*              CallFunc_QuerySpawnResult_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHTAISpawnManager*                      K2Node_CustomEvent_Spawn_8;                        // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AHTAISpawnManager* Spawn)> K2Node_CreateDelegate_OutputDelegate;            // 0x0020(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHTAISpawnManager*                      Temp_object_Variable;                              // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UHottaPrimaryDataAsset* HottaPrimaryDataAsset)> K2Node_CreateDelegate_OutputDelegate_1; // 0x0038(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHTAISpawnManager*                      K2Node_CustomEvent_Spawn_7;                        // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AHTAISpawnManager* Spawn)> K2Node_CreateDelegate_OutputDelegate_2;          // 0x0050(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHTAISpawnManager*                      K2Node_CustomEvent_Spawn_6;                        // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AHTAISpawnManager* Spawn)> K2Node_CreateDelegate_OutputDelegate_3;          // 0x0068(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHTAISpawnManager*                      Temp_object_Variable_1;                            // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AHTAISpawnManager* Spawn)> K2Node_CreateDelegate_OutputDelegate_4;          // 0x0080(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHTAISpawnManager*                      K2Node_CustomEvent_Spawn_5;                        // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHTAISpawnManager*                      K2Node_CustomEvent_Spawn_4;                        // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AHTAISpawnManager* Spawn)> K2Node_CreateDelegate_OutputDelegate_5;          // 0x00A0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHTAISpawnManager*                      Temp_object_Variable_2;                            // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AHTAISpawnManager* Spawn)> K2Node_CreateDelegate_OutputDelegate_6;          // 0x00B8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHTAISpawnManager*                      K2Node_CustomEvent_Spawn_3;                        // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHTAISpawnManager*                      K2Node_CustomEvent_Spawn_2;                        // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AHTAISpawnManager* Spawn)> K2Node_CreateDelegate_OutputDelegate_7;          // 0x00D8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHTAISpawnManager*                      Temp_object_Variable_3;                            // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AHTAISpawnManager* Spawn)> K2Node_CreateDelegate_OutputDelegate_8;          // 0x00F0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHTAISpawnManager*                      K2Node_CustomEvent_Spawn_1;                        // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHTAISpawnManager*                      K2Node_CustomEvent_Spawn;                          // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AHTAISpawnManager* Spawn)> K2Node_CreateDelegate_OutputDelegate_9;          // 0x0110(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHTAISpawnManager*                      Temp_object_Variable_4;                            // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable_5;                            // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHTAISpawnManager*                      K2Node_CustomEvent_Spawn_9;                        // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AHTAISpawnManager* Spawn)> K2Node_CreateDelegate_OutputDelegate_10;         // 0x0140(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHTGameInstance*                        K2Node_DynamicCast_AsHTGame_Instance;              // 0x0168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_1;            // 0x0178(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AUltraDynamicSkyBase*                   CallFunc_GetUltraDynamicSkyActor_ReturnValue;      // 0x0180(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_189[0x7];                                      // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHTGameInstance*                        K2Node_DynamicCast_AsHTGame_Instance_1;            // 0x0190(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_199[0x7];                                      // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AUltraDynamicSkyBase*                   CallFunc_GetUltraDynamicSkyActor_ReturnValue_1;    // 0x01A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_11;           // 0x01A8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B9[0x7];                                      // 0x01B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x01C0(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x01C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_2;                     // 0x01CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable_2;               // 0x01CB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1CC[0x4];                                      // 0x01CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x01D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x01D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x01E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x01EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1ED[0x3];                                      // 0x01ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x01F0(0x0108)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AHTPlayerCharacter*                     K2Node_DynamicCast_AsHTPlayer_Character;           // 0x02F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_301[0x7];                                      // 0x0301(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0308(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x0310(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_311[0x7];                                      // 0x0311(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHTAISpawnManager*                      K2Node_DynamicCast_AsHTAISpawn_Manager;            // 0x0318(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_321[0x7];                                      // 0x0321(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHTPlayerController*                    K2Node_Event_ByPC;                                 // 0x0328(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_InteractIndex;                        // 0x0330(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_334[0x4];                                      // 0x0334(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHTDynmicSkySubsystem*                  CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0338(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_1; // 0x0340(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0348(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_349[0x7];                                      // 0x0349(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHTAISpawnManager*                      K2Node_DynamicCast_AsHTAISpawn_Manager_1;          // 0x0350(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0358(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_359[0x7];                                      // 0x0359(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHTSpawnAsyncAction_Query*              CallFunc_QuerySpawnResult_ReturnValue_1;           // 0x0360(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHottaPrimaryDataAsset*                 CallFunc_GetCurrentWeather_ReturnValue;            // 0x0368(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0370(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue;      // 0x0371(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue_1;    // 0x0372(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue_2;    // 0x0373(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0374(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_375[0x3];                                      // 0x0375(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UHottaPrimaryDataAsset*                 K2Node_CustomEvent_HottaPrimaryDataAsset;          // 0x0378(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHTSpawnAsyncAction_Query*              CallFunc_QuerySpawnResult_ReturnValue_2;           // 0x0380(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHTSpawnAsyncAction_Query*              CallFunc_QuerySpawnResult_ReturnValue_3;           // 0x0388(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0390(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x0391(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_392[0x6];                                      // 0x0392(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UHTDynmicSkySubsystem*                  CallFunc_GetWorldSubsystem_ReturnValue_1;          // 0x0398(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x03A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A1[0x7];                                      // 0x03A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHottaPrimaryDataAsset*                 CallFunc_GetCurrentWeather_ReturnValue_1;          // 0x03A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x03B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue_3;    // 0x03B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue_4;    // 0x03B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue_5;    // 0x03B3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B4[0x4];                                      // 0x03B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHTSpawnAsyncAction_Query*              CallFunc_QuerySpawnResult_ReturnValue_4;           // 0x03B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_12;           // 0x03C0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_10;                   // 0x03D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D1[0x7];                                      // 0x03D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast;   // 0x03D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast_1; // 0x03E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast_2; // 0x03E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast_3; // 0x03F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast_4; // 0x03F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast_5; // 0x0400(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_paperairplane_Perform_C_ExecuteUbergraph_paperairplane_Perform;

// Function paperairplane_Perform.paperairplane_Perform_C.OnFail_03814E474FC24FA6D6B059B1A58F4840
// 0x0008 (0x0008 - 0x0000)
struct paperairplane_Perform_C_OnFail_03814E474FC24FA6D6B059B1A58F4840 final
{
public:
	class AHTAISpawnManager*                      Spawn_0;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_paperairplane_Perform_C_OnFail_03814E474FC24FA6D6B059B1A58F4840;

// Function paperairplane_Perform.paperairplane_Perform_C.OnFail_12E86E804C5BCAD33410BEA2B4BC7410
// 0x0008 (0x0008 - 0x0000)
struct paperairplane_Perform_C_OnFail_12E86E804C5BCAD33410BEA2B4BC7410 final
{
public:
	class AHTAISpawnManager*                      Spawn_0;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_paperairplane_Perform_C_OnFail_12E86E804C5BCAD33410BEA2B4BC7410;

// Function paperairplane_Perform.paperairplane_Perform_C.OnFail_7BF42BE94DB8C55FDCF833B29E4B6C4B
// 0x0008 (0x0008 - 0x0000)
struct paperairplane_Perform_C_OnFail_7BF42BE94DB8C55FDCF833B29E4B6C4B final
{
public:
	class AHTAISpawnManager*                      Spawn_0;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_paperairplane_Perform_C_OnFail_7BF42BE94DB8C55FDCF833B29E4B6C4B;

// Function paperairplane_Perform.paperairplane_Perform_C.OnFail_CF2671B4405DF30DBAFF738423C24328
// 0x0008 (0x0008 - 0x0000)
struct paperairplane_Perform_C_OnFail_CF2671B4405DF30DBAFF738423C24328 final
{
public:
	class AHTAISpawnManager*                      Spawn_0;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_paperairplane_Perform_C_OnFail_CF2671B4405DF30DBAFF738423C24328;

// Function paperairplane_Perform.paperairplane_Perform_C.OnFail_DF4CF84A4BD53D293836D8BBDD4CC374
// 0x0008 (0x0008 - 0x0000)
struct paperairplane_Perform_C_OnFail_DF4CF84A4BD53D293836D8BBDD4CC374 final
{
public:
	class AHTAISpawnManager*                      Spawn_0;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_paperairplane_Perform_C_OnFail_DF4CF84A4BD53D293836D8BBDD4CC374;

// Function paperairplane_Perform.paperairplane_Perform_C.OnLoaded_F6DDFC9D4FBB8A6BABBA3CBA1F64F034
// 0x0008 (0x0008 - 0x0000)
struct paperairplane_Perform_C_OnLoaded_F6DDFC9D4FBB8A6BABBA3CBA1F64F034 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_paperairplane_Perform_C_OnLoaded_F6DDFC9D4FBB8A6BABBA3CBA1F64F034;

// Function paperairplane_Perform.paperairplane_Perform_C.OnSuccess_03814E474FC24FA6D6B059B1A58F4840
// 0x0008 (0x0008 - 0x0000)
struct paperairplane_Perform_C_OnSuccess_03814E474FC24FA6D6B059B1A58F4840 final
{
public:
	class AHTAISpawnManager*                      Spawn_0;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_paperairplane_Perform_C_OnSuccess_03814E474FC24FA6D6B059B1A58F4840;

// Function paperairplane_Perform.paperairplane_Perform_C.OnSuccess_12E86E804C5BCAD33410BEA2B4BC7410
// 0x0008 (0x0008 - 0x0000)
struct paperairplane_Perform_C_OnSuccess_12E86E804C5BCAD33410BEA2B4BC7410 final
{
public:
	class AHTAISpawnManager*                      Spawn_0;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_paperairplane_Perform_C_OnSuccess_12E86E804C5BCAD33410BEA2B4BC7410;

// Function paperairplane_Perform.paperairplane_Perform_C.OnSuccess_7BF42BE94DB8C55FDCF833B29E4B6C4B
// 0x0008 (0x0008 - 0x0000)
struct paperairplane_Perform_C_OnSuccess_7BF42BE94DB8C55FDCF833B29E4B6C4B final
{
public:
	class AHTAISpawnManager*                      Spawn_0;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_paperairplane_Perform_C_OnSuccess_7BF42BE94DB8C55FDCF833B29E4B6C4B;

// Function paperairplane_Perform.paperairplane_Perform_C.OnSuccess_CF2671B4405DF30DBAFF738423C24328
// 0x0008 (0x0008 - 0x0000)
struct paperairplane_Perform_C_OnSuccess_CF2671B4405DF30DBAFF738423C24328 final
{
public:
	class AHTAISpawnManager*                      Spawn_0;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_paperairplane_Perform_C_OnSuccess_CF2671B4405DF30DBAFF738423C24328;

// Function paperairplane_Perform.paperairplane_Perform_C.OnSuccess_DF4CF84A4BD53D293836D8BBDD4CC374
// 0x0008 (0x0008 - 0x0000)
struct paperairplane_Perform_C_OnSuccess_DF4CF84A4BD53D293836D8BBDD4CC374 final
{
public:
	class AHTAISpawnManager*                      Spawn_0;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_paperairplane_Perform_C_OnSuccess_DF4CF84A4BD53D293836D8BBDD4CC374;

// Function paperairplane_Perform.paperairplane_Perform_C.Weather Change Event
// 0x0008 (0x0008 - 0x0000)
struct paperairplane_Perform_C_Weather_Change_Event final
{
public:
	class UHottaPrimaryDataAsset*                 HottaPrimaryDataAsset;                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_paperairplane_Perform_C_Weather_Change_Event;

}

