#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: paperairplane_Perform

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "paperairplane_base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass paperairplane_Perform.paperairplane_Perform_C
// 0x0050 (0x0E38 - 0x0DE8)
class Apaperairplane_Perform_C final : public Apaperairplane_base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_paperairplane_Perform_C;            // 0x0DE8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          Perform_range;                                     // 0x0DF0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              Mailbox_Open;                                      // 0x0DF8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TSoftObjectPtr<class AHTAISpawnManager>       NPC_Spawn;                                         // 0x0E08(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FTimerHandle                           Timer_Handle;                                      // 0x0E30(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__paperairplane_Perform_Perform_range_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void BPInteractFinishEffect(class AHTPlayerController* ByPC, int32 InteractIndex);
	void Check_Weather_to_Spawn();
	void ExecuteUbergraph_paperairplane_Perform(int32 EntryPoint);
	void Interact_when_Rain();
	void Leave_battle();
	void OnFail_03814E474FC24FA6D6B059B1A58F4840(class AHTAISpawnManager* Spawn_0);
	void OnFail_12E86E804C5BCAD33410BEA2B4BC7410(class AHTAISpawnManager* Spawn_0);
	void OnFail_7BF42BE94DB8C55FDCF833B29E4B6C4B(class AHTAISpawnManager* Spawn_0);
	void OnFail_CF2671B4405DF30DBAFF738423C24328(class AHTAISpawnManager* Spawn_0);
	void OnFail_DF4CF84A4BD53D293836D8BBDD4CC374(class AHTAISpawnManager* Spawn_0);
	void OnLoaded_F6DDFC9D4FBB8A6BABBA3CBA1F64F034(class UObject* Loaded);
	void OnSuccess_03814E474FC24FA6D6B059B1A58F4840(class AHTAISpawnManager* Spawn_0);
	void OnSuccess_12E86E804C5BCAD33410BEA2B4BC7410(class AHTAISpawnManager* Spawn_0);
	void OnSuccess_7BF42BE94DB8C55FDCF833B29E4B6C4B(class AHTAISpawnManager* Spawn_0);
	void OnSuccess_CF2671B4405DF30DBAFF738423C24328(class AHTAISpawnManager* Spawn_0);
	void OnSuccess_DF4CF84A4BD53D293836D8BBDD4CC374(class AHTAISpawnManager* Spawn_0);
	void ReceiveBeginPlay();
	void Reset_Perform_Range();
	void Reset_Rain();
	void Reset_Sunny();
	void Spawn_when_Sunny();
	void Weather_Change_Event(class UHottaPrimaryDataAsset* HottaPrimaryDataAsset);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("paperairplane_Perform_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"paperairplane_Perform_C")
	}
	static class Apaperairplane_Perform_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<Apaperairplane_Perform_C>();
	}
};
DUMPER7_ASSERTS_Apaperairplane_Perform_C;

}

