#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PDA_FluxWaveProfile_0

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass PDA_FluxWaveProfile.PDA_FluxWaveProfile_C
// 0x0030 (0x0060 - 0x0030)
class PDA_FluxWaveProfile_0::UPDA_FluxWaveProfile_C final : public UPrimaryDataAsset
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0030(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTexture*                               WaveProfileForwardMap;                             // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               WaveProfileInverseMap;                             // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           WaveProfileDecode;                                 // 0x0048(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Frames;                                            // 0x0058(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         WaveHeight;                                        // 0x005C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ClearExternalReferences();
	void CopyPropertiesToObject(class UObject* Destination, bool* Done);
	void ExecuteUbergraph_PDA_FluxWaveProfile(int32 EntryPoint);
	void GetExternalReferences(TArray<class UTexture*>* Objects);
	void SetWaveProfileData(class UTexture* WaveProfilesForward, class UTexture* WaveProfilesInverse, const struct FLinearColor& WaveProfileDecode_0, int32 Frames_0, int32 WaveWidth, int32 WaveHeight_0);

	void ApplyWaveProfileMaterialData(TArray<class UMaterialInstanceDynamic*>& Materials) const;
	void ApplyWaveProfileNiagaraData(class UNiagaraComponent* NiagaraSystem) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL_FULLNAME("BlueprintGeneratedClass PDA_FluxWaveProfile.PDA_FluxWaveProfile_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PDA_FluxWaveProfile_C")
	}
	static class PDA_FluxWaveProfile_0::UPDA_FluxWaveProfile_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<PDA_FluxWaveProfile_0::UPDA_FluxWaveProfile_C>();
	}
};
DUMPER7_ASSERTS_PDA_FluxWaveProfile_0__UPDA_FluxWaveProfile_C;

}

