#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PDA_FluxSignedDistanceField

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass PDA_FluxSignedDistanceField.PDA_FluxSignedDistanceField_C
// 0x0050 (0x0080 - 0x0030)
class UPDA_FluxSignedDistanceField_C final : public UPrimaryDataAsset
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0030(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTexture*                               SignedDistanceField;                               // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Size;                                              // 0x0040(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                position;                                          // 0x0058(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DistanceRange;                                     // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FIntPoint                              TIles;                                             // 0x0078(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void SetData(class UTexture* Texture, const struct FVector& Size_0, const struct FVector& position_0, const struct FIntPoint& TIles_0, double DistanceRange_0);
	void GetExternalReferences(TArray<class UTexture*>* Objects);
	void ExecuteUbergraph_PDA_FluxSignedDistanceField(int32 EntryPoint);
	void CopyPropertiesToObject(class UObject* Destination, bool* Done);
	void ClearExternalReferences();
	void ApplyNiagaraParameters(class UNiagaraComponent* NiagaraSystem);
	void ApplyMaterialParameters(TArray<class UMaterialInstanceDynamic*>& MaterialInstances, const class FString& ID, bool Inverse);

	void GetLayerZLocation(int32 Index_0, double* ZLocation) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("PDA_FluxSignedDistanceField_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PDA_FluxSignedDistanceField_C")
	}
	static class UPDA_FluxSignedDistanceField_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPDA_FluxSignedDistanceField_C>();
	}
};
DUMPER7_ASSERTS_UPDA_FluxSignedDistanceField_C;

}

