#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Physics_AnimLayer_jin_Mobile

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "KawaiiPhysics_structs.hpp"
#include "HTGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Physics_AnimLayer_jin_Mobile.Physics_AnimLayer_jin_Mobile_C
// 0x5D80 (0x6230 - 0x04B0)
class UPhysics_AnimLayer_jin_Mobile_C final : public UHTPlayerPhysicsAnimLayer
{
public:
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x04B0(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x04B8(0x0008)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_10;                    // 0x04C0(0x0850)(ContainsInstancedReference)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0D10(0x0020)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_9;                     // 0x0D30(0x0850)(ContainsInstancedReference)
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_8;                     // 0x1580(0x0850)(ContainsInstancedReference)
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_7;                     // 0x1DD0(0x0850)(ContainsInstancedReference)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x2620(0x0020)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_6;                     // 0x2640(0x0850)(ContainsInstancedReference)
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_5;                     // 0x2E90(0x0850)(ContainsInstancedReference)
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_4;                     // 0x36E0(0x0850)(ContainsInstancedReference)
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_3;                     // 0x3F30(0x0850)(ContainsInstancedReference)
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_2;                     // 0x4780(0x0850)(ContainsInstancedReference)
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_1;                     // 0x4FD0(0x0850)(ContainsInstancedReference)
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics;                       // 0x5820(0x0850)(ContainsInstancedReference)
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x6070(0x0020)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer;                     // 0x6090(0x00C8)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x6158(0x00B8)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x6210(0x0020)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void PhysicsAnimInterface(const struct FPoseLink& InPose, struct FPoseLink* PhysicsAnimInterface_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Physics_AnimLayer_jin_Mobile_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Physics_AnimLayer_jin_Mobile_C")
	}
	static class UPhysics_AnimLayer_jin_Mobile_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPhysics_AnimLayer_jin_Mobile_C>();
	}
};
DUMPER7_ASSERTS_UPhysics_AnimLayer_jin_Mobile_C;

}

