#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PropBox_Base_Once

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_TreasureBox_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass PropBox_Base_Once.PropBox_Base_Once_C
// 0x0020 (0x0EC0 - 0x0EA0)
class APropBox_Base_Once_C : public ABP_TreasureBox_Base_C
{
public:
	uint8                                         Pad_E91[0x7];                                      // 0x0E91(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame_PropBox_Base_Once_C;                // 0x0E98(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      NS_Player_Sagiri_029;                              // 0x0EA0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_SMC_PlaneOutline_C*                 BP_SMC_PlaneOutline;                               // 0x0EA8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh1;                                       // 0x0EB0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_PropBox_Base_Once(int32 EntryPoint);
	void BP_OnOpen();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("PropBox_Base_Once_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PropBox_Base_Once_C")
	}
	static class APropBox_Base_Once_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APropBox_Base_Once_C>();
	}
};
DUMPER7_ASSERTS_APropBox_Base_Once_C;

}

