#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SelfieAnimLayerBase_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HTGame_structs.hpp"
#include "HTGame_classes.hpp"
#include "SelfieAnimLayerBase_BP_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass SelfieAnimLayerBase_BP.SelfieAnimLayerBase_BP_C
// 0x0670 (0x0B00 - 0x0490)
class USelfieAnimLayerBase_BP_C : public UHTSelfieAnimLayerBase
{
public:
	struct SelfieAnimLayerBase_BP::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;       // 0x0490(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49C[0x4];                                      // 0x049C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x04A0(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x04A8(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root_2;                              // 0x04B0(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_1;                   // 0x04D0(0x00B8)()
	struct FHTAnimNode_PlayMorphAnim              HTAnimGraphNode_PlayMorphAnim;                     // 0x0588(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x05B8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x0600(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0648(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x0690(0x0050)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x06E0(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x0700(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1;                    // 0x07C8(0x0080)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x0848(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x0868(0x00B8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x0920(0x0080)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace;            // 0x09A0(0x0118)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x0AB8(0x0028)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0AE0(0x0020)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void SelfieAimOffset(const struct FPoseLink& InPose_0, struct FPoseLink* SelfieAimOffset_0);
	void SelfieMove(const struct FPoseLink& InPose, struct FPoseLink* SelfieMove_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("SelfieAnimLayerBase_BP_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SelfieAnimLayerBase_BP_C")
	}
	static class USelfieAnimLayerBase_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USelfieAnimLayerBase_BP_C>();
	}
};
DUMPER7_ASSERTS_USelfieAnimLayerBase_BP_C;

}

