#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_SinPoint_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HTGame_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_SinPoint_BP.UI_SinPoint_BP_C
// 0x0098 (0x1060 - 0x0FC8)
class UUI_SinPoint_BP_C final : public UHTUI_SinPoint
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0FC8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_zuiezhi_guaiwu;                              // 0x0FD0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_star04;                                      // 0x0FD8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_star03;                                      // 0x0FE0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_star02;                                      // 0x0FE8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_star01;                                      // 0x0FF0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHTRichTextBlock*                       HTRichTextBlock_113;                               // 0x0FF8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNiagaraSystemWidget*                   Fx_star04;                                         // 0x1000(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNiagaraSystemWidget*                   Fx_star03;                                         // 0x1008(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNiagaraSystemWidget*                   Fx_star02;                                         // 0x1010(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNiagaraSystemWidget*                   Fx_star01;                                         // 0x1018(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Star01Anim;                                        // 0x1020(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Star02Anim;                                        // 0x1028(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Star03Anim;                                        // 0x1030(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Star01HideAnim;                                    // 0x1038(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Star02HideAnim;                                    // 0x1040(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Star03HideAnim;                                    // 0x1048(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Star04HideAnim;                                    // 0x1050(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Ban00Anim;                                         // 0x1058(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UI_SinPoint_BP(int32 EntryPoint);
	ESlateVisibility Get_CanvasPanel_0_Visibility();
	void GetStarChangeWidgetAnim(bool IsAdd, int32 StarIndex, class UWidgetAnimation** OutAnim);
	void Particle_01();
	void Particle_02();
	void Particle_03();
	void Particle_04();
	void PlayLevelChangedAnim(bool bIsUp, int32 StarIndex);
	void SequenceEvent();
	void SequenceEvent_0();
	void SequenceEvent_1();
	void SequenceEvent_2();
	void SequenceEvent_3();
	void SequenceEvent_4();
	void SequenceEvent_5();
	void SequenceEvent_6();
	void SequenceEvent__ENTRYPOINTUI_SinPoint_BP();
	void SequenceEvent__ENTRYPOINTUI_SinPoint_BP_0();
	void SequenceEvent__ENTRYPOINTUI_SinPoint_BP_1();
	void SequenceEvent__ENTRYPOINTUI_SinPoint_BP_10();
	void SequenceEvent__ENTRYPOINTUI_SinPoint_BP_2();
	void SequenceEvent__ENTRYPOINTUI_SinPoint_BP_3();
	void SequenceEvent__ENTRYPOINTUI_SinPoint_BP_4();
	void SequenceEvent__ENTRYPOINTUI_SinPoint_BP_5();
	void SequenceEvent__ENTRYPOINTUI_SinPoint_BP_6();
	void SequenceEvent__ENTRYPOINTUI_SinPoint_BP_7();
	void SequenceEvent__ENTRYPOINTUI_SinPoint_BP_8();
	void SequenceEvent__ENTRYPOINTUI_SinPoint_BP_9();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("UI_SinPoint_BP_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UI_SinPoint_BP_C")
	}
	static class UUI_SinPoint_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_SinPoint_BP_C>();
	}
};
DUMPER7_ASSERTS_UUI_SinPoint_BP_C;

}

