#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Weapon_Player_Lacrimosa

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_WeaponBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Weapon_Player_Lacrimosa.Weapon_Player_Lacrimosa_C
// 0x0040 (0x07B8 - 0x0778)
class AWeapon_Player_Lacrimosa_C final : public ABP_WeaponBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Weapon_Player_Lacrimosa_C;          // 0x0778(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHTSkeletalMeshComponentBudgeted*       HTSkeletalMeshComponentBudgeted2;                  // 0x0780(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHTSkeletalMeshComponentBudgeted*       HTSkeletalMeshComponentBudgeted1;                  // 0x0788(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Niagara1;                                          // 0x0790(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Niagara;                                           // 0x0798(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHTSkeletalMeshComponentBudgeted*       HTSkeletalMeshComponentBudgeted;                   // 0x07A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh1;                                       // 0x07A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x07B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void K2_SetWeaponMeshVisible(bool bVisible);
	void ExecuteUbergraph_Weapon_Player_Lacrimosa(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Weapon_Player_Lacrimosa_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Weapon_Player_Lacrimosa_C")
	}
	static class AWeapon_Player_Lacrimosa_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AWeapon_Player_Lacrimosa_C>();
	}
};
DUMPER7_ASSERTS_AWeapon_Player_Lacrimosa_C;

}

