#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Weapon_Player_Jin_001

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_WeaponBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Weapon_Player_Jin_001.Weapon_Player_Jin_001_C
// 0x00C8 (0x0840 - 0x0778)
class AWeapon_Player_Jin_001_C final : public ABP_WeaponBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Weapon_Player_Jin_001_C;            // 0x0778(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHTNiagaraComponent*                    ns_body;                                           // 0x0780(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHTNiagaraComponent*                    HTNiagara2;                                        // 0x0788(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHTNiagaraComponent*                    mian3;                                             // 0x0790(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHTNiagaraComponent*                    mian4;                                             // 0x0798(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHTNiagaraComponent*                    mian6;                                             // 0x07A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHTNiagaraComponent*                    mian7;                                             // 0x07A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHTNiagaraComponent*                    mian5;                                             // 0x07B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHTNiagaraComponent*                    ns_quan;                                           // 0x07B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHTNiagaraComponent*                    mian1;                                             // 0x07C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHTNiagaraComponent*                    mian2;                                             // 0x07C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHTSkeletalMeshComponentBudgeted*       HTSkeletalMeshComponentBudgeted1;                  // 0x07D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHTSkeletalMeshComponentBudgeted*       HTSkeletalMeshComponentBudgeted;                   // 0x07D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FString                                 PausedScetionName;                                 // 0x07E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	TArray<class FString>                         UltraSectionArray;                                 // 0x07F0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          IsUltraGamePause;                                  // 0x0800(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_801[0x7];                                      // 0x0801(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 BlendInMontageName;                                // 0x0808(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 MontageStartName;                                  // 0x0818(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	TArray<class FString>                         HideWeaponSection;                                 // 0x0828(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          HaveFork;                                          // 0x0838(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsFashionWeapon;                                   // 0x0839(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Weapon_Player_Jin_001(int32 EntryPoint);
	void InitForkNiagara(bool Visibility);
	void K2_OnPlayerBuildCharacterMeshFinish();
	void K2_SetWeaponMeshVisible(bool bVisible);
	void MontageBlendout(class UAnimMontage* Montage, bool bInterrupted);
	void MontageStart(class UAnimMontage* Montage);
	void OnAnimInitialized();
	void OnGameplayEffectAdd_473352F44CFFFBDB255A7B9662B6596E(const class UGameplayEffect* ActiveGameplayEffect, const class UAbilitySystemComponent* ASC);
	void OnGameplayEffectRemove_473352F44CFFFBDB255A7B9662B6596E(const class UGameplayEffect* ActiveGameplayEffect, const class UAbilitySystemComponent* ASC);
	void ReceiveBeginPlay();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void TriggerUltraSkillPauseTime(bool IsPause);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Weapon_Player_Jin_001_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Weapon_Player_Jin_001_C")
	}
	static class AWeapon_Player_Jin_001_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AWeapon_Player_Jin_001_C>();
	}
};
DUMPER7_ASSERTS_AWeapon_Player_Jin_001_C;

}

