#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: A2_Flower_Guide

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HTGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass A2_Flower_Guide.A2_Flower_Guide_C
// 0x0068 (0x0BE8 - 0x0B80)
class AA2_Flower_Guide_C final : public AHTVisualActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B80(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      NS_Flower_002;                                     // 0x0B88(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_common_icon_search;                             // 0x0B90(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_guanmu40_ZYF;                                   // 0x0B98(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_guanmu40_ZYF;                                   // 0x0BA0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHTDialogueComponent*                   HTDialogue;                                        // 0x0BA8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       Sphere;                                            // 0x0BB0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          Fir;                                               // 0x0BB8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Sec;                                               // 0x0BB9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Third;                                             // 0x0BBA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Can_Interact;                                      // 0x0BBB(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BBC[0x4];                                      // 0x0BBC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Return_Value_Location_Z;                           // 0x0BC0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AA2_LightFlower_L110035_p3_C*>   LightFlower;                                       // 0x0BC8(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	TArray<class FText>                           In_Msgs;                                           // 0x0BD8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void BndEvt__Dialogue_Flower_q310001_HTDialogue_K2Node_ComponentBoundEvent_0_OnDialogueEventDelegate__DelegateSignature(class FName InParticipant, class FName InEventName);
	void BndEvt__Interact_Flower_HTDialogue_K2Node_ComponentBoundEvent_3_OnDialogueBeginEndDelegate__DelegateSignature(class AHTPlayerCharacter* InPlayer);
	void BPGetInteractEntries(class AHTPlayerController* ByPC, TArray<struct FInteractEntry>* OutInteractEntries);
	void BPInteractFinished(class AHTPlayerController* ByPC, int32 InteractIndex);
	void BPOnMainRoleLoadFinished(class AHTPlayerState* PlayerState);
	void ExecuteUbergraph_A2_Flower_Guide(int32 EntryPoint);
	void open_icon();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("A2_Flower_Guide_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"A2_Flower_Guide_C")
	}
	static class AA2_Flower_Guide_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AA2_Flower_Guide_C>();
	}
};
DUMPER7_ASSERTS_AA2_Flower_Guide_C;

}

