#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_mon_021_Shake

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_mon_021_Shake.ABP_mon_021_Shake_C
// 0x0980 (0x0D70 - 0x03F0)
class UABP_mon_021_Shake_C final : public UAnimInstance
{
public:
	uint8                                         Pad_3E8[0x8];                                      // 0x03E8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x03F8(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0400(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x0408(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x0428(0x00B8)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x04E0(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0500(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_6;                        // 0x0520(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_5;                        // 0x0648(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_4;                        // 0x0770(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_3;                        // 0x0898(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_2;                        // 0x09C0(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x0AE8(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x0C10(0x0128)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0D38(0x0020)()
	double                                        BlendAlpha;                                        // 0x0D58(0x0008)(BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        PushScale;                                         // 0x0D60(0x0008)(BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ShakeBoneLayer(const struct FPoseLink& InPose, double PushScale_0, double BlendAlpha_0, struct FPoseLink* ShakeBoneLayer_0);
	void ExecuteUbergraph_ABP_mon_021_Shake(int32 EntryPoint);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_mon_021_Shake_AnimGraphNode_ModifyBone_F8551387486495A69E06B29B9BFF6188();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_mon_021_Shake_AnimGraphNode_ModifyBone_F57563CE4D4D41DFA937D0BD35BA73E7();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_mon_021_Shake_AnimGraphNode_ModifyBone_D7BECF1E4F4ED6C9B6CA888DF702CB25();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_mon_021_Shake_AnimGraphNode_ModifyBone_CA4A0DE942DFD1312E7023A4BE2FFA42();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_mon_021_Shake_AnimGraphNode_ModifyBone_C360BD104A4999F66D7AD191EC08EE73();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_mon_021_Shake_AnimGraphNode_ModifyBone_8EBEB5E847FBF0E12F1236BF125C9511();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_mon_021_Shake_AnimGraphNode_ModifyBone_5F2F73764B994DB8ADAA278C73436141();
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ABP_mon_021_Shake_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ABP_mon_021_Shake_C")
	}
	static class UABP_mon_021_Shake_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_mon_021_Shake_C>();
	}
};
DUMPER7_ASSERTS_UABP_mon_021_Shake_C;

}

