#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_boss_07_Shake

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_boss_07_Shake.ABP_boss_07_Shake_C
// 0x0CF0 (0x10E0 - 0x03F0)
class UABP_boss_07_Shake_C final : public UAnimInstance
{
public:
	uint8                                         Pad_3E8[0x8];                                      // 0x03E8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x03F8(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0400(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x0408(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x0428(0x00B8)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x04E0(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0500(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_9;                        // 0x0520(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_8;                        // 0x0648(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_7;                        // 0x0770(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_6;                        // 0x0898(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_5;                        // 0x09C0(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_4;                        // 0x0AE8(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_3;                        // 0x0C10(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_2;                        // 0x0D38(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x0E60(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x0F88(0x0128)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x10B0(0x0020)()
	double                                        BlendAlpha;                                        // 0x10D0(0x0008)(BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        PushScale;                                         // 0x10D8(0x0008)(BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_boss_07_Shake_AnimGraphNode_ModifyBone_4293BBC94DA3A283D11B8C84CC0F5517();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_boss_07_Shake_AnimGraphNode_ModifyBone_51A362454BE3762B0DD93492F44D6A4F();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_boss_07_Shake_AnimGraphNode_ModifyBone_6D1AB8CB4E5179B25E0D75BF0983FEC0();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_boss_07_Shake_AnimGraphNode_ModifyBone_88FF938140A51F90C6A17391162F92D1();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_boss_07_Shake_AnimGraphNode_ModifyBone_9F7D575240B2FC63998BD89F42FF2486();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_boss_07_Shake_AnimGraphNode_ModifyBone_BB8593964B40BBD9F0BF4BAE58F9C802();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_boss_07_Shake_AnimGraphNode_ModifyBone_C95B36854BCAFC1FCB2F12BBFCD40A9A();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_boss_07_Shake_AnimGraphNode_ModifyBone_D20E7872470CB3C99907EB89AB7E106B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_boss_07_Shake_AnimGraphNode_ModifyBone_D8EAEF374BD43C2B35490197532DE4CC();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_boss_07_Shake_AnimGraphNode_ModifyBone_E5D0361740D9DC87E632BDA02533E14C();
	void ExecuteUbergraph_ABP_boss_07_Shake(int32 EntryPoint);
	void ShakeBoneLayer(const struct FPoseLink& InPose, double PushScale_0, double BlendAlpha_0, struct FPoseLink* ShakeBoneLayer_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ABP_boss_07_Shake_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ABP_boss_07_Shake_C")
	}
	static class UABP_boss_07_Shake_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_boss_07_Shake_C>();
	}
};
DUMPER7_ASSERTS_UABP_boss_07_Shake_C;

}

