#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_TrafficMonsterTemplate

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HTGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_TrafficMonsterTemplate.ABP_TrafficMonsterTemplate_C
// 0x0220 (0x0650 - 0x0430)
class UABP_TrafficMonsterTemplate_C : public UHTMassTrafficMonsterAnimInstance
{
public:
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0430(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0438(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0440(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x0460(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x0488(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x04B0(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x04F8(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0518(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x0560(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x0580(0x00C8)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ABP_TrafficMonsterTemplate_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ABP_TrafficMonsterTemplate_C")
	}
	static class UABP_TrafficMonsterTemplate_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_TrafficMonsterTemplate_C>();
	}
};
DUMPER7_ASSERTS_UABP_TrafficMonsterTemplate_C;

}

