#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_MassCrowdAnimSharingAdditiveInstance

#include "Basic.hpp"

#include "AnimationSharing_classes.hpp"
#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_MassCrowdAnimSharingAdditiveInstance.ABP_MassCrowdAnimSharingAdditiveInstance_C
// 0x02A0 (0x06A0 - 0x0400)
class UABP_MassCrowdAnimSharingAdditiveInstance_C final : public UAnimSharingAdditiveInstance
{
public:
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0400(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0408(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0410(0x0020)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh;                    // 0x0430(0x0158)(ContainsInstancedReference)
	struct FAnimNode_ApplyMeshSpaceAdditive       AnimGraphNode_ApplyMeshSpaceAdditive;              // 0x0588(0x00D0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0658(0x0048)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ABP_MassCrowdAnimSharingAdditiveInstance_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ABP_MassCrowdAnimSharingAdditiveInstance_C")
	}
	static class UABP_MassCrowdAnimSharingAdditiveInstance_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_MassCrowdAnimSharingAdditiveInstance_C>();
	}
};
DUMPER7_ASSERTS_UABP_MassCrowdAnimSharingAdditiveInstance_C;

}

