#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: boss_01_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HTGame_structs.hpp"
#include "BossCharacterBase_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "MovieScene_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass boss_01_BP.boss_01_BP_C
// 0x01C0 (0x2BF0 - 0x2A30)
class Aboss_01_BP_C final : public ABossCharacterBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_boss_01_BP_C;                       // 0x2A28(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          Skill10Box;                                        // 0x2A30(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHTNiagaraComponent*                    HTNiagara;                                         // 0x2A38(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCapsuleComponent*                      Capsule;                                           // 0x2A40(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Skill09Box;                                        // 0x2A48(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         ____1_ChangeColorLerp_D647D2974C712DC83DD78D915B664CD9; // 0x2A50(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            ____1__Direction_D647D2974C712DC83DD78D915B664CD9; // 0x2A54(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A55[0x3];                                     // 0x2A55(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     时间轴_1;                                       // 0x2A58(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         ____0_Sharp_D42D977247B643D938164FAF67DBFE72;      // 0x2A60(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ____0_WaveMul_D42D977247B643D938164FAF67DBFE72;    // 0x2A64(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ____0_Speed_D42D977247B643D938164FAF67DBFE72;      // 0x2A68(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            ____0__Direction_D42D977247B643D938164FAF67DBFE72; // 0x2A6C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A6D[0x3];                                     // 0x2A6D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     时间轴_0;                                       // 0x2A70(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         ____WaveMul_31E99F544AC1B47672855FA60904181A;      // 0x2A78(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ____Speed_31E99F544AC1B47672855FA60904181A;        // 0x2A7C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            _____Direction_31E99F544AC1B47672855FA60904181A;   // 0x2A80(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A81[0x7];                                     // 0x2A81(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     时间轴; // 0x2A88(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             BossMoveLocation;                                  // 0x2A90(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              SLY_DissolveColor;                                 // 0x2AF0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class ALevelSequenceActor*                    SaveDissColorSequence;                             // 0x2B00(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B08[0x8];                                     // 0x2B08(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHTSequencePlaybackSettings            In_Gameplay_Settings;                              // 0x2B10(0x00B0)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FMovieSceneSequencePlaybackSettings    Settings;                                          // 0x2BC0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	void BP_AnimShowHuakuang();
	void BP_OnArmorBroken();
	void BPOnAIActivated();
	void BPOnAICharacterDead();
	void BPOnBronAnim();
	void ChangeStageFromSkillBP();
	void Completed_1DE133124116D2D973C2C5B29320A5C2(class ALevelSequenceActor* LevelSequenceActor, class ULevelSequencePlayer* LevelSequencePlayer);
	void DeadSkillRotation();
	void DissolveColor();
	void ExecuteUbergraph_boss_01_BP(int32 EntryPoint);
	void MoveBossToLocation();
	void ReceiveBeginPlay();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void RecoverColor();
	void Skl1BeginChange();
	void Skl9BeginChange();
	void 时间轴_0__FinishedFunc();
	void 时间轴_0__UpdateFunc();
	void 时间轴_1__FinishedFunc();
	void 时间轴_1__OFF_Light__EventFunc();
	void 时间轴_1__UpdateFunc();
	void 时间轴__FinishedFunc();
	void 时间轴__UpdateFunc();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("boss_01_BP_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"boss_01_BP_C")
	}
	static class Aboss_01_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<Aboss_01_BP_C>();
	}
};
DUMPER7_ASSERTS_Aboss_01_BP_C;

}

