#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Boss_07_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BossCharacterBase_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Boss_07_BP.Boss_07_BP_C
// 0x0120 (0x2B50 - 0x2A30)
class ABoss_07_BP_C : public ABossCharacterBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Boss_07_BP_C;                       // 0x2A28(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USphereComponent*                       SphereSteal;                                       // 0x2A30(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCapsuleComponent*                      HeadCollision;                                     // 0x2A38(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCapsuleComponent*                      act10;                                             // 0x2A40(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       Sphere;                                            // 0x2A48(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box3;                                              // 0x2A50(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box2;                                              // 0x2A58(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box1;                                              // 0x2A60(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box;                                               // 0x2A68(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCapsuleComponent*                      Capsule3;                                          // 0x2A70(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCapsuleComponent*                      Capsule2;                                          // 0x2A78(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCapsuleComponent*                      Capsule1;                                          // 0x2A80(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCapsuleComponent*                      Capsule;                                           // 0x2A88(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         _________0_52402B0F43BB9165AC35DE883BAB2A38;       // 0x2A90(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            _____Direction_52402B0F43BB9165AC35DE883BAB2A38;   // 0x2A94(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A95[0x3];                                     // 0x2A95(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     时间轴; // 0x2A98(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         BrokenCount;                                       // 0x2AA0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2AA4[0x4];                                     // 0x2AA4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ATargetPoint*>                   Boss07BulletTarget;                                // 0x2AA8(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	TArray<struct FVector>                        DanmakuLocation;                                   // 0x2AB8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class Aboss_07_bullet_StageDanmaku_BP_C*> ProjectileActors;                               // 0x2AC8(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	TArray<int32>                                 ProjectileActorIndex;                              // 0x2AD8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayAbilitySpecHandle             Trigger_Ability_Handle;                            // 0x2AE8(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2AEC[0x4];                                     // 0x2AEC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              DanmakuTrigger;                                    // 0x2AF0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class ALevelSequenceActor*                    StageChangeSequence;                               // 0x2B00(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          NeedSequence;                                      // 0x2B08(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B09[0x3];                                     // 0x2B09(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   In_Sequence_ID;                                    // 0x2B0C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B14[0x4];                                     // 0x2B14(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UClass*>                         WeakProjectile;                                    // 0x2B18(0x0010)(Edit, BlueprintVisible)
	TArray<class ABP_Boss07WeakProjectileDamage_C*> WeakProjectileShoot;                             // 0x2B28(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	class AHTPlayerCharacter*                     WeakProjectileOwner;                               // 0x2B38(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ABP_Boss07WeakProjectileDamage_C*       NewVar;                                            // 0x2B40(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          WeakProjectileCD;                                  // 0x2B48(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsArmor;                                           // 0x2B49(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BeginDanmaku();
	void BP_EndArmorBroken();
	void BP_OnArmorBroken();
	void BPOnCharacterDead();
	void ExecuteUbergraph_Boss_07_BP(int32 EntryPoint);
	void OnBeginBattle();
	void OnDamaged(float DamageAmount, const struct FHitResult& HitInfo, const struct FGameplayTagContainer& DamageTags, const class UHTGamePlayEffect* DamageGameplayEffect, class AHTAbilityCharacter* InstigatorCharacter, class AActor* DamageCauser);
	void ProjectileDelayHanate();
	void ReceiveBeginPlay();
	void TriggerProjectileSort();
	void 时间轴__FinishedFunc();
	void 时间轴__UpdateFunc();
	void 自定义事件(const class UGameplayAbility* PlayAbility);
	void 自定义事件_0(const class UGameplayAbility* PlayAbility);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Boss_07_BP_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Boss_07_BP_C")
	}
	static class ABoss_07_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABoss_07_BP_C>();
	}
};
DUMPER7_ASSERTS_ABoss_07_BP_C;

}

