#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: boss_18_BP_chase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HTGame_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "MonsterCharacterBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass boss_18_BP_chase.boss_18_BP_chase_C
// 0x00A0 (0x2AD0 - 0x2A30)
class Aboss_18_BP_chase_C final : public AMonsterCharacterBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_boss_18_BP_chase_C;                 // 0x2A28(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          Box;                                               // 0x2A30(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Stage2;                                            // 0x2A38(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHTAICharacter*                         Summon;                                            // 0x2A50(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(class Aboss_18_BP_chase_C* NewParam)> End_chase;                   // 0x2A58(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FBossMusicData                         In_Music_Data;                                     // 0x2A68(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FBossMusicData                         End_Music_Data;                                    // 0x2A98(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UNiagaraComponent*                      Body_windFX;                                       // 0x2AC8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void ADD_Speed();
	void BPOnAICharacterDead();
	void BPSetCurrentAggroTarget();
	void Create_Longjuan();
	void Create_Longjuan_1();
	void End_boss18();
	void ExecuteUbergraph_boss_18_BP_chase(int32 EntryPoint);
	void Minus_Speed();
	void OnBeginBattle();
	void OnBlendOut_3F4CA3DE41ADFEBED9DDCE979ACE1DD9(class FName NotifyName);
	void OnCompleted_3F4CA3DE41ADFEBED9DDCE979ACE1DD9(class FName NotifyName);
	void OnInterrupted_3F4CA3DE41ADFEBED9DDCE979ACE1DD9(class FName NotifyName);
	void OnNotifyBegin_3F4CA3DE41ADFEBED9DDCE979ACE1DD9(class FName NotifyName);
	void OnNotifyEnd_3F4CA3DE41ADFEBED9DDCE979ACE1DD9(class FName NotifyName);
	void ReceiveBeginPlay();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void Start_skill1_1();
	void Start_skill1_2();
	void Start_skill1_3();
	void Start_skill2();
	void Start_skill3();
	bool TurnInBattleConsiderAbility();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("boss_18_BP_chase_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"boss_18_BP_chase_C")
	}
	static class Aboss_18_BP_chase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<Aboss_18_BP_chase_C>();
	}
};
DUMPER7_ASSERTS_Aboss_18_BP_chase_C;

}

