#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: boss18_bullet_chase_longjuan

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_ProjectileBase_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass boss18_bullet_chase_longjuan.boss18_bullet_chase_longjuan_C
// 0x0030 (0x07C0 - 0x0790)
class Aboss18_bullet_chase_longjuan_C final : public ABP_ProjectileBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0790(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          BoxTriggerLinkTime;                                // 0x0798(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHTNiagaraComponent*                    HTNiagara;                                         // 0x07A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHTAkComponent*                         HTAk;                                              // 0x07A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class Aboss_18_BP_chase_C*                    Boss_chase;                                        // 0x07B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__boss18_bullet_chase_longjuan_BoxComponent_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void ExecuteUbergraph_boss18_bullet_chase_longjuan(int32 EntryPoint);
	void ReceiveBeginPlay();

	struct FGameplayTag GetBatProjectileDirectionTag() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("boss18_bullet_chase_longjuan_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"boss18_bullet_chase_longjuan_C")
	}
	static class Aboss18_bullet_chase_longjuan_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<Aboss18_bullet_chase_longjuan_C>();
	}
};
DUMPER7_ASSERTS_Aboss18_bullet_chase_longjuan_C;

}

