#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AnomalyDoorSeqManager_KillMonster

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HTGame_structs.hpp"
#include "HTGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AnomalyDoorSeqManager_KillMonster.BP_AnomalyDoorSeqManager_KillMonster_C
// 0x01A0 (0x0D20 - 0x0B80)
class ABP_AnomalyDoorSeqManager_KillMonster_C final : public AHTVisualActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B80(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBillboardComponent*                    Billboard;                                         // 0x0B88(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          MonBox;                                            // 0x0B90(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         FX_Alpha_8E9F49C2416DED0D1DBC44889C11945A;         // 0x0B98(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FX_NewTrack_1_8E9F49C2416DED0D1DBC44889C11945A;    // 0x0B9C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            FX__Direction_8E9F49C2416DED0D1DBC44889C11945A;    // 0x0BA0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BA1[0x7];                                      // 0x0BA1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Fx;                                                // 0x0BA8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UObject>                 SeqToPlay_Last;                                    // 0x0BB0(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class UObject>                 SeqToPlay_First;                                   // 0x0BD8(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	float                                         PlayRate;                                          // 0x0C00(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   StateYahahaID;                                     // 0x0C04(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          isFinished_;                                       // 0x0C0C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          MonSpawned_;                                       // 0x0C0D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C0E[0x2];                                      // 0x0C0E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SeqDelay;                                          // 0x0C10(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C14[0x4];                                      // 0x0C14(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class AHTAISpawnManager>       AISpawner;                                         // 0x0C18(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TArray<class UDataLayerAsset*>                ToLoadLocolDT;                                     // 0x0C40(0x0010)(Edit, BlueprintVisible)
	TArray<class UDataLayerAsset*>                ToUnloadLocalDT;                                   // 0x0C50(0x0010)(Edit, BlueprintVisible)
	TArray<class AActor*>                         DropProps;                                         // 0x0C60(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	float                                         MonsterDelay;                                      // 0x0C70(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C74[0x4];                                      // 0x0C74(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           RandomDropHandle;                                  // 0x0C78(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DropsCore;                                         // 0x0C80(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	bool                                          bHaveTalk_;                                        // 0x0C88(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C89[0x3];                                      // 0x0C89(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   LoadYahahaID;                                      // 0x0C8C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   UnloadYahahaID;                                    // 0x0C94(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9C[0x4];                                      // 0x0C9C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Vision_ID;                                         // 0x0CA0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class ABP_Portal_C*                           BPPortal;                                          // 0x0CB0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	TArray<TSoftObjectPtr<class AActor>>          ActorHide;                                         // 0x0CB8(0x0010)(Edit, BlueprintVisible)
	TSoftObjectPtr<class ULevelSequence>          SeqRoom3Start;                                     // 0x0CC8(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	bool                                          IsOpenedArea_;                                     // 0x0CF0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CF1[0x7];                                      // 0x0CF1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           TimeHandle;                                        // 0x0CF8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AStaticMeshActor*                       RelatedBlock;                                      // 0x0D00(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class UDataLayerAsset*                        LastLayer;                                         // 0x0D08(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UDataLayerAsset*                        DoorLayer;                                         // 0x0D10(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ALevelSequenceActor*                    SeqActor;                                          // 0x0D18(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__BP_AnomalyDoorSeqManager_KillMonster_MonBox_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void BPOnMainRoleLoadFinished(class AHTPlayerState* PlayerState);
	void Cus_BeginRoomAct();
	void Cus_CheckIfDrop();
	void Cus_FirstDrop();
	void Cus_RandomDrop();
	void Cus_SpawnMonsters();
	void ExecuteUbergraph_BP_AnomalyDoorSeqManager_KillMonster(int32 EntryPoint);
	void FX__FinishedFunc();
	void FX__UpdateFunc();
	void HideMesh(class AHTPortaltActor* Portal);
	void On60S();
	void OnAICharacterSpawnedEvent(class AHTAICharacter* AICharacter);
	void OnAllAIDead_Event(class AHTAISpawnManager* SpawnMgr, class AHTCharacter* OwnerPlayer);
	void OnLoaded_1AA069B747131CB37B9CE6A3095EB38B(class UObject* Loaded);
	void OnLoaded_C2903E5044872B62374C2F9958F4F0B9(class UObject* Loaded);
	void OnLoaded_FA58FACA4C21D1ED676E6389B45638F4(class UObject* Loaded);
	void OnLoaded_FC992E5549DCE8AE525A1EBED760B710(class UObject* Loaded);
	void OnLoaded_FE31BE524BA56B3B38E130A078CA42CC(class UObject* Loaded);
	void RemoveTimer();
	void SetDisableBlock();
	void SetEnableBlock();
	void SetPlayToBegin();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_AnomalyDoorSeqManager_KillMonster_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_AnomalyDoorSeqManager_KillMonster_C")
	}
	static class ABP_AnomalyDoorSeqManager_KillMonster_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_AnomalyDoorSeqManager_KillMonster_C>();
	}
};
DUMPER7_ASSERTS_ABP_AnomalyDoorSeqManager_KillMonster_C;

}

