#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Boss019_CarHandling

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HTGame_structs.hpp"
#include "HTGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Boss019_CarHandling.BP_Boss019_CarHandling_C
// 0x0060 (0x0338 - 0x02D8)
class ABP_Boss019_CarHandling_C final : public AHTTriggerBox
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBillboardComponent*                    Billboard;                                         // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         TopSpeedInKmH;                                     // 0x02E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   YahahaId_Chase01Load;                              // 0x02EC(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F4[0x4];                                      // 0x02F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        LimitSpeedInKmH;                                   // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Boss019_CarStartRace_C*             RelatedStartRace;                                  // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class ABP_Boss019_PreUnloadManager_C> RelatedPreUnloadManager;                    // 0x0308(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	bool                                          IsMusicPlaying;                                    // 0x0330(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Cus_CarSpeedLimit(class UHTVehicleMovementComponent* VehicleComp);
	void Cus_ResetHandling();
	void ExecuteUbergraph_BP_Boss019_CarHandling(int32 EntryPoint);
	void OnLoaded_759264CE48441D5E9CCF88B4F2AADBEC(class UObject* Loaded);
	void ReceiveActorBeginOverlap(class AActor* OtherActor);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Boss019_CarHandling_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Boss019_CarHandling_C")
	}
	static class ABP_Boss019_CarHandling_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Boss019_CarHandling_C>();
	}
};
DUMPER7_ASSERTS_ABP_Boss019_CarHandling_C;

}

