#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Coupon_006

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HTGame_structs.hpp"
#include "HTGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Coupon_006.BP_Coupon_006_C
// 0x0030 (0x0BC0 - 0x0B90)
class ABP_Coupon_006_C final : public AHTYahahaActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B90(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USphereComponent*                       Sphere;                                            // 0x0B98(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_SMC_PlaneOutline_C*                 BP_SMC_PlaneOutline;                               // 0x0BA0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_SpecialHaiBao_01;                               // 0x0BA8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FInteractEntry>                 Out_Interact_Entries;                              // 0x0BB0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)

public:
	void BPGetInteractEntries(class AHTPlayerController* ByPC, TArray<struct FInteractEntry>* OutInteractEntries);
	void BPInteractFinished(class AHTPlayerController* ByPC, int32 InteractIndex);
	void BPOnMainRoleLoadFinished(class AHTPlayerState* PlayerState);
	void ExecuteUbergraph_BP_Coupon_006(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Coupon_006_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Coupon_006_C")
	}
	static class ABP_Coupon_006_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Coupon_006_C>();
	}
};
DUMPER7_ASSERTS_ABP_Coupon_006_C;

}

