#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CabinetKey_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HTGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_CabinetKey_Base.BP_CabinetKey_Base_C
// 0x0038 (0x0BC0 - 0x0B88)
class ABP_CabinetKey_Base_C : public AHTRandomKeyActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B88(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USphereComponent*                       Sphere;                                            // 0x0B90(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_SMC_PlaneOutline_C*                 BP_SMC_PlaneOutline;                               // 0x0B98(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Props_CabinetKey;                               // 0x0BA0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         KeyTL______1_AB0AC03A49C2A72BF57BC58FFC60F70F;     // 0x0BA8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         KeyTL______0_AB0AC03A49C2A72BF57BC58FFC60F70F;     // 0x0BAC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            KeyTL__Direction_AB0AC03A49C2A72BF57BC58FFC60F70F; // 0x0BB0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BB1[0x7];                                      // 0x0BB1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     KeyTL;                                             // 0x0BB8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void BP_DestroyKey();
	void BPGetInteractEntries(class AHTPlayerController* ByPC, TArray<struct FInteractEntry>* OutInteractEntries);
	void ExecuteUbergraph_BP_CabinetKey_Base(int32 EntryPoint);
	void KeyTL__FinishedFunc();
	void KeyTL__UpdateFunc();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_CabinetKey_Base_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_CabinetKey_Base_C")
	}
	static class ABP_CabinetKey_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_CabinetKey_Base_C>();
	}
};
DUMPER7_ASSERTS_ABP_CabinetKey_Base_C;

}

