#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ConstructionSite_16x16

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HTGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ConstructionSite_16x16.BP_ConstructionSite_16x16_C
// 0x00B0 (0x0C30 - 0x0B80)
class ABP_ConstructionSite_16x16_C : public AHTVisualActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B80(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   FXPoint;                                           // 0x0B88(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          BoxOut;                                            // 0x0B90(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Cube;                                              // 0x0B98(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                    Level_Location;                                    // 0x0BA0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          BoxIn;                                             // 0x0BA8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_NewTrack_0_A6C41EB04661B1D3DC329D994F68E6BE; // 0x0BB0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline__Direction_A6C41EB04661B1D3DC329D994F68E6BE; // 0x0BB4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BB5[0x3];                                      // 0x0BB5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline;                                          // 0x0BB8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          IsLeave;                                           // 0x0BC0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC1[0x7];                                      // 0x0BC1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHTAISpawnManager*                      HTAI_Spawn_Need_Activity;                          // 0x0BC8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	TArray<class AHTAICharacter*>                 AICharacter_NeedActivity;                          // 0x0BD0(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	class ULevelStreamingDynamic*                 Level_Instance;                                    // 0x0BE0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FName                                   Level_Name;                                        // 0x0BE8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UWorld>                  Level;                                             // 0x0BF0(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash)
	class UNiagaraComponent*                      GroundFXInactive;                                  // 0x0C18(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AHTAICharacter*                         AICharacter;                                       // 0x0C20(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          IsActiving;                                        // 0x0C28(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AISpawned(class AHTAICharacter* AICharacter_0);
	void BndEvt__BP_ConstructionSite_Base_Box_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void BndEvt__BP_ConstructionSite_Base_BoxOut_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void BPOnMainRoleLoadFinished(class AHTPlayerState* PlayerState);
	void CustomEvent(class AHTAISpawnManager* SpawnMgr, class AHTCharacter* OwnerPlayer);
	void Endbattle(class Amon_13_1_BP_Child_C* NewParam);
	void ExecuteUbergraph_BP_ConstructionSite_16x16(int32 EntryPoint);
	void IsAIActived(bool* IsActived);
	void OnEmitterSpawned_207BAD604D99291A546B708D60ABDD36(class UNiagaraComponent* SpawnedComp);
	void OnEmitterSpawned_470C7B96454F026625C2D6833F6940CF(class UNiagaraComponent* SpawnedComp);
	void OnEmitterSpawned_F104DE314CBF6635074F03AA4279BD0F(class UNiagaraComponent* SpawnedComp);
	void OnEmitterSpawned_F20CC31947F465D9699400880BF8C44C(class UNiagaraComponent* SpawnedComp);
	void OnFail_36CBC2CC41096CCF185DBAA4F615095A(class AHTAISpawnManager* Spawn);
	void OnFail_66D67BE1427613B300BCF684DEE7638B(class AHTAISpawnManager* Spawn);
	void OnFail_C139C6034C3F75E9DF16A4847171ADC0(class AHTAISpawnManager* Spawn);
	void OnFail_CBC9B9DA4198E86F4A870AA427DE2015(class AHTAISpawnManager* Spawn);
	void OnFail_EB22F99D4F777395419816AC5DB145D5(class AHTAISpawnManager* Spawn);
	void OnLoaded_CCB42EE842569CF10ACEE2ACBA6407B6(class UObject* Loaded);
	void OnMainRoleFinish_36CBC2CC41096CCF185DBAA4F615095A(class AHTAISpawnManager* Spawn);
	void OnMainRoleFinish_C139C6034C3F75E9DF16A4847171ADC0(class AHTAISpawnManager* Spawn);
	void OnSuccess_66D67BE1427613B300BCF684DEE7638B(class AHTAISpawnManager* Spawn);
	void OnSuccess_CBC9B9DA4198E86F4A870AA427DE2015(class AHTAISpawnManager* Spawn);
	void OnSuccess_EB22F99D4F777395419816AC5DB145D5(class AHTAISpawnManager* Spawn);
	void ReceiveBeginPlay();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void Timeline__FinishedFunc();
	void Timeline__UpdateFunc();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_ConstructionSite_16x16_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_ConstructionSite_16x16_C")
	}
	static class ABP_ConstructionSite_16x16_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ConstructionSite_16x16_C>();
	}
};
DUMPER7_ASSERTS_ABP_ConstructionSite_16x16_C;

}

