#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CityEvent_Gardua_VP_001_Arrive

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_CityEvent_Gardua_VP_001_Arrive.BP_CityEvent_Gardua_VP_001_Arrive_C.CheckArriveCondition
// 0x0040 (0x0040 - 0x0000)
struct BP_CityEvent_Gardua_VP_001_Arrive_C_CheckArriveCondition final
{
public:
	class AHTWheeledVehicleDrivable*              InVehicle;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        InDeltaTime;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bSuccess;                                          // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_DoubleToString_ReturnValue;          // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_CityEvent_Gardua_VP_001_Arrive_C_CheckArriveCondition;

// Function BP_CityEvent_Gardua_VP_001_Arrive.BP_CityEvent_Gardua_VP_001_Arrive_C.EnterBoxMain
// 0x0010 (0x0010 - 0x0000)
struct BP_CityEvent_Gardua_VP_001_Arrive_C_EnterBoxMain final
{
public:
	class AActor*                                 BoxMainActor;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_CityEvent_Gardua_VP_001_Arrive_C_EnterBoxMain;

// Function BP_CityEvent_Gardua_VP_001_Arrive.BP_CityEvent_Gardua_VP_001_Arrive_C.ExecuteUbergraph_BP_CityEvent_Gardua_VP_001_Arrive
// 0x0010 (0x0010 - 0x0000)
struct BP_CityEvent_Gardua_VP_001_Arrive_C_ExecuteUbergraph_BP_CityEvent_Gardua_VP_001_Arrive final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_TickArrive_InTickSeconds_ImplicitCast;    // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_CityEvent_Gardua_VP_001_Arrive_C_ExecuteUbergraph_BP_CityEvent_Gardua_VP_001_Arrive;

// Function BP_CityEvent_Gardua_VP_001_Arrive.BP_CityEvent_Gardua_VP_001_Arrive_C.IsArrive
// 0x0010 (0x0010 - 0x0000)
struct BP_CityEvent_Gardua_VP_001_Arrive_C_IsArrive final
{
public:
	class AHTWheeledVehicleDrivable*              VehicleActor;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_CityEvent_Gardua_VP_001_Arrive_C_IsArrive;

// Function BP_CityEvent_Gardua_VP_001_Arrive.BP_CityEvent_Gardua_VP_001_Arrive_C.LeaveBoxMain
// 0x0010 (0x0010 - 0x0000)
struct BP_CityEvent_Gardua_VP_001_Arrive_C_LeaveBoxMain final
{
public:
	class AActor*                                 BoxMainActor;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_CityEvent_Gardua_VP_001_Arrive_C_LeaveBoxMain;

// Function BP_CityEvent_Gardua_VP_001_Arrive.BP_CityEvent_Gardua_VP_001_Arrive_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_CityEvent_Gardua_VP_001_Arrive_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_CityEvent_Gardua_VP_001_Arrive_C_ReceiveTick;

// Function BP_CityEvent_Gardua_VP_001_Arrive.BP_CityEvent_Gardua_VP_001_Arrive_C.TickArrive
// 0x0028 (0x0028 - 0x0000)
struct BP_CityEvent_Gardua_VP_001_Arrive_C_TickArrive final
{
public:
	double                                        InTickSeconds;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        InBoxMainTotalTime;                                // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMMO_Server_ReturnValue;                 // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHTWheeledVehicleDrivable*              K2Node_DynamicCast_AsHTWheeled_Vehicle_Drivable;   // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckArriveCondition_bSuccess;            // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_CityEvent_Gardua_VP_001_Arrive_C_TickArrive;

}

