#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DialogueNPC_Sub_mm_Shop

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "HTGame_structs.hpp"
#include "BP_DialogueNPC_Sub_mm_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_DialogueNPC_Sub_mm_Shop.BP_DialogueNPC_Sub_mm_Shop_C
// 0x0180 (0x3460 - 0x32E0)
class ABP_DialogueNPC_Sub_mm_Shop_C : public ABP_DialogueNPC_Sub_mm_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x32E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHTContextualAnimSceneActorComponent*   HTContextualAnimSceneActor;                        // 0x32E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHTSmartObjectComponent*                HTSmartObject;                                     // 0x32F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPBubbleComponent_C*                   BPBubbleComponent;                                 // 0x32F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCameraComponent*                       Camera;                                            // 0x3300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpringArmComponent*                    SpringArm;                                         // 0x3308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHTShopCameraComponent*                 HTShopCamera;                                      // 0x3310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               begin_rotation;                                    // 0x3318(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class AHTPlayerCharacter*                     The_Player;                                        // 0x3330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          Feedback;                                          // 0x3338(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3339[0x7];                                     // 0x3339(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FNPCMsgID>                      Msg_Arr;                                           // 0x3340(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UDlgDialogue*                           Newdlg;                                            // 0x3350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         In_Sphere_Radius;                                  // 0x3358(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         second_crime;                                      // 0x335C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               npcnewroa;                                         // 0x3360(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class FName                                   In_Transform_ID;                                   // 0x3378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FNPCMsgID>                      Msg_Arr_0;                                         // 0x3380(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UDlgDialogue*                           shop_dlg;                                          // 0x3390(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<struct FNPCMsgID>                      Msg_Arr_1;                                         // 0x3398(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FNPCMsgID>                      Msg_Arr_2;                                         // 0x33A8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FVector                                Location;                                          // 0x33B8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Rotation;                                          // 0x33D0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FVector                                npclocation;                                       // 0x33E8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Player_Location;                                   // 0x3400(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FNPCMsgID>                      Msg_Arr_3;                                         // 0x3418(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FVector                                springarmloc;                                      // 0x3428(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               springarmrot;                                      // 0x3440(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void BP_OnSceneNPCCustomEvent(const float& SenderDistance, const class FString& StringVal);
	void ExecuteUbergraph_BP_DialogueNPC_Sub_mm_Shop(int32 EntryPoint);
	void OnInteractFeedbackEvent(class AHTPlayerCharacter* thePlayer, class AHTVisualActor* theVisualActor, const struct FVector& PlayerLocation);
	void OnPlayerPerceivedEvent(class AHTPlayerController* ByPC);
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void stealpayresult(bool InResult);
	void trans();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_DialogueNPC_Sub_mm_Shop_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_DialogueNPC_Sub_mm_Shop_C")
	}
	static class ABP_DialogueNPC_Sub_mm_Shop_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_DialogueNPC_Sub_mm_Shop_C>();
	}
};
DUMPER7_ASSERTS_ABP_DialogueNPC_Sub_mm_Shop_C;

}

