#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DialogueNPC_Sub_060_World_Handbill_Base

#include "Basic.hpp"

#include "BP_DialogueNPC_Sub_060_World_classes.hpp"
#include "Engine_structs.hpp"
#include "HTGame_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_DialogueNPC_Sub_060_World_Handbill_Base.BP_DialogueNPC_Sub_060_World_Handbill_Base_C
// 0x0060 (0x3350 - 0x32F0)
#pragma pack(push, 0x1)
class alignas(0x10) ABP_DialogueNPC_Sub_060_World_Handbill_Base_C : public ABP_DialogueNPC_Sub_060_World_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_DialogueNPC_Sub_060_World_Handbill_Base_C; // 0x32E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UMergeAutoAttachStaticMeshComp*         MergeAutoAttachStaticMeshComp;                     // 0x32F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UMergeAutoAttachStaticMeshComp*         MergeAutoAttachStaticMeshComp1;                    // 0x32F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPBubbleComponent_C*                   BPBubbleComponent;                                 // 0x3300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box;                                               // 0x3308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FNPCMsgID>                      Msg_Arr_0;                                         // 0x3310(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TSoftObjectPtr<class UAnimMontage>            fachuandan;                                        // 0x3320(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void BndEvt__BP_DialogueNPC_Sub_060_World_Handbill_Base_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void ExecuteUbergraph_BP_DialogueNPC_Sub_060_World_Handbill_Base(int32 EntryPoint);
	void OnBlendOut_022933A94D474FA16CEA2B8CAAF448B8(class FName NotifyName);
	void OnCompleted_022933A94D474FA16CEA2B8CAAF448B8(class FName NotifyName);
	void OnInterrupted_022933A94D474FA16CEA2B8CAAF448B8(class FName NotifyName);
	void OnLoaded_E3387391495883A877E0808507E4CFE6(class UObject* Loaded);
	void OnNotifyBegin_022933A94D474FA16CEA2B8CAAF448B8(class FName NotifyName);
	void OnNotifyEnd_022933A94D474FA16CEA2B8CAAF448B8(class FName NotifyName);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_DialogueNPC_Sub_060_World_Handbill_Base_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_DialogueNPC_Sub_060_World_Handbill_Base_C")
	}
	static class ABP_DialogueNPC_Sub_060_World_Handbill_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_DialogueNPC_Sub_060_World_Handbill_Base_C>();
	}
};
#pragma pack(pop)
DUMPER7_ASSERTS_ABP_DialogueNPC_Sub_060_World_Handbill_Base_C;

}

