#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Elevator_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HTGame_structs.hpp"
#include "HTGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Elevator_Base.BP_Elevator_Base_C
// 0x0208 (0x0E98 - 0x0C90)
class ABP_Elevator_Base_C : public AHTElevator
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0C90(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TSoftObjectPtr<class UAkAudioEvent>           LoopAudioEvent;                                    // 0x0C98(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class UAkAudioEvent>           StopLoopEvent;                                     // 0x0CC0(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FAzimuthIndicatorParam                 Indicator_Param;                                   // 0x0CE8(0x01A8)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         TestString;                                        // 0x0E90(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShowAzimuthIndicator;                              // 0x0E94(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__BP_Elevator_Base_BoxComp_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void BndEvt__BP_Elevator_Base_BoxComp_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void ExecuteUbergraph_BP_Elevator_Base(int32 EntryPoint);
	void OnLoaded_891C019D4F63BF4E0E588CB7E9A6FB0A(class UObject* Loaded);
	void OnLoaded_EE13761A4C66D847B00453A4F0372F58(class UObject* Loaded);
	void ReceiveBeginPlay();
	void StartMoveDelegate_Event(const class AHTLinearMoveActor* Actor, int32 StartIndex, int32 StopIndex);
	void StopMoveDelegate_Event(const class AHTLinearMoveActor* Actor, int32 StopIndex);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Elevator_Base_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Elevator_Base_C")
	}
	static class ABP_Elevator_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Elevator_Base_C>();
	}
};
DUMPER7_ASSERTS_ABP_Elevator_Base_C;

}

