#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FluxJumpFloodComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_FluxJumpFloodComponent.BP_FluxJumpFloodComponent_C
// 0x0050 (0x0110 - 0x00C0)
class UBP_FluxJumpFloodComponent_C final : public UActorComponent
{
public:
	int32                                         Size_X;                                            // 0x00C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Size_Y;                                            // 0x00C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     SourceMaterial;                                    // 0x00C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     IterationMaterial;                                 // 0x00D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     ResultMaterial;                                    // 0x00D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTextureRenderTarget2D*                 Result;                                            // 0x00E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UTextureRenderTarget2D*>         TempTextures;                                      // 0x00E8(0x0010)(Edit, BlueprintVisible)
	class UMaterialInstanceDynamic*               IterationInstance;                                 // 0x00F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               ResultInstance;                                    // 0x0100(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               SourceInstance;                                    // 0x0108(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void Generate(class UTextureRenderTarget2D*& SourceTexture, double Normalization, bool HighPrecission, uint8 Iterations, double Offset);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_FluxJumpFloodComponent_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_FluxJumpFloodComponent_C")
	}
	static class UBP_FluxJumpFloodComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_FluxJumpFloodComponent_C>();
	}
};
DUMPER7_ASSERTS_UBP_FluxJumpFloodComponent_C;

}

