#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_HTFishAnimLayer

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_HTFishAnimLayer.BP_HTFishAnimLayer_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct BP_HTFishAnimLayer_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_BP_HTFishAnimLayer_C_AnimGraph;

// Function BP_HTFishAnimLayer.BP_HTFishAnimLayer_C.FishAimOffsetLayer
// 0x0020 (0x0020 - 0x0000)
struct BP_HTFishAnimLayer_C_FishAimOffsetLayer final
{
public:
	struct FPoseLink                              InPose_0;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              FishAimOffsetLayer_0;                              // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_BP_HTFishAnimLayer_C_FishAimOffsetLayer;

// Function BP_HTFishAnimLayer.BP_HTFishAnimLayer_C.FishBaseLayer
// 0x0020 (0x0020 - 0x0000)
struct BP_HTFishAnimLayer_C_FishBaseLayer final
{
public:
	struct FPoseLink                              InPose;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              FishBaseLayer_0;                                   // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_BP_HTFishAnimLayer_C_FishBaseLayer;

}

