#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Bp_mon_38_Shake

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Bp_mon_38_Shake.Bp_mon_38_Shake_C
// 0x0CF0 (0x10E0 - 0x03F0)
class UBp_mon_38_Shake_C final : public UAnimInstance
{
public:
	uint8                                         Pad_3E8[0x8];                                      // 0x03E8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x03F8(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0400(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x0408(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x0428(0x00B8)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x04E0(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0500(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_9;                        // 0x0520(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_8;                        // 0x0648(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_7;                        // 0x0770(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_6;                        // 0x0898(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_5;                        // 0x09C0(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_4;                        // 0x0AE8(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_3;                        // 0x0C10(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_2;                        // 0x0D38(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x0E60(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x0F88(0x0128)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x10B0(0x0020)()
	double                                        BlendAlpha;                                        // 0x10D0(0x0008)(BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        PushScale;                                         // 0x10D8(0x0008)(BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Bp_mon_38_Shake_AnimGraphNode_ModifyBone_00464FCF41B03663DA14F7A1845F252B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Bp_mon_38_Shake_AnimGraphNode_ModifyBone_15B4E7454C346E7CAF1A2184D631776F();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Bp_mon_38_Shake_AnimGraphNode_ModifyBone_401C6DFC46EB031E70AF288BE7BDB37B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Bp_mon_38_Shake_AnimGraphNode_ModifyBone_43A4625B489CF603DC927D9FE4881A13();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Bp_mon_38_Shake_AnimGraphNode_ModifyBone_4C16B6D34D24E0E06ADCC1933D749513();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Bp_mon_38_Shake_AnimGraphNode_ModifyBone_6E5D5CD5413D5ACCA68575BBEBD09C60();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Bp_mon_38_Shake_AnimGraphNode_ModifyBone_9356F4F64F292B8D81EA35B74AF1944D();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Bp_mon_38_Shake_AnimGraphNode_ModifyBone_B08111614A7D24C95820E6AF53EEE755();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Bp_mon_38_Shake_AnimGraphNode_ModifyBone_B43618CB44C34BC189F070B50C5C0586();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Bp_mon_38_Shake_AnimGraphNode_ModifyBone_F028A100415B33219628ECB26532281F();
	void ExecuteUbergraph_Bp_mon_38_Shake(int32 EntryPoint);
	void ShakeBoneLayer(const struct FPoseLink& InPose, double PushScale_0, double BlendAlpha_0, struct FPoseLink* ShakeBoneLayer_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Bp_mon_38_Shake_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Bp_mon_38_Shake_C")
	}
	static class UBp_mon_38_Shake_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBp_mon_38_Shake_C>();
	}
};
DUMPER7_ASSERTS_UBp_mon_38_Shake_C;

}

