#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Bp_mon_037_BoneShake

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Bp_mon_037_BoneShake.Bp_mon_037_BoneShake_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct Bp_mon_037_BoneShake_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_Bp_mon_037_BoneShake_C_AnimGraph;

// Function Bp_mon_037_BoneShake.Bp_mon_037_BoneShake_C.ExecuteUbergraph_Bp_mon_037_BoneShake
// 0x0028 (0x0028 - 0x0000)
struct Bp_mon_037_BoneShake_C_ExecuteUbergraph_Bp_mon_037_BoneShake final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_StructMemberSet_Alpha_ImplicitCast;         // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_StructMemberSet_Alpha_ImplicitCast_1;       // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Bp_mon_037_BoneShake_C_ExecuteUbergraph_Bp_mon_037_BoneShake;

// Function Bp_mon_037_BoneShake.Bp_mon_037_BoneShake_C.ShakeBoneLayer
// 0x0030 (0x0030 - 0x0000)
struct Bp_mon_037_BoneShake_C_ShakeBoneLayer final
{
public:
	struct FPoseLink                              InPose;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	double                                        PushScale_0;                                       // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        BlendAlpha_0;                                      // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPoseLink                              ShakeBoneLayer_0;                                  // 0x0020(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_Bp_mon_037_BoneShake_C_ShakeBoneLayer;

}

