#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Bp_mon_14_Shake

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Bp_mon_14_Shake.Bp_mon_14_Shake_C
// 0x0BD0 (0x0FC0 - 0x03F0)
class UBp_mon_14_Shake_C final : public UAnimInstance
{
public:
	uint8                                         Pad_3E8[0x8];                                      // 0x03E8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x03F8(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0400(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x0408(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x0428(0x00B8)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_8;                        // 0x04E0(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_7;                        // 0x0608(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_6;                        // 0x0730(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_5;                        // 0x0858(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_4;                        // 0x0980(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_3;                        // 0x0AA8(0x0128)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0BD0(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0BF0(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_2;                        // 0x0C10(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x0D38(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x0E60(0x0128)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0F88(0x0020)()
	double                                        BlendAlpha;                                        // 0x0FA8(0x0008)(BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        PushScale;                                         // 0x0FB0(0x0008)(BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Bp_mon_14_Shake_AnimGraphNode_ModifyBone_0AA016EB44370A6C5EBED3BFFBAC659A();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Bp_mon_14_Shake_AnimGraphNode_ModifyBone_3319B4164E521C38CB68869B2EC02A2A();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Bp_mon_14_Shake_AnimGraphNode_ModifyBone_5BFD70144FCE610C7D4BD3BBFEFE8E97();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Bp_mon_14_Shake_AnimGraphNode_ModifyBone_5F2DDBCF47E173E874E1379935D2728C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Bp_mon_14_Shake_AnimGraphNode_ModifyBone_73B7C076494BDA033B2ACC93587620A1();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Bp_mon_14_Shake_AnimGraphNode_ModifyBone_92D07B674DDFDC55EACE6187DE76426B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Bp_mon_14_Shake_AnimGraphNode_ModifyBone_AF63EC1D4471B3A390FE8C943058A068();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Bp_mon_14_Shake_AnimGraphNode_ModifyBone_C0860B6645722AF2E240ABB234434028();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Bp_mon_14_Shake_AnimGraphNode_ModifyBone_CF0C38034DBE49C4A2F517A83FBA7876();
	void ExecuteUbergraph_Bp_mon_14_Shake(int32 EntryPoint);
	void ShakeBoneLayer(const struct FPoseLink& InPose, double PushScale_0, double BlendAlpha_0, struct FPoseLink* ShakeBoneLayer_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Bp_mon_14_Shake_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Bp_mon_14_Shake_C")
	}
	static class UBp_mon_14_Shake_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBp_mon_14_Shake_C>();
	}
};
DUMPER7_ASSERTS_UBp_mon_14_Shake_C;

}

