#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_NPC_mon_34_Yellow

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HTGame_structs.hpp"
#include "BP_NPC_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_NPC_mon_34_Yellow.BP_NPC_mon_34_Yellow_C
// 0x0020 (0x3160 - 0x3140)
class ABP_NPC_mon_34_Yellow_C final : public ABP_NPC_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x3138(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHTPlayerRangedEventNotifier*           HTPlayerRangedEventNotifier;                       // 0x3140(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Niagara;                                           // 0x3148(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           Timer_Handle;                                      // 0x3150(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          Is_Crime;                                          // 0x3158(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__BP_NPC_mon_34_Yellow_HTPlayerRangedEventNotifier_K2Node_ComponentBoundEvent_2_PlayerRangedEventDelegate__DelegateSignature(EPlayerRangedEventType Type);
	void BndEvt__BP_NPC_mon_34_Yellow_HTPlayerRangedEventNotifier_K2Node_ComponentBoundEvent_3_PlayerRangedEventDelegate__DelegateSignature(EPlayerRangedEventType Type);
	void BPOnTakeDamage(float DamageAmount, const struct FDamageEvent& DamageEvent, class AController* EventInstigator, class AActor* DamageCauser);
	void ExecuteUbergraph_BP_NPC_mon_34_Yellow(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_NPC_mon_34_Yellow_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_NPC_mon_34_Yellow_C")
	}
	static class ABP_NPC_mon_34_Yellow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_NPC_mon_34_Yellow_C>();
	}
};
DUMPER7_ASSERTS_ABP_NPC_mon_34_Yellow_C;

}

