#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PVAnomalyDoor_Portal

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "HTGame_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_PVAnomalyDoor_Portal.BP_PVAnomalyDoor_Portal_C.DoorClose
// 0x0018 (0x0018 - 0x0000)
struct BP_PVAnomalyDoor_Portal_C_DoorClose final
{
public:
	struct FRotator                               Angle_0;                                           // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BP_PVAnomalyDoor_Portal_C_DoorClose;

// Function BP_PVAnomalyDoor_Portal.BP_PVAnomalyDoor_Portal_C.DoorOpen
// 0x0018 (0x0018 - 0x0000)
struct BP_PVAnomalyDoor_Portal_C_DoorOpen final
{
public:
	struct FRotator                               Angle_0;                                           // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BP_PVAnomalyDoor_Portal_C_DoorOpen;

// Function BP_PVAnomalyDoor_Portal.BP_PVAnomalyDoor_Portal_C.ExecuteUbergraph_BP_PVAnomalyDoor_Portal
// 0x0338 (0x0338 - 0x0000)
struct BP_PVAnomalyDoor_Portal_C_ExecuteUbergraph_BP_PVAnomalyDoor_Portal final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_RLerp_ReturnValue;                        // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UObject*                                Temp_object_Variable;                              // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          K2Node_DynamicCast_AsAk_Audio_Event;               // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               K2Node_CustomEvent_Angle_1;                        // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 K2Node_CustomEvent_NewPortalTarget;                // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EHTNetMode                                    CallFunc_SwitchNetMode_OutNetMode;                 // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7A[0x6];                                       // 0x007A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x0080(0x0108)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0188(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           CallFunc_SpawnAkComponentAtLocation_ReturnValue;   // 0x01A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               K2Node_CustomEvent_Angle;                          // 0x01A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x01C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x01C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           CallFunc_SpawnAkComponentAtLocation_ReturnValue_1; // 0x01E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_RLerp_ReturnValue_1;                      // 0x01E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UNiagaraComponent*                      CallFunc_SpawnEmitterAttached_ReturnValue;         // 0x0200(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult_1;  // 0x0208(0x0108)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_1; // 0x0310(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_NewTarget;                            // 0x0318(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class AHTPlayerCharacter*               K2Node_Event_InPlayerCharacter;                    // 0x0320(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast; // 0x0330(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_PVAnomalyDoor_Portal_C_ExecuteUbergraph_BP_PVAnomalyDoor_Portal;

// Function BP_PVAnomalyDoor_Portal.BP_PVAnomalyDoor_Portal_C.OnLoaded_0BBE612B4B5BC7CEFFBA1D9AF7305547
// 0x0008 (0x0008 - 0x0000)
struct BP_PVAnomalyDoor_Portal_C_OnLoaded_0BBE612B4B5BC7CEFFBA1D9AF7305547 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_PVAnomalyDoor_Portal_C_OnLoaded_0BBE612B4B5BC7CEFFBA1D9AF7305547;

// Function BP_PVAnomalyDoor_Portal.BP_PVAnomalyDoor_Portal_C.OnTriggerTeleportStarted
// 0x0008 (0x0008 - 0x0000)
struct BP_PVAnomalyDoor_Portal_C_OnTriggerTeleportStarted final
{
public:
	const class AHTPlayerCharacter*               InPlayerCharacter;                                 // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_PVAnomalyDoor_Portal_C_OnTriggerTeleportStarted;

// Function BP_PVAnomalyDoor_Portal.BP_PVAnomalyDoor_Portal_C.SetNewPortalTarget
// 0x0008 (0x0008 - 0x0000)
struct BP_PVAnomalyDoor_Portal_C_SetNewPortalTarget final
{
public:
	class AActor*                                 NewPortalTarget;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_PVAnomalyDoor_Portal_C_SetNewPortalTarget;

// Function BP_PVAnomalyDoor_Portal.BP_PVAnomalyDoor_Portal_C.SetTargetActor
// 0x0008 (0x0008 - 0x0000)
struct BP_PVAnomalyDoor_Portal_C_SetTargetActor final
{
public:
	class AActor*                                 NewTarget;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_PVAnomalyDoor_Portal_C_SetTargetActor;

// Function BP_PVAnomalyDoor_Portal.BP_PVAnomalyDoor_Portal_C.GetPlaneComponent
// 0x0008 (0x0008 - 0x0000)
struct BP_PVAnomalyDoor_Portal_C_GetPlaneComponent final
{
public:
	class UStaticMeshComponent*                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_PVAnomalyDoor_Portal_C_GetPlaneComponent;

// Function BP_PVAnomalyDoor_Portal.BP_PVAnomalyDoor_Portal_C.GetTargetActor
// 0x0008 (0x0008 - 0x0000)
struct BP_PVAnomalyDoor_Portal_C_GetTargetActor final
{
public:
	class AActor*                                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_PVAnomalyDoor_Portal_C_GetTargetActor;

// Function BP_PVAnomalyDoor_Portal.BP_PVAnomalyDoor_Portal_C.GetTriggerBoxComponent
// 0x0008 (0x0008 - 0x0000)
struct BP_PVAnomalyDoor_Portal_C_GetTriggerBoxComponent final
{
public:
	class UBoxComponent*                          ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_PVAnomalyDoor_Portal_C_GetTriggerBoxComponent;

}

