#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Peekaboo_Entry

#include "Basic.hpp"

#include "BP_HTGamePlayEntranceActor_Base_classes.hpp"
#include "Engine_structs.hpp"
#include "HTGame_structs.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Peekaboo_Entry.BP_Peekaboo_Entry_C
// 0x0100 (0x0CE8 - 0x0BE8)
class ABP_Peekaboo_Entry_C final : public ABP_HTGamePlayEntranceActor_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0BE8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          Box;                                               // 0x0BF0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0BF8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_NewTrack_1_F0A2818B43F249F18B679AA391498CD7; // 0x0C00(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_F0A2818B43F249F18B679AA391498CD7; // 0x0C04(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C05[0x3];                                      // 0x0C05(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x0C08(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_Rate_6920D5F84A4477B8EEB8F0ACEAF106CF;    // 0x0C10(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline__Direction_6920D5F84A4477B8EEB8F0ACEAF106CF; // 0x0C14(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C15[0x3];                                      // 0x0C15(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline;                                          // 0x0C18(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class ACameraActor>            CameraFirst;                                       // 0x0C20(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class ACameraActor>            CameraBefore;                                      // 0x0C48(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class ACameraActor>            CameraAfter;                                       // 0x0C70(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	class FName                                   In_Transform_ID;                                   // 0x0C98(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CamPost;                                           // 0x0CA0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class AActor>                  RTPlane;                                           // 0x0CA8(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TArray<TSoftObjectPtr<class AActor>>          AmbList;                                           // 0x0CD0(0x0010)(Edit, BlueprintVisible)
	bool                                          isTeleported_;                                     // 0x0CE0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__BP_Peekaboo_Entry_Box_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void BPOnMainRoleLoadFinished(class AHTPlayerState* PlayerState);
	void ExecuteUbergraph_BP_Peekaboo_Entry(int32 EntryPoint);
	void SetActorHidden(bool NewHidden, TSoftObjectPtr<class AActor> Actor);
	void Timeline_0__FinishedFunc();
	void Timeline_0__UpdateFunc();
	void Timeline__FinishedFunc();
	void Timeline__UpdateFunc();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Peekaboo_Entry_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Peekaboo_Entry_C")
	}
	static class ABP_Peekaboo_Entry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Peekaboo_Entry_C>();
	}
};
DUMPER7_ASSERTS_ABP_Peekaboo_Entry_C;

}

