#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PortalSoundComp

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_PortalSoundComp.BP_PortalSoundComp_C
// 0x0020 (0x00E0 - 0x00C0)
class UBP_PortalSoundComp_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class FName                                   OpenTag;                                           // 0x00C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CloseTag;                                          // 0x00D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bClosed;                                           // 0x00D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsPlayerTrigger;                                  // 0x00D9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bAutoDoorControlWithWwiseSync;                     // 0x00DA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Close();
	void ExecuteUbergraph_BP_PortalSoundComp(int32 EntryPoint);
	void Open();
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_PortalSoundComp_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_PortalSoundComp_C")
	}
	static class UBP_PortalSoundComp_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_PortalSoundComp_C>();
	}
};
DUMPER7_ASSERTS_UBP_PortalSoundComp_C;

}

