#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PlayerCharacterBase

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "HTGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_PlayerCharacterBase.BP_PlayerCharacterBase_C
// 0x0050 (0x3590 - 0x3540)
class ABP_PlayerCharacterBase_C : public AHTPlayerCharacter
{
public:
	uint8                                         Pad_3538[0x8];                                     // 0x3538(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UHTContextualAnimSceneActorComponent*   HTContextualAnimSceneActor;                        // 0x3540(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCharacterHeadUpComp_BP_C*              CharacterHeadUpComp_BP;                            // 0x3548(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          DisableNinjaSpawn;                                 // 0x3550(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3551[0x7];                                     // 0x3551(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            ManaPlayUI;                                        // 0x3558(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          EnableNinjaVolumeFogPreset;                        // 0x3560(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3561[0x3];                                     // 0x3561(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ShoeName;                                          // 0x3564(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Is_Stick;                                          // 0x356C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_356D[0x3];                                     // 0x356D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              Action_Value;                                      // 0x3570(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           GlidLoopSound;                                     // 0x3580(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        testheight;                                        // 0x3588(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void FoliageInteractionGetOwnerInfo(struct FVector* CurrentPosition, struct FVector* CurrentForwardVector);
	void FoliageInteractionGetTrail(bool* ShouldAddTrail, struct FVector* TrailVelocity, struct FVector* TrailLocaltion, double* TrailRadius, double* TrailAlpha);
	TArray<struct FFluxInteractionData> GetInteractions(double Ratio, int32 Iteration);
	void PlayVideo(class UObject* VideoTexture);

	class UHTNiagaraComponent* GetNiagaraSysRecover() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_PlayerCharacterBase_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_PlayerCharacterBase_C")
	}
	static class ABP_PlayerCharacterBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_PlayerCharacterBase_C>();
	}
};
DUMPER7_ASSERTS_ABP_PlayerCharacterBase_C;

}

