#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_RollerCiaster

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HTGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_RollerCiaster.BP_RollerCiaster_C
// 0x0028 (0x04A8 - 0x0480)
class ABP_RollerCiaster_C final : public ARollerCoasterActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0480(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USplineComponent*                       Spline;                                            // 0x0488(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0490(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   Task_name;                                         // 0x0498(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Loction;                                           // 0x04A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BPOnMainRoleLoadFinished(class AHTPlayerState* PlayerState);
	void BPOnRollerCoasterFinished(class AHTPlayerState* TriggerPlayerState, class AHTPlayerController* TriggerPlayerController);
	void ExecuteUbergraph_BP_RollerCiaster(int32 EntryPoint);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_RollerCiaster_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_RollerCiaster_C")
	}
	static class ABP_RollerCiaster_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_RollerCiaster_C>();
	}
};
DUMPER7_ASSERTS_ABP_RollerCiaster_C;

}

