#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_RainMan_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "HTGame_structs.hpp"
#include "BP_RainManCameraRotator_classes.hpp"
#include "UDS_MB_RainMan_State_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_RainMan_Base.BP_RainMan_Base_C
// 0x0400 (0x0FB0 - 0x0BB0)
class ABP_RainMan_Base_C final : public ABP_RainManCameraRotator_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_RainMan_Base_C;                  // 0x0BB0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCameraComponent*                       Camera;                                            // 0x0BB8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Sphere;                                            // 0x0BC0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_Umbrella_003;                                   // 0x0BC8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box_LeaveRange;                                    // 0x0BD0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_Umbrella_001;                                   // 0x0BD8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Umbrella_1;                                        // 0x0BE0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_Umbrella_002;                                   // 0x0BE8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                    TargetPoint_Level;                                 // 0x0BF0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         TimeLine_04_Blur_5C87BCAC415B31C1EB62F59AF0960262; // 0x0BF8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TimeLine_04_Rain_5C87BCAC415B31C1EB62F59AF0960262; // 0x0BFC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TimeLine_04_LerpReverse_5C87BCAC415B31C1EB62F59AF0960262; // 0x0C00(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TimeLine_04_ScreenWave_5C87BCAC415B31C1EB62F59AF0960262; // 0x0C04(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            TimeLine_04__Direction_5C87BCAC415B31C1EB62F59AF0960262; // 0x0C08(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C09[0x7];                                      // 0x0C09(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     TimeLine_04;                                       // 0x0C10(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         TimeLine_03_Blur_7E19DC994E6D66BC48B9FDAECA64BE1D; // 0x0C18(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TimeLine_03_Rain_7E19DC994E6D66BC48B9FDAECA64BE1D; // 0x0C1C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TimeLine_03_LerpReverse_7E19DC994E6D66BC48B9FDAECA64BE1D; // 0x0C20(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TimeLine_03_ScreenWave_7E19DC994E6D66BC48B9FDAECA64BE1D; // 0x0C24(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            TimeLine_03__Direction_7E19DC994E6D66BC48B9FDAECA64BE1D; // 0x0C28(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C29[0x7];                                      // 0x0C29(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     TimeLine_03;                                       // 0x0C30(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         TimeLine_02_Blur_0A5D1EBB4641E0BEB87296A06494DE9D; // 0x0C38(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TimeLine_02_Rain_0A5D1EBB4641E0BEB87296A06494DE9D; // 0x0C3C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TimeLine_02_LerpReverse_0A5D1EBB4641E0BEB87296A06494DE9D; // 0x0C40(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TimeLine_02_ScreenWave_0A5D1EBB4641E0BEB87296A06494DE9D; // 0x0C44(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            TimeLine_02__Direction_0A5D1EBB4641E0BEB87296A06494DE9D; // 0x0C48(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C49[0x7];                                      // 0x0C49(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     TimeLine_02;                                       // 0x0C50(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         RainMan_Active_Drips_80B7D2AF44E8096F99FA0C98A64EE60E; // 0x0C58(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RainMan_Active_Wave_80B7D2AF44E8096F99FA0C98A64EE60E; // 0x0C5C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RainMan_Active_BlurCureve_80B7D2AF44E8096F99FA0C98A64EE60E; // 0x0C60(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RainMan_Active_Reverse1_80B7D2AF44E8096F99FA0C98A64EE60E; // 0x0C64(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            RainMan_Active__Direction_80B7D2AF44E8096F99FA0C98A64EE60E; // 0x0C68(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C69[0x7];                                      // 0x0C69(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     RainMan_Active;                                    // 0x0C70(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_UmbrelaFloat_Float_E7570C2A4D58A96949342BA76EBF600D; // 0x0C78(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_UmbrelaFloat__Direction_E7570C2A4D58A96949342BA76EBF600D; // 0x0C7C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C7D[0x3];                                      // 0x0C7D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_UmbrelaFloat;                             // 0x0C80(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AHTAISpawnManager*                      HTAISpawn;                                         // 0x0C88(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class AHTVisualSpawnManager*                  HTVisualspawn;                                     // 0x0C90(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class ABP_TreasureBox_Base_C*                 TreasureBox;                                       // 0x0C98(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Scale_Black;                                       // 0x0CA0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsFloat;                                           // 0x0CB8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CB9[0x7];                                      // 0x0CB9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 In_Vision_ID;                                      // 0x0CC0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class AVision_RainMan_01_C*                   BP_RainMan_Pockmon;                                // 0x0CD0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	struct FTempCustomTimeDilationParams          In_Params;                                         // 0x0CD8(0x00E8)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FTempCustomTimeDilationParams          In_Params_Leave;                                   // 0x0DC0(0x00E8)(Edit, BlueprintVisible, DisableEditOnInstance)
	class ULevelStreamingDynamic*                 Level;                                             // 0x0EA8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UWorld>                  Level_RainMan;                                     // 0x0EB0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash)
	struct FVector                                Location_Umbrella;                                 // 0x0ED8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             Transfer_Umbrella;                                 // 0x0EF0(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          Ak_StartBattle;                                    // 0x0F50(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          Ak_EndBattle;                                      // 0x0F58(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          Ak_BlackLake;                                      // 0x0F60(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          Ak_BlackLake_Stop;                                 // 0x0F68(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          Ak_Umberlla;                                       // 0x0F70(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          Ak_Umberlla_Stop;                                  // 0x0F78(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         ResetCameraSpeed;                                  // 0x0F80(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUDS_MB_RainMan_State                         UDS_MB_RainMan_State;                              // 0x0F84(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F85[0x3];                                      // 0x0F85(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AHTPlayerState*                         Player_State;                                      // 0x0F88(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AHTPlayerCharacter*                     HTCharacter_Start;                                 // 0x0F90(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AHTPlayerCharacter*                     HTCharacter_LeaveRange;                            // 0x0F98(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UHTCharacterStateManagerComponent*      State_Manager_Component;                           // 0x0FA0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AHTPlayerCharacter*                     HTCharacter_EterAgainRange;                        // 0x0FA8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__BP_RainMan_Base_Box_LeaveRange_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void BndEvt__BP_RainMan_Base_Box_LeaveRange_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void BndEvt__NewBlueprint_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void BPOnMainRoleLoadFinished(class AHTPlayerState* PlayerState);
	void Brocast_Complete();
	void Brocast_LeaveRange(class AHTPlayerCharacter* HTCharacter_LeaveRange_0);
	void Brocast_OnStartOverLap(class AHTPlayerCharacter* HTPlayerCharacter);
	void Brocast_OverLapLeaveRangeAgain(class AHTPlayerCharacter* HTCharacter_EterAgainRange_0);
	void CustomEvent(class AHTAISpawnManager* SpawnMgr, class AHTCharacter* OwnerPlayer);
	void Event_LeaveRange(class AHTPlayerCharacter* HTPlayer_Character);
	void Event_StartScreen(class AHTPlayerCharacter* HTPlayer_Character);
	void ExecuteUbergraph_BP_RainMan_Base(int32 EntryPoint);
	void Manager_ISOverTurn(EUDS_MB_RainMan_State RainMan_State);
	void Maneger_LakeState(bool Show_);
	void OnBeginSpawnReset();
	void OnFail_AC228F17464C69F737B9B48AE5500AAD(class AHTAISpawnManager* Spawn);
	void OnMainRoleFinish_AC228F17464C69F737B9B48AE5500AAD(class AHTAISpawnManager* Spawn);
	void OnVisualSpawnedEvent_事件(class AActor* Actor);
	void RainMan_Active__BeReverse__EventFunc();
	void RainMan_Active__FinishedFunc();
	void RainMan_Active__UpdateFunc();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void TimeLine_02__FinishedFunc();
	void TimeLine_02__OnReverse__EventFunc();
	void TimeLine_02__UpdateFunc();
	void TimeLine_03__FinishedFunc();
	void TimeLine_03__OnReverse__EventFunc();
	void TimeLine_03__UpdateFunc();
	void TimeLine_04__FinishedFunc();
	void TimeLine_04__OnReverse__EventFunc();
	void TimeLine_04__UpdateFunc();
	void Timeline_UmbrelaFloat__FinishedFunc();
	void Timeline_UmbrelaFloat__UpdateFunc();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_RainMan_Base_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_RainMan_Base_C")
	}
	static class ABP_RainMan_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_RainMan_Base_C>();
	}
};
DUMPER7_ASSERTS_ABP_RainMan_Base_C;

}

