#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_RD_AutoDoor_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_AutoDoor_Base_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_RD_AutoDoor_Base.BP_RD_AutoDoor_Base_C
// 0x0040 (0x0C98 - 0x0C58)
class ABP_RD_AutoDoor_Base_C : public ABP_AutoDoor_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_RD_AutoDoor_Base_C;              // 0x0C58(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   DoorL;                                             // 0x0C60(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   DoorR;                                             // 0x0C68(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_X_59DA16A7483E96954A87F0A366FBF311;     // 0x0C70(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_59DA16A7483E96954A87F0A366FBF311; // 0x0C74(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C75[0x3];                                      // 0x0C75(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x0C78(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          OpenAkEvent;                                       // 0x0C80(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          CloseAkEvent;                                      // 0x0C88(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         L_Rotation_Z__Yaw_;                                // 0x0C90(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         R_Rotation_Z__Yaw_;                                // 0x0C94(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BPGetInteractEntries(class AHTPlayerController* ByPC, TArray<struct FInteractEntry>* OutInteractEntries);
	void BPOnMainRoleLoadFinished(class AHTPlayerState* PlayerState);
	void CloseDoor();
	void ExecuteUbergraph_BP_RD_AutoDoor_Base(int32 EntryPoint);
	void OpenDoor(int32 DoorState_0);
	void Timeline_0__FinishedFunc();
	void Timeline_0__UpdateFunc();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_RD_AutoDoor_Base_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_RD_AutoDoor_Base_C")
	}
	static class ABP_RD_AutoDoor_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_RD_AutoDoor_Base_C>();
	}
};
DUMPER7_ASSERTS_ABP_RD_AutoDoor_Base_C;

}

