#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_School_MythDataLayerLoader

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HTGame_structs.hpp"
#include "HTGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_School_MythDataLayerLoader.BP_School_MythDataLayerLoader_C
// 0x0078 (0x0BF8 - 0x0B80)
class ABP_School_MythDataLayerLoader_C final : public AHTVisualActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B80(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBillboardComponent*                    Billboard;                                         // 0x0B88(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box;                                               // 0x0B90(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class AUltra_Dynamic_Sky_HT_C> SkyBP;                                             // 0x0B98(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	class FName                                   LoadYahahaID;                                      // 0x0BC0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   RelatedYahahaID;                                   // 0x0BC8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   AdditionalYahahaID;                                // 0x0BD0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 VisionID;                                          // 0x0BD8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	bool                                          NeedAdditionalCheck_;                              // 0x0BE8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NeedOvertimeTeleport_;                             // 0x0BE9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BEA[0x2];                                      // 0x0BEA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   TransferID;                                        // 0x0BEC(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsLoaded_;                                         // 0x0BF4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__BP_School_MythDataLayerLoader_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void BndEvt__BP_School_MythDataLayerLoader_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void BPOnMainRoleLoadFinished(class AHTPlayerState* PlayerState);
	void ExecuteUbergraph_BP_School_MythDataLayerLoader(int32 EntryPoint);
	void HourChange(int32 Hour);
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void SetCollision(bool NeedCollision_);
	void SetLoadYahaha(bool YahahaState);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_School_MythDataLayerLoader_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_School_MythDataLayerLoader_C")
	}
	static class ABP_School_MythDataLayerLoader_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_School_MythDataLayerLoader_C>();
	}
};
DUMPER7_ASSERTS_ABP_School_MythDataLayerLoader_C;

}

