#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SceneDissolveManager

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HTGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_SceneDissolveManager.BP_SceneDissolveManager_C
// 0x0018 (0x0C08 - 0x0BF0)
class ABP_SceneDissolveManager_C final : public AHTSceneDissolveManagerActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0BF0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         Timeline_NewTrack_0_0DCFE2B9429D1006292B1C98AE44CFBF; // 0x0BF8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline__Direction_0DCFE2B9429D1006292B1C98AE44CFBF; // 0x0BFC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BFD[0x3];                                      // 0x0BFD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline;                                          // 0x0C00(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_SceneDissolveManager(int32 EntryPoint);
	void ReceiveBeginPlay();
	void StartCaptureSceneDissolve();
	void Timeline__FinishedFunc();
	void Timeline__UpdateFunc();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_SceneDissolveManager_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_SceneDissolveManager_C")
	}
	static class ABP_SceneDissolveManager_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_SceneDissolveManager_C>();
	}
};
DUMPER7_ASSERTS_ABP_SceneDissolveManager_C;

}

