#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TreasureBox_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "HTGame_structs.hpp"
#include "HTGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_TreasureBox_Base.BP_TreasureBox_Base_C
// 0x0070 (0x0EA0 - 0x0E30)
#pragma pack(push, 0x1)
class alignas(0x10) ABP_TreasureBox_Base_C : public AHTStaticTreasureBoxActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0E30(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USphereComponent*                       TeachCollision;                                    // 0x0E38(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   ChildActor;                                        // 0x0E40(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       Trigger;                                           // 0x0E48(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Float_Float_8BE809464368D6B867D2C2A0ACBB7205;      // 0x0E50(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Float__Direction_8BE809464368D6B867D2C2A0ACBB7205; // 0x0E54(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E55[0x3];                                      // 0x0E55(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     float_0;                                           // 0x0E58(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Location;                                          // 0x0E60(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Rotation;                                          // 0x0E78(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsFloat;                                           // 0x0E90(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BPOnMainRoleLoadFinished(class AHTPlayerState* PlayerState);
	void ExecuteUbergraph_BP_TreasureBox_Base(int32 EntryPoint);
	void Float__FinishedFunc();
	void Float__UpdateFunc();
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_TreasureBox_Base_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_TreasureBox_Base_C")
	}
	static class ABP_TreasureBox_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_TreasureBox_Base_C>();
	}
};
#pragma pack(pop)
DUMPER7_ASSERTS_ABP_TreasureBox_Base_C;

}

