#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Vehicle_005_Low

#include "Basic.hpp"

#include "BP_SkeletalLowVehicle_Bus_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Vehicle_005_Low.BP_Vehicle_005_Low_C
// 0x0030 (0x0780 - 0x0750)
class ABP_Vehicle_005_Low_C : public ABP_SkeletalLowVehicle_Bus_Base_C
{
public:
	class UPointLightComponent*                   PointLight_B;                                      // 0x0750(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Wheel_FL;                                          // 0x0758(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Wheel_RR;                                          // 0x0760(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Wheel_RL;                                          // 0x0768(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Wheel_FR;                                          // 0x0770(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Vehicle_005_Low_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Vehicle_005_Low_C")
	}
	static class ABP_Vehicle_005_Low_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Vehicle_005_Low_C>();
	}
};
DUMPER7_ASSERTS_ABP_Vehicle_005_Low_C;

}

