#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Vehicle_034_Hight

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_Vehicle_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Vehicle_034_Hight.BP_Vehicle_034_Hight_C
// 0x0038 (0x1480 - 0x1448)
class ABP_Vehicle_034_Hight_C final : public ABP_Vehicle_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Vehicle_034_Hight_C;             // 0x1448(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBP_MassVehicleAgentComponent_C*        BP_MassVehicleAgentComponent;                      // 0x1450(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Wheel_FL2;                                         // 0x1458(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPBubbleComponent_C*                   BPBubbleComponent;                                 // 0x1460(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Wheel_RR1;                                         // 0x1468(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Wheel_FL;                                          // 0x1470(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Wheel_RR;                                          // 0x1478(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Vehicle_034_Hight(int32 EntryPoint);
	void ReceiveActorBeginOverlap(class AActor* OtherActor);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Vehicle_034_Hight_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Vehicle_034_Hight_C")
	}
	static class ABP_Vehicle_034_Hight_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Vehicle_034_Hight_C>();
	}
};
DUMPER7_ASSERTS_ABP_Vehicle_034_Hight_C;

}

