#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Vehicle_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HTGame_structs.hpp"
#include "HTGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Vehicle_Base.BP_Vehicle_Base_C
// 0x00B8 (0x1448 - 0x1390)
class ABP_Vehicle_Base_C : public AHTWheeledVehicleDrivable
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1390(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVehicleForceFieldComponent*            VehicleForceField;                                 // 0x1398(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   GlassCollision;                                    // 0x13A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHTSnowInteractionComponent*            HTSnowInteraction;                                 // 0x13A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCameraComponent*                       Camera;                                            // 0x13B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshBlockPawn;                               // 0x13B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHTFluxInteractionComponent*            HTFluxInteraction;                                 // 0x13C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDLWE_InteractionVehicle_C*             DLWE_InteractionVehicleFL;                         // 0x13C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDLWE_InteractionVehicle_C*             DLWE_InteractionVehicleFR;                         // 0x13D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDLWE_InteractionVehicle_C*             DLWE_InteractionVehicleRL;                         // 0x13D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDLWE_InteractionVehicle_C*             DLWE_InteractionVehicleRR;                         // 0x13E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHTAIRVOComponent*                      HTAIRVO;                                           // 0x13E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_VehicleEffectComponent_C*           BP_VehicleEffectComponent;                         // 0x13F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    BackLight;                                         // 0x13F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   FrontLight_R;                                      // 0x1400(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   FrontLight_L;                                      // 0x1408(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_VehicleInteractComponent_C*         BP_VehicleInteractComponent_FL;                    // 0x1410(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_VehicleInteractComponent_C*         BP_VehicleInteractComponent_FR;                    // 0x1418(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UVehicleDeformableComponent*            VehicleDeformable;                                 // 0x1420(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        CurrentHitInterval;                                // 0x1428(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MinHitInterval;                                    // 0x1430(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseForSequence;                                    // 0x1438(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	bool                                          SeqHeadLight;                                      // 0x1439(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	bool                                          SeqRunningLight;                                   // 0x143A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	bool                                          OpenRealLight;                                     // 0x143B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	bool                                          Reversing_Lights;                                  // 0x143C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	bool                                          Right_Turn_Signal_Lights;                          // 0x143D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	bool                                          Left_Turn_Signal_Lights;                           // 0x143E(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	bool                                          Left_Brake_Lights;                                 // 0x143F(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	bool                                          Right_Brake_Lights;                                // 0x1440(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)

public:
	void AudioPassbyApply(double OtherKHM, const struct FVector& OtherForward, class AActor* Actor);
	void BPCall_OnPlayerGetOff(class AHTPlayerCharacter* Player, int32 SeatIndex);
	void BPCall_OnPlayerGetOn(class AHTPlayerCharacter* Player, int32 SeatIndex);
	void BpUpdateRainMask();
	bool CanBePooled();
	void ExecuteUbergraph_BP_Vehicle_Base(int32 EntryPoint);
	TArray<struct FFluxInteractionData> GetInteractions(double Ratio, int32 Iteration);
	void OnRacingEndSequencePrePlayedDelegate();
	void OnRacingEndSequencePrePlayedDelegate_Event();
	void OnRacingEndSequenceStoppedDelegate();
	void OnRacingEndSequenceStoppedDelegate_Event();
	void PrepareForGame();
	void ReceiveBeginPlay();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void SequeceCarLightFunc();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Vehicle_Base_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Vehicle_Base_C")
	}
	static class ABP_Vehicle_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Vehicle_Base_C>();
	}
};
DUMPER7_ASSERTS_ABP_Vehicle_Base_C;

}

