#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Vehicle_QuestVehicle_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HTGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Vehicle_QuestVehicle_Base.BP_Vehicle_QuestVehicle_Base_C
// 0x0068 (0x1550 - 0x14E8)
class ABP_Vehicle_QuestVehicle_Base_C final : public AHTMassTrafficQuestBus
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x14E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshCollisionComponent*          StaticMeshCollision;                               // 0x14F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_VehicleEffectComponent_C*           BP_VehicleEffectComponent;                         // 0x14F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    BackLight;                                         // 0x1500(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHTFadeComponent*                       HTFade;                                            // 0x1508(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USilentCheckComponent*                  SilentCheck;                                       // 0x1510(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   FrontLight_R;                                      // 0x1518(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   FrontLight_L;                                      // 0x1520(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_VehicleInteractComponent_C*         BP_VehicleInteractComponent_FL;                    // 0x1528(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_VehicleInteractComponent_C*         BP_VehicleInteractComponent_FR;                    // 0x1530(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UVehicleDeformableComponent*            VehicleDeformable;                                 // 0x1538(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        CurrentHitInterval;                                // 0x1540(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MinHitInterval;                                    // 0x1548(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BPCall_OnPlayerGetOff(class AHTPlayerCharacter* Player, int32 SeatIndex);
	void BPCall_OnPlayerGetOn(class AHTPlayerCharacter* Player, int32 SeatIndex);
	void ExecuteUbergraph_BP_Vehicle_QuestVehicle_Base(int32 EntryPoint);
	void OnRacingEndSequencePrePlayedDelegate();
	void OnRacingEndSequencePrePlayedDelegate_Event();
	void OnRacingEndSequenceStoppedDelegate();
	void OnRacingEndSequenceStoppedDelegate_Event();
	void ReceiveBeginPlay();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Vehicle_QuestVehicle_Base_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Vehicle_QuestVehicle_Base_C")
	}
	static class ABP_Vehicle_QuestVehicle_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Vehicle_QuestVehicle_Base_C>();
	}
};
DUMPER7_ASSERTS_ABP_Vehicle_QuestVehicle_Base_C;

}

