#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Vehicle_002_Module

#include "Basic.hpp"

#include "BP_Vehicle_002_Hight_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Vehicle_002_Module.BP_Vehicle_002_Module_C
// 0x0038 (0x1508 - 0x14D0)
class ABP_Vehicle_002_Module_C : public ABP_Vehicle_002_Hight_C
{
public:
	class UBPC_VehicleNamePlate_C*                BPC_VehicleNamePlate;                              // 0x14D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHTVehicleForkEffectComponent*          HTVehicleForkEffect;                               // 0x14D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHTVehicleModificationComponent*        HTVehicleModification;                             // 0x14E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           TestDoorMontage1;                                  // 0x14E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           TestDoorMontage2;                                  // 0x14F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Actors_to_Ignore;                                  // 0x14F8(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Vehicle_002_Module_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Vehicle_002_Module_C")
	}
	static class ABP_Vehicle_002_Module_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Vehicle_002_Module_C>();
	}
};
DUMPER7_ASSERTS_ABP_Vehicle_002_Module_C;

}

