#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPCharacterActor

#include "Basic.hpp"


namespace SDK::Params
{

// Function BPCharacterActor.BPCharacterActor_C.ExecuteUbergraph_BPCharacterActor
// 0x000C (0x000C - 0x0000)
struct BPCharacterActor_C_ExecuteUbergraph_BPCharacterActor final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bActivate;                            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bShow;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsEmpty;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPCharacterActor_C_ExecuteUbergraph_BPCharacterActor;

// Function BPCharacterActor.BPCharacterActor_C.BP_ShowForkEffect
// 0x0002 (0x0002 - 0x0000)
struct BPCharacterActor_C_BP_ShowForkEffect final
{
public:
	bool                                          bShow;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsEmpty;                                           // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPCharacterActor_C_BP_ShowForkEffect;

// Function BPCharacterActor.BPCharacterActor_C.BP_ActivatedPowerEffect
// 0x0001 (0x0001 - 0x0000)
struct BPCharacterActor_C_BP_ActivatedPowerEffect final
{
public:
	bool                                          bActivate;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPCharacterActor_C_BP_ActivatedPowerEffect;

// Function BPCharacterActor.BPCharacterActor_C.GetFormationMemberWC
// 0x0008 (0x0008 - 0x0000)
struct BPCharacterActor_C_GetFormationMemberWC final
{
public:
	class UWidgetComponent*                       ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPCharacterActor_C_GetFormationMemberWC;

// Function BPCharacterActor.BPCharacterActor_C.GetForkNiagara
// 0x0008 (0x0008 - 0x0000)
struct BPCharacterActor_C_GetForkNiagara final
{
public:
	class UHTNiagaraComponent*                    ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPCharacterActor_C_GetForkNiagara;

}

