#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPI_FoliageInterface

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BPI_FoliageInterface.BPI_FoliageInterface_C.FoliageInteractionGetTrail
// 0x0048 (0x0048 - 0x0000)
struct BPI_FoliageInterface_C_FoliageInteractionGetTrail final
{
public:
	bool                                          ShouldAddTrail;                                    // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                TrailVelocity;                                     // 0x0008(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                TrailLocaltion;                                    // 0x0020(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        TrailRadius;                                       // 0x0038(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        TrailAlpha;                                        // 0x0040(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPI_FoliageInterface_C_FoliageInteractionGetTrail;

// Function BPI_FoliageInterface.BPI_FoliageInterface_C.FoliageInteractionGetOwnerInfo
// 0x0030 (0x0030 - 0x0000)
struct BPI_FoliageInterface_C_FoliageInteractionGetOwnerInfo final
{
public:
	struct FVector                                CurrentPosition;                                   // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CurrentForwardVector;                              // 0x0018(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPI_FoliageInterface_C_FoliageInteractionGetOwnerInfo;

}

