#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPI_FluxInteractionRenderer

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BPI_FluxInteractionRenderer.BPI_FluxInteractionRenderer_C.SetInteractionsTextureTrain
// 0x0008 (0x0008 - 0x0000)
struct BPI_FluxInteractionRenderer_C_SetInteractionsTextureTrain final
{
public:
	class UTextureRenderTarget2D*                 Texture;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPI_FluxInteractionRenderer_C_SetInteractionsTextureTrain;

// Function BPI_FluxInteractionRenderer.BPI_FluxInteractionRenderer_C.SetInteractionsTexture
// 0x0008 (0x0008 - 0x0000)
struct BPI_FluxInteractionRenderer_C_SetInteractionsTexture final
{
public:
	class UTextureRenderTarget2D*                 Texture;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPI_FluxInteractionRenderer_C_SetInteractionsTexture;

// Function BPI_FluxInteractionRenderer.BPI_FluxInteractionRenderer_C.SetInteractionsAreaTrain
// 0x0010 (0x0010 - 0x0000)
struct BPI_FluxInteractionRenderer_C_SetInteractionsAreaTrain final
{
public:
	struct FLinearColor                           Area;                                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPI_FluxInteractionRenderer_C_SetInteractionsAreaTrain;

// Function BPI_FluxInteractionRenderer.BPI_FluxInteractionRenderer_C.SetInteractionsArea
// 0x0010 (0x0010 - 0x0000)
struct BPI_FluxInteractionRenderer_C_SetInteractionsArea final
{
public:
	struct FLinearColor                           Area;                                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPI_FluxInteractionRenderer_C_SetInteractionsArea;

// Function BPI_FluxInteractionRenderer.BPI_FluxInteractionRenderer_C.GetSimulationState
// 0x0008 (0x0008 - 0x0000)
struct BPI_FluxInteractionRenderer_C_GetSimulationState final
{
public:
	class PDA_FluxSimulationState_0::UPDA_FluxSimulationState_C* State;                              // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPI_FluxInteractionRenderer_C_GetSimulationState;

// Function BPI_FluxInteractionRenderer.BPI_FluxInteractionRenderer_C.GetCoastlineState
// 0x0008 (0x0008 - 0x0000)
struct BPI_FluxInteractionRenderer_C_GetCoastlineState final
{
public:
	class PDA_FluxCoastlineState::UPDA_FluxCoastlineState_C* State;                                  // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPI_FluxInteractionRenderer_C_GetCoastlineState;

}

