#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPUI_CombatAwardLevelSlot

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HTGame_structs.hpp"
#include "HTGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BPUI_CombatAwardLevelSlot.BPUI_CombatAwardLevelSlot_C
// 0x0080 (0x0AC0 - 0x0A40)
class UBPUI_CombatAwardLevelSlot_C final : public UHTUI_CombatAwardLevelSlot
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0A40(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Vx_H;                                              // 0x0A48(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_38;                                          // 0x0A50(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ABP_NPC_06906_C*                        NPC_06906;                                         // 0x0A58(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	struct FSetViewTargetParam                    Set_View_Target_Param;                             // 0x0A60(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	void SequenceEvent_0();
	void SequenceEvent();
	void ExecuteUbergraph_BPUI_CombatAwardLevelSlot(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BPUI_CombatAwardLevelSlot_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BPUI_CombatAwardLevelSlot_C")
	}
	static class UBPUI_CombatAwardLevelSlot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPUI_CombatAwardLevelSlot_C>();
	}
};
DUMPER7_ASSERTS_UBPUI_CombatAwardLevelSlot_C;

}

