#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPUI_CombatAwardSpecialAward

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HTGame_structs.hpp"
#include "HTGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BPUI_CombatAwardSpecialAward.BPUI_CombatAwardSpecialAward_C
// 0x0090 (0x0FB8 - 0x0F28)
class UBPUI_CombatAwardSpecialAward_C final : public UHTUI_CombatAwardSpecialAward
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0F28(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USafeZone*                              SafeZone_0;                                        // 0x0F30(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Preview;                                     // 0x0F38(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_38;                                          // 0x0F40(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBoundActionBar*                  CBActionBar_Close;                                 // 0x0F48(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ABP_NPC_06906_C*                        NPC_06906;                                         // 0x0F50(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	struct FSetViewTargetParam                    Set_View_Target_Param;                             // 0x0F58(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	void ExecuteUbergraph_BPUI_CombatAwardSpecialAward(int32 EntryPoint);
	void SequenceEvent();
	void SequenceEvent_0();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BPUI_CombatAwardSpecialAward_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BPUI_CombatAwardSpecialAward_C")
	}
	static class UBPUI_CombatAwardSpecialAward_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPUI_CombatAwardSpecialAward_C>();
	}
};
DUMPER7_ASSERTS_UBPUI_CombatAwardSpecialAward_C;

}

