#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPUI_CombatAwardQuestInfo

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HTGame_structs.hpp"
#include "HTGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BPUI_CombatAwardQuestInfo.BPUI_CombatAwardQuestInfo_C
// 0x0098 (0x0F90 - 0x0EF8)
class UBPUI_CombatAwardQuestInfo_C final : public UHTUI_CombatAwardQuestInfo
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0EF8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_Preview;                                     // 0x0F00(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_41;                                          // 0x0F08(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBPUI_RadioBox_BPQuest_C*               BPUI_RadioBox_QuestWeekly;                         // 0x0F10(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBPUI_RadioBox_BPQuest_C*               BPUI_RadioBox_QuestOnce;                           // 0x0F18(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBPUI_RadioBox_BPQuest_C*               BPUI_RadioBox_QuestDaily;                          // 0x0F20(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ABP_NPC_06906_C*                        NPC_06906;                                         // 0x0F28(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	struct FSetViewTargetParam                    Set_View_Target_Param;                             // 0x0F30(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	void SequenceEvent_0();
	void SequenceEvent();
	void ExecuteUbergraph_BPUI_CombatAwardQuestInfo(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BPUI_CombatAwardQuestInfo_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BPUI_CombatAwardQuestInfo_C")
	}
	static class UBPUI_CombatAwardQuestInfo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPUI_CombatAwardQuestInfo_C>();
	}
};
DUMPER7_ASSERTS_UBPUI_CombatAwardQuestInfo_C;

}

