#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPUI_PageCheckBox

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "HTGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BPUI_PageCheckBox.BPUI_PageCheckBox_C
// 0x0230 (0x0B10 - 0x08E0)
class UBPUI_PageCheckBox_C final : public UHTUI_CheckBox
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x08E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_Select;                                      // 0x08E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Hovered;                                     // 0x08F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_62;                                          // 0x08F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FSlateBrush                            In_xuanting;                                       // 0x0900(0x00B0)(Edit, BlueprintVisible)
	struct FSlateBrush                            In_xuanzhong;                                      // 0x09B0(0x00B0)(Edit, BlueprintVisible)
	struct FSlateBrush                            In_xuanzhong2;                                     // 0x0A60(0x00B0)(Edit, BlueprintVisible)

public:
	void BndEvt__BPUI_CheckBox_02_CheckBox_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature(bool bIsChecked);
	void Construct();
	void ExecuteUbergraph_BPUI_PageCheckBox(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BPUI_PageCheckBox_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BPUI_PageCheckBox_C")
	}
	static class UBPUI_PageCheckBox_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPUI_PageCheckBox_C>();
	}
};
DUMPER7_ASSERTS_UBPUI_PageCheckBox_C;

}

