#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPUI_MonsterBufferManager

#include "Basic.hpp"

#include "HTGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BPUI_MonsterBufferManager.BPUI_MonsterBufferManager_C
// 0x0028 (0x0FA0 - 0x0F78)
class UBPUI_MonsterBufferManager_C final : public UHTUI_MonsterBufferManager
{
public:
	class UBPUI_Buffer_C*                         BPUI_Buffer_4;                                     // 0x0F78(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBPUI_Buffer_C*                         BPUI_Buffer_3;                                     // 0x0F80(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBPUI_Buffer_C*                         BPUI_Buffer_2;                                     // 0x0F88(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBPUI_Buffer_C*                         BPUI_Buffer_1;                                     // 0x0F90(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBPUI_Buffer_C*                         BPUI_Buffer;                                       // 0x0F98(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BPUI_MonsterBufferManager_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BPUI_MonsterBufferManager_C")
	}
	static class UBPUI_MonsterBufferManager_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPUI_MonsterBufferManager_C>();
	}
};
DUMPER7_ASSERTS_UBPUI_MonsterBufferManager_C;

}

