#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPUI_RadioBox_CombatAward

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function BPUI_RadioBox_CombatAward.BPUI_RadioBox_CombatAward_C.OnMouseLeave
// 0x0080 (0x0080 - 0x0000)
struct BPUI_RadioBox_CombatAward_C_OnMouseLeave final
{
public:
	struct FPointerEvent                          MouseEvent;                                        // 0x0000(0x0080)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_BPUI_RadioBox_CombatAward_C_OnMouseLeave;

// Function BPUI_RadioBox_CombatAward.BPUI_RadioBox_CombatAward_C.OnMouseEnter
// 0x00B8 (0x00B8 - 0x0000)
struct BPUI_RadioBox_CombatAward_C_OnMouseEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0080)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_BPUI_RadioBox_CombatAward_C_OnMouseEnter;

// Function BPUI_RadioBox_CombatAward.BPUI_RadioBox_CombatAward_C.ExecuteUbergraph_BPUI_RadioBox_CombatAward
// 0x0168 (0x0168 - 0x0000)
struct BPUI_RadioBox_CombatAward_C_ExecuteUbergraph_BPUI_RadioBox_CombatAward final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0004(0x0038)(IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerEvent                          K2Node_Event_MouseEvent_1;                         // 0x0040(0x0080)(ConstParm)
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x00C0(0x0080)(ConstParm)
	class UWidget*                                K2Node_ComponentBoundEvent_InWidget;               // 0x0140(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0148(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0150(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPUI_RadioBox_CombatAward_C_ExecuteUbergraph_BPUI_RadioBox_CombatAward;

// Function BPUI_RadioBox_CombatAward.BPUI_RadioBox_CombatAward_C.BndEvt__BPUI_RadionBox_Table_RadioBox_K2Node_ComponentBoundEvent_4_OnUnSelectedDelegate__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BPUI_RadioBox_CombatAward_C_BndEvt__BPUI_RadionBox_Table_RadioBox_K2Node_ComponentBoundEvent_4_OnUnSelectedDelegate__DelegateSignature final
{
public:
	class UWidget*                                InWidget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPUI_RadioBox_CombatAward_C_BndEvt__BPUI_RadionBox_Table_RadioBox_K2Node_ComponentBoundEvent_4_OnUnSelectedDelegate__DelegateSignature;

// Function BPUI_RadioBox_CombatAward.BPUI_RadioBox_CombatAward_C.BndEvt__BPUI_RadioBox_Table_W_HTButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BPUI_RadioBox_CombatAward_C_BndEvt__BPUI_RadioBox_Table_W_HTButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPUI_RadioBox_CombatAward_C_BndEvt__BPUI_RadioBox_Table_W_HTButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature;

}

