#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPUI_MainFormFunctionEntry_Mobile

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function BPUI_MainFormFunctionEntry_Mobile.BPUI_MainFormFunctionEntry_Mobile_C.BndEvt__BPUI_MainFormFunctionEntry_Mobile_W_HTButton_CityTycoon_K2Node_ComponentBoundEvent_0_OnUIButtonPressedDelegate__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BPUI_MainFormFunctionEntry_Mobile_C_BndEvt__BPUI_MainFormFunctionEntry_Mobile_W_HTButton_CityTycoon_K2Node_ComponentBoundEvent_0_OnUIButtonPressedDelegate__DelegateSignature final
{
public:
	class UHTUI_Button*                           Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPUI_MainFormFunctionEntry_Mobile_C_BndEvt__BPUI_MainFormFunctionEntry_Mobile_W_HTButton_CityTycoon_K2Node_ComponentBoundEvent_0_OnUIButtonPressedDelegate__DelegateSignature;

// Function BPUI_MainFormFunctionEntry_Mobile.BPUI_MainFormFunctionEntry_Mobile_C.BP_UpdateTriggeringEnhancedInputAction
// 0x0001 (0x0001 - 0x0000)
struct BPUI_MainFormFunctionEntry_Mobile_C_BP_UpdateTriggeringEnhancedInputAction final
{
public:
	bool                                          bRevert;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPUI_MainFormFunctionEntry_Mobile_C_BP_UpdateTriggeringEnhancedInputAction;

// Function BPUI_MainFormFunctionEntry_Mobile.BPUI_MainFormFunctionEntry_Mobile_C.ExecuteUbergraph_BPUI_MainFormFunctionEntry_Mobile
// 0x0050 (0x0050 - 0x0000)
struct BPUI_MainFormFunctionEntry_Mobile_C_ExecuteUbergraph_BPUI_MainFormFunctionEntry_Mobile final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHTUI_Button*                           K2Node_ComponentBoundEvent_Button;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHTPlayerState*                         CallFunc_GetPS_ReturnValue;                        // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FWidgetAnimationHandle                 CallFunc_PlayAnimation_ReturnValue;                // 0x0024(0x0010)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_IsQuestSubmitted_ReturnValue;             // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0036(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37[0x1];                                       // 0x0037(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetEndTime_ReturnValue_1;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FWidgetAnimationHandle                 CallFunc_PlayAnimation_ReturnValue_1;              // 0x003C(0x0010)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          K2Node_Event_bRevert;                              // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPUI_MainFormFunctionEntry_Mobile_C_ExecuteUbergraph_BPUI_MainFormFunctionEntry_Mobile;

// Function BPUI_MainFormFunctionEntry_Mobile.BPUI_MainFormFunctionEntry_Mobile_C.On_W_HTButton_Pather_Load_CanUseSpecialBrush
// 0x0018 (0x0018 - 0x0000)
struct BPUI_MainFormFunctionEntry_Mobile_C_On_W_HTButton_Pather_Load_CanUseSpecialBrush final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHTPatcherUtil*                         CallFunc_GetInstance_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDownloadingOthers_ReturnValue;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPUI_MainFormFunctionEntry_Mobile_C_On_W_HTButton_Pather_Load_CanUseSpecialBrush;

// Function BPUI_MainFormFunctionEntry_Mobile.BPUI_MainFormFunctionEntry_Mobile_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct BPUI_MainFormFunctionEntry_Mobile_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPUI_MainFormFunctionEntry_Mobile_C_PreConstruct;

}

