#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPUI_RadioBox_BPQuest

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function BPUI_RadioBox_BPQuest.BPUI_RadioBox_BPQuest_C.SetBg
// 0x0001 (0x0001 - 0x0000)
struct BPUI_RadioBox_BPQuest_C_SetBg final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPUI_RadioBox_BPQuest_C_SetBg;

// Function BPUI_RadioBox_BPQuest.BPUI_RadioBox_BPQuest_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct BPUI_RadioBox_BPQuest_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPUI_RadioBox_BPQuest_C_PreConstruct;

// Function BPUI_RadioBox_BPQuest.BPUI_RadioBox_BPQuest_C.ExecuteUbergraph_BPUI_RadioBox_BPQuest
// 0x0058 (0x0058 - 0x0000)
struct BPUI_RadioBox_BPQuest_C_ExecuteUbergraph_BPUI_RadioBox_BPQuest final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FWidgetTransform                       K2Node_MakeStruct_WidgetTransform;                 // 0x0008(0x0038)(NoDestructor)
	bool                                          CallFunc_EqualEqual_Vector2DVector2D_ReturnValue;  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPUI_RadioBox_BPQuest_C_ExecuteUbergraph_BPUI_RadioBox_BPQuest;

}

