#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPUI_ChatMiniMsgPanel

#include "Basic.hpp"

#include "HTGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BPUI_ChatMiniMsgPanel.BPUI_ChatMiniMsgPanel_C
// 0x0030 (0x0F40 - 0x0F10)
class UBPUI_ChatMiniMsgPanel_C final : public UHTUI_ChatMiniMsgPanel
{
public:
	class UImage*                                 Image_Preview;                                     // 0x0F10(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBPUI_ChatMsgMini_C*                    BPUI_ChatMsgMini_3;                                // 0x0F18(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBPUI_ChatMsgMini_C*                    BPUI_ChatMsgMini_2;                                // 0x0F20(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBPUI_ChatMsgMini_C*                    BPUI_ChatMsgMini_1;                                // 0x0F28(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBPUI_ChatMsgMini_C*                    BPUI_ChatMsgMini;                                  // 0x0F30(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       OpeneAnim;                                         // 0x0F38(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BPUI_ChatMiniMsgPanel_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BPUI_ChatMiniMsgPanel_C")
	}
	static class UBPUI_ChatMiniMsgPanel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPUI_ChatMiniMsgPanel_C>();
	}
};
DUMPER7_ASSERTS_UBPUI_ChatMiniMsgPanel_C;

}

