#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPUI_RadioBox_Activity

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "HTGame_structs.hpp"
#include "HTGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BPUI_RadioBox_Activity.BPUI_RadioBox_Activity_C
// 0x0050 (0x13E0 - 0x1390)
class UBPUI_RadioBox_Activity_C final : public UHTUI_RadioBox
{
public:
	uint8                                         Pad_1388[0x8];                                     // 0x1388(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1390(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_Select;                                      // 0x1398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHTGamepadTabWidget*                    HTGamepadTabWidget_84;                             // 0x13A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnPressed;                                         // 0x13A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	uint8                                         RadioTextColor;                                    // 0x13B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13B1[0x3];                                     // 0x13B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           颜色和不透明度_Specified_Color;             // 0x13B4(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13C4[0x4];                                     // 0x13C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FStaticGuideWidgetInfo>         In_Guide_Infos;                                    // 0x13C8(0x0010)(Edit, BlueprintVisible)

public:
	void BndEvt__BPUI_RadioBox_Table_HTGamepadTabWidget_84_K2Node_ComponentBoundEvent_0_OnTabAcceptDelegate__DelegateSignature();
	void BndEvt__BPUI_RadioBox_Table_W_HTButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__BPUI_RadionBox_Table_RadioBox_K2Node_ComponentBoundEvent_1_OnSelectedDelegate__DelegateSignature(class UWidget* InWidget);
	void BndEvt__BPUI_RadionBox_Table_RadioBox_K2Node_ComponentBoundEvent_4_OnUnSelectedDelegate__DelegateSignature(class UWidget* InWidget);
	void Construct();
	void ExecuteUbergraph_BPUI_RadioBox_Activity(int32 EntryPoint);
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BPUI_RadioBox_Activity_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BPUI_RadioBox_Activity_C")
	}
	static class UBPUI_RadioBox_Activity_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPUI_RadioBox_Activity_C>();
	}
};
DUMPER7_ASSERTS_UBPUI_RadioBox_Activity_C;

}

