#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPUI_CombatAwardExpInfo

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HTGame_structs.hpp"
#include "HTGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BPUI_CombatAwardExpInfo.BPUI_CombatAwardExpInfo_C
// 0x00A8 (0x0FD0 - 0x0F28)
class UBPUI_CombatAwardExpInfo_C final : public UHTUI_CombatAwardExpInfo
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0F28(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Vx_2;                                              // 0x0F30(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNiagaraSystemWidget*                   N_1;                                               // 0x0F38(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Preview;                                     // 0x0F40(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_hunterlogo_1;                                // 0x0F48(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_130;                                         // 0x0F50(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_70;                                          // 0x0F58(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x0F60(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ABP_NPC_06906_C*                        NPC_06906;                                         // 0x0F68(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	struct FSetViewTargetParam                    Set_View_Target_Param;                             // 0x0F70(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	void SequenceEvent__ENTRYPOINTBPUI_CombatAwardExpInfo();
	void SequenceEvent_1();
	void SequenceEvent_0();
	void SequenceEvent();
	void ExecuteUbergraph_BPUI_CombatAwardExpInfo(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BPUI_CombatAwardExpInfo_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BPUI_CombatAwardExpInfo_C")
	}
	static class UBPUI_CombatAwardExpInfo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPUI_CombatAwardExpInfo_C>();
	}
};
DUMPER7_ASSERTS_UBPUI_CombatAwardExpInfo_C;

}

