#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTTask_PlayWorldSequence

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "AIModule_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BTTask_PlayWorldSequence.BTTask_PlayWorldSequence_C
// 0x00A8 (0x0150 - 0x00A8)
class UBTTask_PlayWorldSequence_C final : public UBTTask_BlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class FName                                   SequenceId;                                        // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B8[0x8];                                       // 0x00B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Origianl_Transform;                                // 0x00C0(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   In_Tag;                                            // 0x0120(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class ULevelSequence>          Level_Sequence;                                    // 0x0128(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BTTask_PlayWorldSequence(int32 EntryPoint);
	void OnSequenceStopped(class ULevelSequence* LevelSequence, const class FName& InMediaID);
	void ReceiveExecuteAI(class AAIController* OwnerController, class APawn* ControlledPawn);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BTTask_PlayWorldSequence_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BTTask_PlayWorldSequence_C")
	}
	static class UBTTask_PlayWorldSequence_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTTask_PlayWorldSequence_C>();
	}
};
DUMPER7_ASSERTS_UBTTask_PlayWorldSequence_C;

}

