#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTTask_IgnoreSkillAttack

#include "Basic.hpp"


namespace SDK::Params
{

// Function BTTask_IgnoreSkillAttack.BTTask_IgnoreSkillAttack_C.ExecuteUbergraph_BTTask_IgnoreSkillAttack
// 0x0028 (0x0028 - 0x0000)
struct BTTask_IgnoreSkillAttack_C_ExecuteUbergraph_BTTask_IgnoreSkillAttack final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHTMonsterController*                   K2Node_DynamicCast_AsHTMonster_Controller;         // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BTTask_IgnoreSkillAttack_C_ExecuteUbergraph_BTTask_IgnoreSkillAttack;

// Function BTTask_IgnoreSkillAttack.BTTask_IgnoreSkillAttack_C.ReceiveExecuteAI
// 0x0010 (0x0010 - 0x0000)
struct BTTask_IgnoreSkillAttack_C_ReceiveExecuteAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BTTask_IgnoreSkillAttack_C_ReceiveExecuteAI;

}

