#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ChameleonBox_B

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ChameleonBox_Base_LV_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass ChameleonBox_B.ChameleonBox_B_C
// 0x0060 (0x0F00 - 0x0EA0)
class AChameleonBox_B_C final : public AChameleonBox_Base_LV_C
{
public:
	uint8                                         Pad_E91[0x7];                                      // 0x0E91(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame_ChameleonBox_B_C;                   // 0x0E98(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCapsuleComponent*                      Capsule;                                           // 0x0EA0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Anomaly_055_skin_Skeleton;                         // 0x0EA8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box_LV;                                            // 0x0EB0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box;                                               // 0x0EB8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_Anomaly_055_002;                                // 0x0EC0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                    Billboard;                                         // 0x0EC8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_Anomaly_055_001;                                // 0x0ED0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          IsBL;                                              // 0x0ED8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsOver;                                            // 0x0ED9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EDA[0x2];                                      // 0x0EDA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Tips;                                              // 0x0EDC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FText>                           In_Msgs_Tips_Formal;                               // 0x0EE0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          BH;                                                // 0x0EF0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__ChameleonBox_A_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void BndEvt__ChameleonBox_A_Box_LV_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void BP_OnOpen();
	void BPOnMainRoleLoadFinished(class AHTPlayerState* PlayerState);
	void ExecuteUbergraph_ChameleonBox_B(int32 EntryPoint);
	void OnBlendOut_410BE5A142FCA7488064A99726245E05(class FName NotifyName);
	void OnBlendOut_7922CF45412B64EDF35730AE4E592270(class FName NotifyName);
	void OnCompleted_410BE5A142FCA7488064A99726245E05(class FName NotifyName);
	void OnCompleted_7922CF45412B64EDF35730AE4E592270(class FName NotifyName);
	void OnEmitterSpawned_CF8A5F3F441812EEF811A2BD25F596D1(class UNiagaraComponent* SpawnedComp);
	void OnInterrupted_410BE5A142FCA7488064A99726245E05(class FName NotifyName);
	void OnInterrupted_7922CF45412B64EDF35730AE4E592270(class FName NotifyName);
	void OnNotifyBegin_410BE5A142FCA7488064A99726245E05(class FName NotifyName);
	void OnNotifyBegin_7922CF45412B64EDF35730AE4E592270(class FName NotifyName);
	void OnNotifyEnd_410BE5A142FCA7488064A99726245E05(class FName NotifyName);
	void OnNotifyEnd_7922CF45412B64EDF35730AE4E592270(class FName NotifyName);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ChameleonBox_B_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ChameleonBox_B_C")
	}
	static class AChameleonBox_B_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AChameleonBox_B_C>();
	}
};
DUMPER7_ASSERTS_AChameleonBox_B_C;

}

