#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ChangeAdd_Speed_Bat056

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function ChangeAdd_Speed_Bat056.ChangeAdd_Speed_Bat056_C.BPTriggerEvent
// 0x0020 (0x0020 - 0x0000)
struct ChangeAdd_Speed_Bat056_C_BPTriggerEvent final
{
public:
	class AHTAbilityCharacter*                    OwnerCharacter;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                TriggerLocation;                                   // 0x0008(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ChangeAdd_Speed_Bat056_C_BPTriggerEvent;

// Function ChangeAdd_Speed_Bat056.ChangeAdd_Speed_Bat056_C.ExecuteUbergraph_ChangeAdd_Speed_Bat056
// 0x0040 (0x0040 - 0x0000)
struct ChangeAdd_Speed_Bat056_C_ExecuteUbergraph_ChangeAdd_Speed_Bat056 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AHTAbilityCharacter*                    K2Node_Event_OwnerCharacter;                       // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_TriggerLocation;                      // 0x0010(0x0018)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHTPlayerCharacter*                     CallFunc_GetClientPlayerCharacter_ReturnValue;     // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayer_056_bat_C*                      K2Node_DynamicCast_AsPlayer_056_Bat;               // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ChangeAdd_Speed_Bat056_C_ExecuteUbergraph_ChangeAdd_Speed_Bat056;

}

