#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EndChange_FairyWheel_camera

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "HTGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass EndChange_FairyWheel_camera.EndChange_FairyWheel_camera_C
// 0x0080 (0x00B8 - 0x0038)
class UEndChange_FairyWheel_camera_C final : public URollerCoasterEvent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0038(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class FName                                   Seq_name;                                          // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NewVar;                                            // 0x0048(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULevelSequence*                         NewVar_0;                                          // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UObject>                 Asset;                                             // 0x0068(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class ABP_FairyWheel_C>        FairyWheel;                                        // 0x0090(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)

public:
	void BPTriggerEvent(class AHTAbilityCharacter* OwnerCharacter, const struct FVector& TriggerLocation);
	void ExecuteUbergraph_EndChange_FairyWheel_camera(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("EndChange_FairyWheel_camera_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EndChange_FairyWheel_camera_C")
	}
	static class UEndChange_FairyWheel_camera_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEndChange_FairyWheel_camera_C>();
	}
};
DUMPER7_ASSERTS_UEndChange_FairyWheel_camera_C;

}

