#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FootIK_AnimLayer_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HTGame_structs.hpp"
#include "HTGame_classes.hpp"
#include "FootIK_AnimLayer_Base_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass FootIK_AnimLayer_Base.FootIK_AnimLayer_Base_C
// 0x25C0 (0x2CE0 - 0x0720)
class UFootIK_AnimLayer_Base_C : public UHTFootIKAnimLayer
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0720(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FootIK_AnimLayer_Base::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;        // 0x0728(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_72C[0x4];                                      // 0x072C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0730(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0738(0x0008)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_10;                    // 0x0740(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_2;                   // 0x0768(0x0050)()
	struct FAnimNode_LegIK                        AnimGraphNode_LegIK_1;                             // 0x07B8(0x0100)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_9;                     // 0x08B8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_8;                     // 0x08E0(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1;                   // 0x0908(0x0050)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_7;                     // 0x0958(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_6;                     // 0x0980(0x0028)()
	struct FHTAnimNode_BlendListByCurve           HTAnimGraphNode_BlendListByCurve;                  // 0x09A8(0x0058)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_5;                     // 0x0A00(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_4;                     // 0x0A28(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x0A50(0x0050)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_6;                    // 0x0AA0(0x0080)()
	struct FHTSkirtControlAnimNode                HTAnimGraphNode_SkirtControl_2;                    // 0x0B20(0x0148)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_3;                     // 0x0C68(0x0028)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_4;             // 0x0C90(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_4;                        // 0x0CB0(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_3;                        // 0x0DD8(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_2;                        // 0x0F00(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x1028(0x0128)()
	struct FHTSkirtControlAnimNode                HTAnimGraphNode_SkirtControl_1;                    // 0x1150(0x0148)()
	uint8                                         Pad_1298[0x8];                                     // 0x1298(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_TwoBoneIK                    AnimGraphNode_TwoBoneIK_1;                         // 0x12A0(0x0280)()
	struct FAnimNode_TwoBoneIK                    AnimGraphNode_TwoBoneIK;                           // 0x1520(0x0280)()
	struct FHTAnimNode_FootPlacement              HTAnimGraphNode_FootPlacement;                     // 0x17A0(0x04D0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_5;                    // 0x1C70(0x0080)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_3;             // 0x1CF0(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_4;             // 0x1D10(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_3;             // 0x1D30(0x0020)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_4;                    // 0x1D50(0x0080)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2;             // 0x1DD0(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0x1DF0(0x0028)()
	struct FAnimNode_LegIK                        AnimGraphNode_LegIK;                               // 0x1E18(0x0100)()
	uint8                                         Pad_1F18[0x8];                                     // 0x1F18(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHTFootIKAnimNode                      HTFootIKGraphNode;                                 // 0x1F20(0x0580)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_3;                    // 0x24A0(0x0080)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_2;                    // 0x2520(0x0080)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x25A0(0x0128)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1;             // 0x26C8(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x26E8(0x0028)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2;             // 0x2710(0x0020)()
	struct FHTSkirtControlAnimNode                HTAnimGraphNode_SkirtControl;                      // 0x2730(0x0148)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1;             // 0x2878(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x2898(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x28B8(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1;                    // 0x28E0(0x0080)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_1;                          // 0x2960(0x00F0)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone;                            // 0x2A50(0x00F0)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x2B40(0x0020)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x2B60(0x0080)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x2BE0(0x00B8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x2C98(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x2CB8(0x0020)()
	int64                                         Current_State_Values_State_Flag_Bits;              // 0x2CD8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void FootIKLayer(const struct FPoseLink& InPose, struct FPoseLink* FootIKLayer_0);
	void ExecuteUbergraph_FootIK_AnimLayer_Base(int32 EntryPoint);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FootIK_AnimLayer_Base_AnimGraphNode_BlendListByBool_CD1DFEFB49DB62E3F346FD8C64DC0CD8();
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("FootIK_AnimLayer_Base_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FootIK_AnimLayer_Base_C")
	}
	static class UFootIK_AnimLayer_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFootIK_AnimLayer_Base_C>();
	}
};
DUMPER7_ASSERTS_UFootIK_AnimLayer_Base_C;

}

