#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_mon_021_Skill01_R_Charge

#include "Basic.hpp"


namespace SDK::Params
{

// Function GA_mon_021_Skill01_R_Charge.GA_mon_021_Skill01_R_Charge_C.ExecuteUbergraph_GA_mon_021_Skill01_R_Charge
// 0x0028 (0x0028 - 0x0000)
struct GA_mon_021_Skill01_R_Charge_C_ExecuteUbergraph_GA_mon_021_Skill01_R_Charge final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue;  // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class Amon_21_BP_C*                           K2Node_DynamicCast_AsMon_21_BP;                    // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_mon_021_Skill01_R_Charge_C_ExecuteUbergraph_GA_mon_021_Skill01_R_Charge;

// Function GA_mon_021_Skill01_R_Charge.GA_mon_021_Skill01_R_Charge_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_mon_021_Skill01_R_Charge_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_mon_021_Skill01_R_Charge_C_K2_OnEndAbility;

}

