#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Glassroom_BreakVines

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HTGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Glassroom_BreakVines.Glassroom_BreakVines_C
// 0x0058 (0x0CE8 - 0x0C90)
class AGlassroom_BreakVines_C final : public AHTBreakableActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0C90(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          Box;                                               // 0x0C98(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_Flower_003_Destroy;                             // 0x0CA0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Vine_17;                                        // 0x0CA8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_NewTrack_0_3F9A9CE242FD0081026E6DA7438BAF01; // 0x0CB0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline__Direction_3F9A9CE242FD0081026E6DA7438BAF01; // 0x0CB4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CB5[0x3];                                      // 0x0CB5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline;                                          // 0x0CB8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class ABP_AutoDoor_ManorGardenHouseB_C> NewVar_0;                                 // 0x0CC0(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)

public:
	void BPOnMainRoleLoadFinished(class AHTPlayerState* PlayerState);
	void DIE();
	void ExecuteUbergraph_Glassroom_BreakVines(int32 EntryPoint);
	void OnEmitterSpawned_69752014482D08A0CB4E41BE832DF836(class UNiagaraComponent* SpawnedComp);
	void OnLoaded_DA01827F4B098AD3672E19A55F9175AE(class UObject* Loaded);
	void Timeline__FinishedFunc();
	void Timeline__UpdateFunc();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Glassroom_BreakVines_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Glassroom_BreakVines_C")
	}
	static class AGlassroom_BreakVines_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGlassroom_BreakVines_C>();
	}
};
DUMPER7_ASSERTS_AGlassroom_BreakVines_C;

}

