#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Glid_Fashion_All_3

#include "Basic.hpp"

#include "GlideBlueprintBase_BP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Glid_Fashion_All_3.Glid_Fashion_All_3_C
// 0x0028 (0x0460 - 0x0438)
class AGlid_Fashion_All_3_C final : public AGlideBlueprintBase_BP_C
{
public:
	class UNiagaraComponent*                      NS_common_glid_Light_010;                          // 0x0438(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_common_glid_erduo1_010;                         // 0x0440(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_common_glid_erduo_010;                          // 0x0448(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_common_glid_weiba1_010;                         // 0x0450(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_common_glid_weiba_010;                          // 0x0458(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Glid_Fashion_All_3_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Glid_Fashion_All_3_C")
	}
	static class AGlid_Fashion_All_3_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGlid_Fashion_All_3_C>();
	}
};
DUMPER7_ASSERTS_AGlid_Fashion_All_3_C;

}

