#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HtNPCInteractAnimLayerBase

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "HtNPCInteractAnimLayerBase_structs.hpp"
#include "ControlRig_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "HTGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass HtNPCInteractAnimLayerBase.HtNPCInteractAnimLayerBase_C
// 0x0CC0 (0x11F0 - 0x0530)
class UHtNPCInteractAnimLayerBase_C : public UHTNPCInteractAnimLayer
{
public:
	struct HtNPCInteractAnimLayerBase::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;   // 0x0530(0x0038)(HasGetValueTypeHash)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0568(0x0008)()
	struct FAnimSubsystemInstance_NodeRelevancy   AnimBlueprintExtension_NodeRelevancy;              // 0x0570(0x00A8)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0618(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root_2;                              // 0x0620(0x0020)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig;                          // 0x0640(0x04B8)(ContainsInstancedReference)
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_1;                   // 0x0AF8(0x00B8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x0BB0(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x0BD0(0x00B8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x0C88(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x0D08(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x0D30(0x0028)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_1;                 // 0x0D58(0x0040)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_2;                   // 0x0D98(0x0050)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_3;                     // 0x0DE8(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1;                   // 0x0E10(0x0050)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator;                   // 0x0E60(0x0040)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x0EA0(0x00E8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0x0F88(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x0FB0(0x0050)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x1000(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x1028(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x1048(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x1070(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x1090(0x00C8)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x1158(0x0020)()
	double                                        __CustomProperty_DistToHandCenter_E2FBB7BC43924223924990BF59753AF8; // 0x1178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             __CustomProperty_HandTargetTransform_E2FBB7BC43924223924990BF59753AF8; // 0x1180(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __CustomProperty_ShouldHandsIK_E2FBB7BC43924223924990BF59753AF8; // 0x11E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11E1[0x7];                                     // 0x11E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        SpecialHoldingHandsBlendTime;                      // 0x11E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void InteractAnimationLayer(const struct FPoseLink& InPose, struct FPoseLink* InteractAnimationLayer_0);
	void InteractIKLayer(const struct FPoseLink& InPose_0, struct FPoseLink* InteractIKLayer_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("HtNPCInteractAnimLayerBase_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HtNPCInteractAnimLayerBase_C")
	}
	static class UHtNPCInteractAnimLayerBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHtNPCInteractAnimLayerBase_C>();
	}
};
DUMPER7_ASSERTS_UHtNPCInteractAnimLayerBase_C;

}

