#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HTVinesAnimLayerBase

#include "Basic.hpp"

#include "HTVinesAnimLayerBase_structs.hpp"
#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "HTGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass HTVinesAnimLayerBase.HTVinesAnimLayerBase_C
// 0x13F0 (0x1AD0 - 0x06E0)
class UHTVinesAnimLayerBase_C : public UHTVinesAnimLayer
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct HTVinesAnimLayerBase::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;         // 0x06E8(0x0044)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_72C[0x4];                                      // 0x072C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0730(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0738(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x0740(0x0020)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1;                    // 0x0760(0x0080)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x07E0(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_44;                 // 0x0860(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_43;                 // 0x0888(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_42;                 // 0x08B0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_41;                 // 0x08D8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_40;                 // 0x0900(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_39;                 // 0x0928(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_38;                 // 0x0950(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_37;                 // 0x0978(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_36;                 // 0x09A0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_35;                 // 0x09C8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_34;                 // 0x09F0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_33;                 // 0x0A18(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_32;                 // 0x0A40(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_31;                 // 0x0A68(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_30;                 // 0x0A90(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_29;                 // 0x0AB8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_28;                 // 0x0AE0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_27;                 // 0x0B08(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_26;                 // 0x0B30(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_25;                 // 0x0B58(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_24;                 // 0x0B80(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_23;                 // 0x0BA8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_22;                 // 0x0BD0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_21;                 // 0x0BF8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_20;                 // 0x0C20(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_19;                 // 0x0C48(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_18;                 // 0x0C70(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_17;                 // 0x0C98(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_16;                 // 0x0CC0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_15;                 // 0x0CE8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_14;                 // 0x0D10(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_5;                    // 0x0D38(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_17;                      // 0x0D80(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4;                    // 0x0DA0(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x0DE8(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x0E30(0x0050)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_16;                      // 0x0E80(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x0EA0(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_15;                      // 0x0EE8(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x0F08(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_14;                      // 0x0F50(0x0020)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_13;                      // 0x0F70(0x0020)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_9;                  // 0x0F90(0x0070)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_12;                      // 0x1000(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x1020(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_11;                      // 0x1068(0x0020)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_8;                  // 0x1088(0x0070)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_10;                      // 0x10F8(0x0020)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_7;                  // 0x1118(0x0070)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_9;                       // 0x1188(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_13;                 // 0x11A8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x11D0(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_8;                       // 0x11F8(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x1218(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_7;                       // 0x1240(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_2;                      // 0x1260(0x00C8)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_6;                  // 0x1328(0x0070)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_6;                       // 0x1398(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_1;                      // 0x13B8(0x00C8)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_12;                 // 0x1480(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_11;                 // 0x14A8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_10;                 // 0x14D0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_9;                  // 0x14F8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_8;                  // 0x1520(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_7;                  // 0x1548(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6;                  // 0x1570(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5;                  // 0x1598(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4;                  // 0x15C0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x15E8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x1610(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x1638(0x0028)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_5;                  // 0x1660(0x0070)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_5;                       // 0x16D0(0x0020)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_4;                  // 0x16F0(0x0070)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_4;                       // 0x1760(0x0020)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_3;                  // 0x1780(0x0070)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0x17F0(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x1810(0x0028)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_2;                  // 0x1838(0x0070)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x18A8(0x0020)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_1;                  // 0x18C8(0x0070)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x1938(0x0020)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer;                    // 0x1958(0x0070)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x19C8(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x19E8(0x00C8)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x1AB0(0x0020)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_HTVinesAnimLayerBase_AnimGraphNode_TransitionResult_1ABD57524DC5A6882A4C8D91F22DA11E();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_HTVinesAnimLayerBase_AnimGraphNode_TransitionResult_1EFB3423436019A3D156C2BB57CF5A8E();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_HTVinesAnimLayerBase_AnimGraphNode_TransitionResult_26B1FFE843DFFFD71B2C6192C76425D1();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_HTVinesAnimLayerBase_AnimGraphNode_TransitionResult_2FDF76174F5727F5AF6C87B7DF268683();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_HTVinesAnimLayerBase_AnimGraphNode_TransitionResult_32F8A4FB48D2C7B97DD786B8D0ADA101();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_HTVinesAnimLayerBase_AnimGraphNode_TransitionResult_36588D394CB2523CCF0C60AB9AADB51D();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_HTVinesAnimLayerBase_AnimGraphNode_TransitionResult_3C208EC34167B1CCA132BCB1C6ECE876();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_HTVinesAnimLayerBase_AnimGraphNode_TransitionResult_3E7C46994007BBB4C58067B9D96698F9();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_HTVinesAnimLayerBase_AnimGraphNode_TransitionResult_447F9F184283F05F8F825C8C96C62112();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_HTVinesAnimLayerBase_AnimGraphNode_TransitionResult_571C5B7F4D5DBE12987A1292C998B856();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_HTVinesAnimLayerBase_AnimGraphNode_TransitionResult_5A8D6C8540F647B0703082850586E96A();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_HTVinesAnimLayerBase_AnimGraphNode_TransitionResult_5B6B08B54A9F8F1FE5B01B91D4107885();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_HTVinesAnimLayerBase_AnimGraphNode_TransitionResult_62151195406EEE0A6045C6BA6B4E80CA();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_HTVinesAnimLayerBase_AnimGraphNode_TransitionResult_695AC61C4E01069D6EEF64AC96398A63();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_HTVinesAnimLayerBase_AnimGraphNode_TransitionResult_6C0216384ECBDFDC7182C4818E822067();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_HTVinesAnimLayerBase_AnimGraphNode_TransitionResult_6C4F916A4055B7B17F7E5B930D643AC3();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_HTVinesAnimLayerBase_AnimGraphNode_TransitionResult_6CC2E755424A992430626A8EA4842196();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_HTVinesAnimLayerBase_AnimGraphNode_TransitionResult_757247E94A2E538BBDF1CFA81EF2C11B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_HTVinesAnimLayerBase_AnimGraphNode_TransitionResult_7E16B0B3406B5C8BA02B9396E495BDCF();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_HTVinesAnimLayerBase_AnimGraphNode_TransitionResult_824403734E9BF44195565C80CEFFEDC7();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_HTVinesAnimLayerBase_AnimGraphNode_TransitionResult_8D38E5F34BCFDF59B4C17AB5D1E2F26D();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_HTVinesAnimLayerBase_AnimGraphNode_TransitionResult_9870BAFD4D278AF770F6EFA6170BE9F7();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_HTVinesAnimLayerBase_AnimGraphNode_TransitionResult_A5B9A3314C9EF85C9FABF88E097FAE07();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_HTVinesAnimLayerBase_AnimGraphNode_TransitionResult_A5F33C8B4DB7FBC6353A29ADC4D60DBE();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_HTVinesAnimLayerBase_AnimGraphNode_TransitionResult_A6A99F7F4AE5B5359E8673900D955686();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_HTVinesAnimLayerBase_AnimGraphNode_TransitionResult_A6C94F57441C67AA13E45BA768A7CC97();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_HTVinesAnimLayerBase_AnimGraphNode_TransitionResult_A90C470D4A1BFAC64F1B64BCF039B3CD();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_HTVinesAnimLayerBase_AnimGraphNode_TransitionResult_AD8721434479FA3D87D9D18F259DC473();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_HTVinesAnimLayerBase_AnimGraphNode_TransitionResult_CDCF7461411BD41DF33A33ABD0D61F00();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_HTVinesAnimLayerBase_AnimGraphNode_TransitionResult_D6DABAC141FA2C680A4151B1E0DFD628();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_HTVinesAnimLayerBase_AnimGraphNode_TransitionResult_E2ED7B6C402DB44FB48D8685A49EF9F1();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_HTVinesAnimLayerBase_AnimGraphNode_TransitionResult_E7EF7AC74E8BF5E25CF0398301ED73F5();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_HTVinesAnimLayerBase_AnimGraphNode_TransitionResult_F23B99D345245B33E546C299D78B6CD7();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_HTVinesAnimLayerBase_AnimGraphNode_TransitionResult_F636D54E4D5B7023D765A9B29B797772();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_HTVinesAnimLayerBase_AnimGraphNode_TransitionResult_F71C4E48409277637BD5B68C5C4F2554();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_HTVinesAnimLayerBase_AnimGraphNode_TransitionResult_F8DC82314A5CA22B7594FA915D21E11A();
	void ExecuteUbergraph_HTVinesAnimLayerBase(int32 EntryPoint);
	void VinesAnimLayer(struct FPoseLink* VinesAnimLayer_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("HTVinesAnimLayerBase_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HTVinesAnimLayerBase_C")
	}
	static class UHTVinesAnimLayerBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHTVinesAnimLayerBase_C>();
	}
};
DUMPER7_ASSERTS_UHTVinesAnimLayerBase_C;

}

