#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: K111406QTB_Blueprint

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HTGame_structs.hpp"
#include "HTGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass K111406QTB_Blueprint.K111406QTB_Blueprint_C
// 0x0060 (0x0518 - 0x04B8)
class AK111406QTB_Blueprint_C final : public AHTQuestTriggerBox
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class FName                                   Quest_ID;                                          // 0x04C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Object_ID;                                         // 0x04C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACameraActor*                           Camera01;                                          // 0x04D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class ACameraActor*                           Camera02;                                          // 0x04D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class ACameraActor*                           Camera04;                                          // 0x04E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class ACameraActor*                           Camera03;                                          // 0x04E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	TArray<class FText>                           MainQuestTips;                                     // 0x04F0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FDebugVoiceMsg>                 SideQuestTips;                                     // 0x0500(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	double                                        BlackScreenTime;                                   // 0x0510(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__S110905QTB_Blueprint_CollisionComponent_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void ExecuteUbergraph_K111406QTB_Blueprint(int32 EntryPoint);
	void ReceiveActorBeginOverlap(class AActor* OtherActor);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("K111406QTB_Blueprint_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"K111406QTB_Blueprint_C")
	}
	static class AK111406QTB_Blueprint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AK111406QTB_Blueprint_C>();
	}
};
DUMPER7_ASSERTS_AK111406QTB_Blueprint_C;

}

