#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: L110041_BOOM

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HTGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass L110041_BOOM.L110041_BOOM_C
// 0x0028 (0x0CB8 - 0x0C90)
class AL110041_BOOM_C final : public AHTBreakableActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0C90(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USkeletalMeshComponent*                 SM_Lanternflower_ZYF_skin;                         // 0x0C98(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        Return_Value_Location_Z;                           // 0x0CA0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Spawned_Comp;                                      // 0x0CA8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AGlassroom_BreakVines_C*                NewVar;                                            // 0x0CB0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)

public:
	void BPOnMainRoleLoadFinished(class AHTPlayerState* PlayerState);
	void DAMA();
	void ExecuteUbergraph_L110041_BOOM(int32 EntryPoint);
	void OnEmitterSpawned_95FD4B00414DC4F301B70E8D98CCDA51(class UNiagaraComponent* SpawnedComp);
	void ReceiveOnTakeDamage(class AActor* DamageCauser, const struct FHitResult& HitResult, bool bRealDamaged);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("L110041_BOOM_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"L110041_BOOM_C")
	}
	static class AL110041_BOOM_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AL110041_BOOM_C>();
	}
};
DUMPER7_ASSERTS_AL110041_BOOM_C;

}

