#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainLogic_AHQ_L

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HTGame_structs.hpp"
#include "HTGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass MainLogic_AHQ_L.MainLogic_AHQ_L_C
// 0x0110 (0x0C90 - 0x0B80)
class AMainLogic_AHQ_L_C final : public AHTVisualActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B80(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBillboardComponent*                    Billboard;                                         // 0x0B88(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ATomato_a_C*                            TOMATO;                                            // 0x0B90(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	TArray<class FText>                           L110104;                                           // 0x0B98(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class FText>                           L110106;                                           // 0x0BA8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<int32, class AHTAICharacter*>            Target_Npc_Map;                                    // 0x0BB8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FNPCMultiMsgID>                 Msg_Arr;                                           // 0x0C08(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TSoftObjectPtr<class AHTCineCameraActor>      L110104_HCC_1;                                     // 0x0C18(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class AHTCineCameraActor>      L110104_HCC_2;                                     // 0x0C40(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	class ARollerCoasterActor*                    Roller_Coaster;                                    // 0x0C68(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class AHTAISpawnManager*                      BOSS_AHQ;                                          // 0x0C70(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class AHTWheeledVehicleDrivable*              As_HTWheeled_Vehicle_Drivable;                     // 0x0C78(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ABP_ChaseSpawnManger_C*                 New_BOSS_AHQ;                                      // 0x0C80(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class FName                                   Description_ID;                                    // 0x0C88(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BPOnMainRoleLoadFinished(class AHTPlayerState* PlayerState);
	void Completed_28A6E4D94A8879CA0CCFA5BBF29AB3D7(class UCommonActivatableWidget* WidgetObject);
	void ExecuteUbergraph_MainLogic_AHQ_L(int32 EntryPoint);
	void QuestobjComplete(const class FName& QuestId, const class FName& QuestObjectID, class AHTPlayerState* thePlayer);
	void SET_VIEW(class AActor* NewViewTarget, const struct FSetViewTargetParam& SetViewTargetParam);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("MainLogic_AHQ_L_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MainLogic_AHQ_L_C")
	}
	static class AMainLogic_AHQ_L_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMainLogic_AHQ_L_C>();
	}
};
DUMPER7_ASSERTS_AMainLogic_AHQ_L_C;

}

