#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MassCrowdAccessory_AnimLayer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "MassCrowdAccessory_AnimLayer_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "HTGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass MassCrowdAccessory_AnimLayer.MassCrowdAccessory_AnimLayer_C
// 0x07F0 (0x0D50 - 0x0560)
class UMassCrowdAccessory_AnimLayer_C : public UHTMassCrowdAccessoryAnimLayer
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0560(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct MassCrowdAccessory_AnimLayer::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables; // 0x0568(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0578(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0580(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x0588(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x05A8(0x00B8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x0660(0x0050)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0x06B0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6;                  // 0x06D8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5;                  // 0x0700(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x0728(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0x0750(0x0020)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve;                         // 0x0770(0x0120)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x0890(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x08B8(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_1;                      // 0x08D8(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1;                    // 0x09A0(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4;                  // 0x0A20(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x0A48(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x0A70(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x0A98(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x0AC0(0x0028)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer;                    // 0x0AE8(0x0070)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x0B58(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0B78(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x0BC0(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x0BE0(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x0CA8(0x0080)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0D28(0x0020)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void AnimNotify_RandomLeisureClear();
	void AnimNotify_RandomLeisureStart();
	void ExecuteUbergraph_MassCrowdAccessory_AnimLayer(int32 EntryPoint);
	void Overlay(const struct FPoseLink& InPose, struct FPoseLink* Overlay_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("MassCrowdAccessory_AnimLayer_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MassCrowdAccessory_AnimLayer_C")
	}
	static class UMassCrowdAccessory_AnimLayer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassCrowdAccessory_AnimLayer_C>();
	}
};
DUMPER7_ASSERTS_UMassCrowdAccessory_AnimLayer_C;

}

