#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MassCrowdAccessory_AnimLayer

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function MassCrowdAccessory_AnimLayer.MassCrowdAccessory_AnimLayer_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct MassCrowdAccessory_AnimLayer_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_MassCrowdAccessory_AnimLayer_C_AnimGraph;

// Function MassCrowdAccessory_AnimLayer.MassCrowdAccessory_AnimLayer_C.ExecuteUbergraph_MassCrowdAccessory_AnimLayer
// 0x0018 (0x0018 - 0x0000)
struct MassCrowdAccessory_AnimLayer_C_ExecuteUbergraph_MassCrowdAccessory_AnimLayer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCrowdCharacterAnimInstance*            CallFunc_GetParent_ReturnValue;                    // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_MassCrowdAccessory_AnimLayer_C_ExecuteUbergraph_MassCrowdAccessory_AnimLayer;

// Function MassCrowdAccessory_AnimLayer.MassCrowdAccessory_AnimLayer_C.Overlay
// 0x0020 (0x0020 - 0x0000)
struct MassCrowdAccessory_AnimLayer_C_Overlay final
{
public:
	struct FPoseLink                              InPose;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Overlay_0;                                         // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_MassCrowdAccessory_AnimLayer_C_Overlay;

}

