#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: mon_Trigger_CrowdShoot

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HTGame_structs.hpp"
#include "HTGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass mon_Trigger_CrowdShoot.mon_Trigger_CrowdShoot_C
// 0x01D0 (0x2F00 - 0x2D30)
class Amon_Trigger_CrowdShoot_C final : public AHTCrowdAgentCharacter
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x2D30(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHTGlobalSnowInteractorComponent*       HTGlobalSnowInteractor;                            // 0x2D38(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHTThreatenComponent*                   HTThreaten;                                        // 0x2D40(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHTDialogueComponent*                   HTDialogue;                                        // 0x2D48(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       GreetTriggerSphere;                                // 0x2D50(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       Dlg_Sphere;                                        // 0x2D58(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       Sphere;                                            // 0x2D60(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPBubbleComponent_C*                   BPBubbleComponent;                                 // 0x2D68(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FInteractEntry                         Surrender;                                         // 0x2D70(0x0168)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	int32                                         Interact_Index;                                    // 0x2ED8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2EDC[0x4];                                     // 0x2EDC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Bullet_Num;                                        // 0x2EE0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Bullet;                                            // 0x2EE8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CD;                                                // 0x2EF0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__Bp_ActiveBasketball_HTDialogue_K2Node_ComponentBoundEvent_0_OnDialogueEventDelegate__DelegateSignature(class FName InParticipant, class FName InEventName);
	void BP_OnEnterSurrenderState();
	void BP_OnExitSurrenderState();
	void BPGetInteractEntries(class AHTPlayerController* ByPC, TArray<struct FInteractEntry>* OutInteractEntries);
	void BPInteractFinished(class AHTPlayerController* ByPC, int32 InteractIndex);
	void BPUsingSkill();
	void CheckBulletNum();
	void ExecuteUbergraph_mon_Trigger_CrowdShoot(int32 EntryPoint);
	void Init_Bullet();
	void OnBeginBattle();
	void ReceiveTick(float DeltaSeconds);
	void Reload();
	void Shoot();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("mon_Trigger_CrowdShoot_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"mon_Trigger_CrowdShoot_C")
	}
	static class Amon_Trigger_CrowdShoot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<Amon_Trigger_CrowdShoot_C>();
	}
};
DUMPER7_ASSERTS_Amon_Trigger_CrowdShoot_C;

}

