#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: mon_18_BP_World_Passive_New_Black

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "MonsterCharacterBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass mon_18_BP_World_Passive_New_Black.mon_18_BP_World_Passive_New_Black_C
// 0x0090 (0x2AC0 - 0x2A30)
class Amon_18_BP_World_Passive_New_Black_C final : public AMonsterCharacterBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_mon_18_BP_World_Passive_New_Black_C; // 0x2A28(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USphereComponent*                       Sphere;                                            // 0x2A30(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box;                                               // 0x2A38(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          NewVar;                                            // 0x2A40(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A41[0x3];                                     // 0x2A41(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         New_Percentage;                                    // 0x2A44(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   AIClass;                                           // 0x2A48(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   AIClass_0;                                         // 0x2A70(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CanSummon;                                         // 0x2A98(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A99[0x7];                                     // 0x2A99(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        TransHealthPercentage;                             // 0x2AA0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        TurnRedPercentage;                                 // 0x2AA8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsTurnRed;                                         // 0x2AB0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ReceiveBeginPlay();
	void OnNotifyEnd_E391B2DD4C6A6F0CB9BC4CB5A1C7F1A0(class FName NotifyName);
	void OnNotifyBegin_E391B2DD4C6A6F0CB9BC4CB5A1C7F1A0(class FName NotifyName);
	void OnInterrupted_E391B2DD4C6A6F0CB9BC4CB5A1C7F1A0(class FName NotifyName);
	void OnCompleted_E391B2DD4C6A6F0CB9BC4CB5A1C7F1A0(class FName NotifyName);
	void OnBlendOut_E391B2DD4C6A6F0CB9BC4CB5A1C7F1A0(class FName NotifyName);
	void ExecuteUbergraph_mon_18_BP_World_Passive_New_Black(int32 EntryPoint);
	void ChangeHp(float OldValue, float NewValue);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("mon_18_BP_World_Passive_New_Black_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"mon_18_BP_World_Passive_New_Black_C")
	}
	static class Amon_18_BP_World_Passive_New_Black_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<Amon_18_BP_World_Passive_New_Black_C>();
	}
};
DUMPER7_ASSERTS_Amon_18_BP_World_Passive_New_Black_C;

}

