#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: mon_025_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "MonsterCharacterBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass mon_025_BP.mon_025_BP_C
// 0x0170 (0x2BA0 - 0x2A30)
class Amon_025_BP_C final : public AMonsterCharacterBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_mon_025_BP_C;                       // 0x2A28(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          Box1;                                              // 0x2A30(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box;                                               // 0x2A38(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHTNiagaraComponent*                    HTNiagara;                                         // 0x2A40(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCapsuleComponent*                      Capsule;                                           // 0x2A48(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         ____11_NewTrack_0_0E4D9C104A7166EA86B5CF86EB9096B9; // 0x2A50(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            ____11__Direction_0E4D9C104A7166EA86B5CF86EB9096B9; // 0x2A54(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A55[0x3];                                     // 0x2A55(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     时间轴_11;                                      // 0x2A58(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         ____10______0_569D1C8343A7294F19AEEF9BE215BEA4;    // 0x2A60(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            ____10__Direction_569D1C8343A7294F19AEEF9BE215BEA4; // 0x2A64(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A65[0x3];                                     // 0x2A65(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     时间轴_10;                                      // 0x2A68(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         ____9_NewTrack_0_29ADE26D4C16B64F960A36B4D0735BFA; // 0x2A70(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            ____9__Direction_29ADE26D4C16B64F960A36B4D0735BFA; // 0x2A74(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A75[0x3];                                     // 0x2A75(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     时间轴_9;                                       // 0x2A78(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         ____8_NewTrack_0_1004844B4C6F890F4354238276F396B4; // 0x2A80(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            ____8__Direction_1004844B4C6F890F4354238276F396B4; // 0x2A84(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A85[0x3];                                     // 0x2A85(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     时间轴_8;                                       // 0x2A88(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         ____7_NewTrack_0_A9CA260A437C3E724B39ED96D506C27B; // 0x2A90(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            ____7__Direction_A9CA260A437C3E724B39ED96D506C27B; // 0x2A94(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A95[0x3];                                     // 0x2A95(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     时间轴_7;                                       // 0x2A98(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         ____6_NewTrack_0_5F6C01534229110371160D8BB1E9DA15; // 0x2AA0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            ____6__Direction_5F6C01534229110371160D8BB1E9DA15; // 0x2AA4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2AA5[0x3];                                     // 0x2AA5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     时间轴_6;                                       // 0x2AA8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         ____5_NewTrack_0_5E4F5AF54E52D1E72AE6F692B1CD0D8A; // 0x2AB0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            ____5__Direction_5E4F5AF54E52D1E72AE6F692B1CD0D8A; // 0x2AB4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2AB5[0x3];                                     // 0x2AB5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     时间轴_5;                                       // 0x2AB8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         ____4_NewTrack_0_01E84CA54B3B456798B8BFA2B872E37F; // 0x2AC0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            ____4__Direction_01E84CA54B3B456798B8BFA2B872E37F; // 0x2AC4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2AC5[0x3];                                     // 0x2AC5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     时间轴_4;                                       // 0x2AC8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         ____3_NewTrack_0_CEB1AA534622B4AAF24086AEA09EFF0A; // 0x2AD0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            ____3__Direction_CEB1AA534622B4AAF24086AEA09EFF0A; // 0x2AD4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2AD5[0x3];                                     // 0x2AD5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     时间轴_3;                                       // 0x2AD8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         ____2_NewTrack_0_9E094FC944608745B53A37B07FACE7EA; // 0x2AE0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            ____2__Direction_9E094FC944608745B53A37B07FACE7EA; // 0x2AE4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2AE5[0x3];                                     // 0x2AE5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     时间轴_2;                                       // 0x2AE8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         ____1_NewTrack_0_5AD1E1B041E2FE724B8C78A82683A5F2; // 0x2AF0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            ____1__Direction_5AD1E1B041E2FE724B8C78A82683A5F2; // 0x2AF4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2AF5[0x3];                                     // 0x2AF5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     时间轴_1;                                       // 0x2AF8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         ____0_NewTrack_0_3B465B96406BB531447CF8B8750CA0DD; // 0x2B00(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            ____0__Direction_3B465B96406BB531447CF8B8750CA0DD; // 0x2B04(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B05[0x3];                                     // 0x2B05(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     时间轴_0;                                       // 0x2B08(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         ____NewTrack_0_EC8816024E54C118F178B3B0C62DC541;   // 0x2B10(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            _____Direction_EC8816024E54C118F178B3B0C62DC541;   // 0x2B14(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B15[0x3];                                     // 0x2B15(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     时间轴; // 0x2B18(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Friend;                                            // 0x2B20(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Act06_1_LOC;                                       // 0x2B28(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Act06_1_ROT;                                       // 0x2B40(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FVector                                NewLoc;                                            // 0x2B58(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Spawn_LOC;                                         // 0x2B70(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      Friend_pawn;                                       // 0x2B88(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          HideBody;                                          // 0x2B98(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Act06_2_Loc();
	void BPOnAICharacterDead();
	void dead_hide();
	void EndInto();
	void ExecuteUbergraph_mon_025_BP(int32 EntryPoint);
	void hide_body();
	void NewFunction(struct FVector* NewParam, struct FRotator* NewRot);
	void OnBeginBattle();
	void open_body();
	void ReceiveBeginPlay();
	void ResetBattle();
	void RestCOL();
	void Set_act06_2_loc();
	void Together_Act06_1();
	void 时间轴_0__FinishedFunc();
	void 时间轴_0__UpdateFunc();
	void 时间轴_10__FinishedFunc();
	void 时间轴_10__UpdateFunc();
	void 时间轴_11__FinishedFunc();
	void 时间轴_11__UpdateFunc();
	void 时间轴_1__FinishedFunc();
	void 时间轴_1__UpdateFunc();
	void 时间轴_2__FinishedFunc();
	void 时间轴_2__UpdateFunc();
	void 时间轴_3__FinishedFunc();
	void 时间轴_3__UpdateFunc();
	void 时间轴_4__FinishedFunc();
	void 时间轴_4__UpdateFunc();
	void 时间轴_5__FinishedFunc();
	void 时间轴_5__UpdateFunc();
	void 时间轴_6__FinishedFunc();
	void 时间轴_6__UpdateFunc();
	void 时间轴_7__FinishedFunc();
	void 时间轴_7__UpdateFunc();
	void 时间轴_8__FinishedFunc();
	void 时间轴_8__UpdateFunc();
	void 时间轴_9__FinishedFunc();
	void 时间轴_9__UpdateFunc();
	void 时间轴__FinishedFunc();
	void 时间轴__UpdateFunc();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("mon_025_BP_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"mon_025_BP_C")
	}
	static class Amon_025_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<Amon_025_BP_C>();
	}
};
DUMPER7_ASSERTS_Amon_025_BP_C;

}

