#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: mon_13_summon_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "MonsterCharacterBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass mon_13_summon_BP.mon_13_summon_BP_C
// 0x0040 (0x2A70 - 0x2A30)
class Amon_13_summon_BP_C : public AMonsterCharacterBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_mon_13_summon_BP_C;                 // 0x2A28(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCapsuleComponent*                      Capsule;                                           // 0x2A30(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Dead_1_1______0_46F75FBB4B64E8469327A6B9C13B622A;  // 0x2A38(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Dead_1_1__Direction_46F75FBB4B64E8469327A6B9C13B622A; // 0x2A3C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A3D[0x3];                                     // 0x2A3D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Dead_1_1;                                          // 0x2A40(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Master;                                            // 0x2A48(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               Body01;                                            // 0x2A50(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               Body02;                                            // 0x2A58(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               Body03_111;                                        // 0x2A60(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          Dead_into;                                         // 0x2A68(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BPOnAICharacterDead();
	void Dead_1_1__FinishedFunc();
	void Dead_1_1__UpdateFunc();
	void Dead_Alpha();
	void ExecuteUbergraph_mon_13_summon_BP(int32 EntryPoint);
	void ReceiveBeginPlay();
	void SetSkill6_1();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("mon_13_summon_BP_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"mon_13_summon_BP_C")
	}
	static class Amon_13_summon_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<Amon_13_summon_BP_C>();
	}
};
DUMPER7_ASSERTS_Amon_13_summon_BP_C;

}

