#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: mon_13_1_BP_Child

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "mon_13_BP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass mon_13_1_BP_Child.mon_13_1_BP_Child_C
// 0x0110 (0x2B90 - 0x2A80)
class Amon_13_1_BP_Child_C final : public Amon_13_BP_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_mon_13_1_BP_Child_C;                // 0x2A80(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         EndBattle_timeline_NewTrack_0_E5FB781A4E93E77AFE7B6496A54755B4; // 0x2A88(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            EndBattle_timeline__Direction_E5FB781A4E93E77AFE7B6496A54755B4; // 0x2A8C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A8D[0x3];                                     // 0x2A8D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     EndBattle_timeline;                                // 0x2A90(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         _________0_AE0283BC4A29100B2A949BA705443480;       // 0x2A98(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            _____Direction_AE0283BC4A29100B2A949BA705443480;   // 0x2A9C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A9D[0x3];                                     // 0x2A9D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     时间轴; // 0x2AA0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         ____6_NewTrack_0_86F39BC2460924B983FF39A52E3B0B0E; // 0x2AA8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            ____6__Direction_86F39BC2460924B983FF39A52E3B0B0E; // 0x2AAC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2AAD[0x3];                                     // 0x2AAD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     时间轴_6;                                       // 0x2AB0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         ____5_NewTrack_0_5AD81B584FF6FDE4B345A6903F88634E; // 0x2AB8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            ____5__Direction_5AD81B584FF6FDE4B345A6903F88634E; // 0x2ABC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2ABD[0x3];                                     // 0x2ABD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     时间轴_5;                                       // 0x2AC0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         ____4_NewTrack_0_1D9B01FD4C61A0AF49A1E5AA56922FDA; // 0x2AC8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            ____4__Direction_1D9B01FD4C61A0AF49A1E5AA56922FDA; // 0x2ACC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2ACD[0x3];                                     // 0x2ACD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     时间轴_4;                                       // 0x2AD0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         ____0______0_09392D464709EED2D4263F92CD10F240;     // 0x2AD8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            ____0__Direction_09392D464709EED2D4263F92CD10F240; // 0x2ADC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2ADD[0x3];                                     // 0x2ADD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     时间轴_0;                                       // 0x2AE0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         ____1______0_AD015FEE40C2689DE62232BE043DC72E;     // 0x2AE8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            ____1__Direction_AD015FEE40C2689DE62232BE043DC72E; // 0x2AEC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2AED[0x3];                                     // 0x2AED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     时间轴_1;                                       // 0x2AF0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Summon_Isdead;                                     // 0x2AF8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2AF9[0x7];                                     // 0x2AF9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHTAICharacter*                         Summon;                                            // 0x2B00(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          Firstinto;                                         // 0x2B08(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B09[0x7];                                     // 0x2B09(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftClassPtr<class UClass>                   Summon_class;                                      // 0x2B10(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash)
	class UNiagaraComponent*                      NewVar;                                            // 0x2B38(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NewVar_0;                                          // 0x2B40(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(class Amon_13_1_BP_Child_C* NewParam)> Endbattle;                  // 0x2B48(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(class Amon_13_1_BP_Child_C* NewParam)> Start_Summon;               // 0x2B58(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UNiagaraComponent*                      NewVar_1;                                          // 0x2B68(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NewVar_2;                                          // 0x2B70(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NewVar_3;                                          // 0x2B78(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NewVar_4;                                          // 0x2B80(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Is_Fig;                                            // 0x2B88(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Act02_Check();
	void AddSummon();
	void bodyhide();
	void BPOnAICharacterDead();
	void BPOnLeaveBattleBegin();
	void BPOnLeaveBattleEnd();
	void EndBattle_timeline__FinishedFunc();
	void EndBattle_timeline__UpdateFunc();
	void ExecuteUbergraph_mon_13_1_BP_Child(int32 EntryPoint);
	void OnBeginBattle();
	void ReceiveBeginPlay();
	void SetSkill3();
	void SetSkill6();
	void SetSkill6_1();
	void Setskill6_LOC();
	void Skill3_cut();
	void Skill3_hit();
	void Summon_loc(struct FVector* Loc);
	void 时间轴_0__FinishedFunc();
	void 时间轴_0__UpdateFunc();
	void 时间轴_1__FinishedFunc();
	void 时间轴_1__UpdateFunc();
	void 时间轴_4__FinishedFunc();
	void 时间轴_4__UpdateFunc();
	void 时间轴_5__FinishedFunc();
	void 时间轴_5__UpdateFunc();
	void 时间轴_6__FinishedFunc();
	void 时间轴_6__UpdateFunc();
	void 时间轴__FinishedFunc();
	void 时间轴__UpdateFunc();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("mon_13_1_BP_Child_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"mon_13_1_BP_Child_C")
	}
	static class Amon_13_1_BP_Child_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<Amon_13_1_BP_Child_C>();
	}
};
DUMPER7_ASSERTS_Amon_13_1_BP_Child_C;

}

