#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: mon_13_2_summon_BP_Child

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "mon_13_summon_BP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass mon_13_2_summon_BP_Child.mon_13_2_summon_BP_Child_C
// 0x0020 (0x2A90 - 0x2A70)
class Amon_13_2_summon_BP_Child_C final : public Amon_13_summon_BP_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_mon_13_2_summon_BP_Child_C;         // 0x2A70(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         timeline_8______0_52163F7F430C13CC66D1AB8BC025B891; // 0x2A78(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            timeline_8__Direction_52163F7F430C13CC66D1AB8BC025B891; // 0x2A7C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A7D[0x3];                                     // 0x2A7D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_8;                                        // 0x2A80(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 New_Var;                                           // 0x2A88(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_mon_13_2_summon_BP_Child(int32 EntryPoint);
	void ReceiveBeginPlay();
	void SetSkill6_2_loc();
	void SetSkill6_2FX();
	void timeline_8__FinishedFunc();
	void timeline_8__UpdateFunc();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("mon_13_2_summon_BP_Child_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"mon_13_2_summon_BP_Child_C")
	}
	static class Amon_13_2_summon_BP_Child_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<Amon_13_2_summon_BP_Child_C>();
	}
};
DUMPER7_ASSERTS_Amon_13_2_summon_BP_Child_C;

}

