#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: mon_13_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "MonsterCharacterBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass mon_13_BP.mon_13_BP_C
// 0x0050 (0x2A80 - 0x2A30)
class Amon_13_BP_C : public AMonsterCharacterBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_mon_13_BP_C;                        // 0x2A28(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          act03;                                             // 0x2A30(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCapsuleComponent*                      Capsule;                                           // 0x2A38(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              CutSkill3;                                         // 0x2A40(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              HitSkill3;                                         // 0x2A50(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              BattleInto;                                        // 0x2A60(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              BattleEnd;                                         // 0x2A70(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ReceiveBeginPlay();
	void ExecuteUbergraph_mon_13_BP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("mon_13_BP_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"mon_13_BP_C")
	}
	static class Amon_13_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<Amon_13_BP_C>();
	}
};
DUMPER7_ASSERTS_Amon_13_BP_C;

}

