#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: mon_13_2_BP_Child

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "mon_13_BP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass mon_13_2_BP_Child.mon_13_2_BP_Child_C
// 0x0090 (0x2B10 - 0x2A80)
class Amon_13_2_BP_Child_C final : public Amon_13_BP_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_mon_13_2_BP_Child_C;                // 0x2A80(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         ____0_NewTrack_0_992084A648ACB6D10EF4259FFA56B37E; // 0x2A88(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            ____0__Direction_992084A648ACB6D10EF4259FFA56B37E; // 0x2A8C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A8D[0x3];                                     // 0x2A8D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     时间轴_0;                                       // 0x2A90(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         _________0_EB6A5A2E4015E9BBFF8D4BAEDCF8DF94;       // 0x2A98(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            _____Direction_EB6A5A2E4015E9BBFF8D4BAEDCF8DF94;   // 0x2A9C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A9D[0x3];                                     // 0x2A9D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     时间轴; // 0x2AA0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Summon_Isdead;                                     // 0x2AA8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2AA9[0x7];                                     // 0x2AA9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHTAICharacter*                         Summon;                                            // 0x2AB0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   Summon_class;                                      // 0x2AB8(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(class Amon_13_2_BP_Child_C* NewParam)> Endbattle;                  // 0x2AE0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(class Amon_13_2_BP_Child_C* NewParam)> Start_Summon;               // 0x2AF0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          IsFig;                                             // 0x2B00(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Act02_Check();
	void AddSummon();
	void BPOnAICharacterDead();
	void BPOnLeaveBattleBegin();
	void BPOnLeaveBattleEnd();
	void ExecuteUbergraph_mon_13_2_BP_Child(int32 EntryPoint);
	void OnBeginBattle();
	void ReceiveBeginPlay();
	void SetSkill5();
	void SetSkill6();
	void SetSkill6_1();
	void Setskill6_LOC();
	void Summon_loc(struct FVector* Loc);
	void 时间轴_0__FinishedFunc();
	void 时间轴_0__UpdateFunc();
	void 时间轴__FinishedFunc();
	void 时间轴__UpdateFunc();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("mon_13_2_BP_Child_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"mon_13_2_BP_Child_C")
	}
	static class Amon_13_2_BP_Child_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<Amon_13_2_BP_Child_C>();
	}
};
DUMPER7_ASSERTS_Amon_13_2_BP_Child_C;

}

