#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: mon_13_BP_Child

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "mon_13_BP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass mon_13_BP_Child.mon_13_BP_Child_C
// 0x00C0 (0x2B40 - 0x2A80)
class Amon_13_BP_Child_C final : public Amon_13_BP_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_mon_13_BP_Child_C;                  // 0x2A80(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHTNiagaraComponent*                    HTNiagara1;                                        // 0x2A88(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHTNiagaraComponent*                    HTNiagara;                                         // 0x2A90(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         ____1_NewTrack_0_1111895E4B32823F08A8DFA668E5821D; // 0x2A98(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            ____1__Direction_1111895E4B32823F08A8DFA668E5821D; // 0x2A9C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A9D[0x3];                                     // 0x2A9D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     时间轴_1;                                       // 0x2AA0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         ____2______0_1BF8C7A84BD3739CA55D30A28DB4F981;     // 0x2AA8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            ____2__Direction_1BF8C7A84BD3739CA55D30A28DB4F981; // 0x2AAC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2AAD[0x3];                                     // 0x2AAD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     时间轴_2;                                       // 0x2AB0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         ____3______0_DAA54FA245BE52BF5F578AAA33C8C77A;     // 0x2AB8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            ____3__Direction_DAA54FA245BE52BF5F578AAA33C8C77A; // 0x2ABC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2ABD[0x3];                                     // 0x2ABD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     时间轴_3;                                       // 0x2AC0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         ____0______0_A9BDE37042D79C2BCD00ACB87D6B260D;     // 0x2AC8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            ____0__Direction_A9BDE37042D79C2BCD00ACB87D6B260D; // 0x2ACC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2ACD[0x3];                                     // 0x2ACD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     时间轴_0;                                       // 0x2AD0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         _________0_5344D9FF423FADA22F95A583BCE1A0B3;       // 0x2AD8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            _____Direction_5344D9FF423FADA22F95A583BCE1A0B3;   // 0x2ADC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2ADD[0x3];                                     // 0x2ADD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     时间轴; // 0x2AE0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Summon_Isdead;                                     // 0x2AE8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2AE9[0x7];                                     // 0x2AE9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHTAICharacter*                         Summon;                                            // 0x2AF0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   Summon_class;                                      // 0x2AF8(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(class Amon_13_BP_Child_C* NewParam)> Endbattle;                    // 0x2B20(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(class Amon_13_BP_Child_C* NewParam)> Start_Summon;                 // 0x2B30(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void Act02_Check();
	void AddSummon();
	void BPOnAICharacterDead();
	void BPOnLeaveBattleBegin();
	void BPOnLeaveBattleEnd();
	void ExecuteUbergraph_mon_13_BP_Child(int32 EntryPoint);
	void OnBeginBattle();
	void ReceiveBeginPlay();
	void SetSkill5();
	void SetSkill6();
	void SetSkill6_1();
	void Setskill6_LOC();
	void Skill3_cut();
	void Skill3_hit();
	void Summon_loc(struct FVector* Loc);
	void 时间轴_0__FinishedFunc();
	void 时间轴_0__UpdateFunc();
	void 时间轴_1__FinishedFunc();
	void 时间轴_1__UpdateFunc();
	void 时间轴_2__FinishedFunc();
	void 时间轴_2__UpdateFunc();
	void 时间轴_3__FinishedFunc();
	void 时间轴_3__UpdateFunc();
	void 时间轴__FinishedFunc();
	void 时间轴__UpdateFunc();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("mon_13_BP_Child_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"mon_13_BP_Child_C")
	}
	static class Amon_13_BP_Child_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<Amon_13_BP_Child_C>();
	}
};
DUMPER7_ASSERTS_Amon_13_BP_Child_C;

}

