#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: mon_14_BP_World_AnomalyDoor

#include "Basic.hpp"


namespace SDK::Params
{

// Function mon_14_BP_World_AnomalyDoor.mon_14_BP_World_AnomalyDoor_C.ExecuteUbergraph_mon_14_BP_World_AnomalyDoor
// 0x0020 (0x0020 - 0x0000)
struct mon_14_BP_World_AnomalyDoor_C_ExecuteUbergraph_mon_14_BP_World_AnomalyDoor final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_ActivateGameEffectsWithClassByActor_ReturnValue; // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHTAIController*                        K2Node_DynamicCast_AsHTAIController;               // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_mon_14_BP_World_AnomalyDoor_C_ExecuteUbergraph_mon_14_BP_World_AnomalyDoor;

}

