#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MonsterFootIK_AnimLayer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "MonsterFootIK_AnimLayer_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "HTGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass MonsterFootIK_AnimLayer.MonsterFootIK_AnimLayer_C
// 0x0FA0 (0x16C0 - 0x0720)
class UMonsterFootIK_AnimLayer_C final : public UHTFootIKAnimLayer
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0720(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct MonsterFootIK_AnimLayer::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;      // 0x0728(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_72A[0x6];                                      // 0x072A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0730(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0738(0x0008)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_6;                        // 0x0740(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_5;                        // 0x0868(0x0128)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0990(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_4;                        // 0x09B0(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_3;                        // 0x0AD8(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_2;                        // 0x0C00(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x0D28(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x0E50(0x0128)()
	uint8                                         Pad_F78[0x8];                                      // 0x0F78(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_TwoBoneIK                    AnimGraphNode_TwoBoneIK_1;                         // 0x0F80(0x0280)()
	struct FAnimNode_TwoBoneIK                    AnimGraphNode_TwoBoneIK;                           // 0x1200(0x0280)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x1480(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x14A8(0x0050)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x14F8(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x1578(0x0028)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x15A0(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x15C0(0x00B8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x1678(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x1698(0x0020)()

public:
	void FootIKLayer(const struct FPoseLink& InPose, struct FPoseLink* FootIKLayer_0);
	void ExecuteUbergraph_MonsterFootIK_AnimLayer(int32 EntryPoint);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_MonsterFootIK_AnimLayer_AnimGraphNode_BlendListByBool_E49A5D694B3B3BA6AF584E98EBF64BF7();
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("MonsterFootIK_AnimLayer_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MonsterFootIK_AnimLayer_C")
	}
	static class UMonsterFootIK_AnimLayer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMonsterFootIK_AnimLayer_C>();
	}
};
DUMPER7_ASSERTS_UMonsterFootIK_AnimLayer_C;

}

