#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NotMovingAnimLayerBase_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "NotMovingAnimLayerBase_BP_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "HTGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass NotMovingAnimLayerBase_BP.NotMovingAnimLayerBase_BP_C
// 0x0C60 (0x1400 - 0x07A0)
class UNotMovingAnimLayerBase_BP_C : public UHTNotMovingAnimLayer
{
public:
	uint8                                         Pad_798[0x8];                                      // 0x0798(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x07A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct NotMovingAnimLayerBase_BP::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;    // 0x07A8(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7AA[0x6];                                      // 0x07AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x07B0(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x07B8(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x07C0(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_9;                  // 0x07E0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_8;                  // 0x0808(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_7;                  // 0x0830(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6;                  // 0x0858(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5;                  // 0x0880(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4;                  // 0x08A8(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_6;                       // 0x08D0(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x08F0(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_5;                       // 0x0918(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_5;                    // 0x0938(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_4;                       // 0x0980(0x0020)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x09A0(0x0050)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4;                    // 0x09F0(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x0A38(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0x0A80(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_1;                      // 0x0AA0(0x00C8)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x0B68(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x0B90(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x0BB8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x0BE0(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x0C08(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x0C50(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x0C70(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x0CB8(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0CD8(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x0D20(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x0D40(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x0E08(0x0080)()
	uint8                                         Pad_E88[0x8];                                      // 0x0E88(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_Inertialization              AnimGraphNode_Inertialization;                     // 0x0E90(0x0550)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x13E0(0x0020)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void AnimNotify_RandomLeisureClear();
	void AnimNotify_RandomLeisureStart();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_NotMovingAnimLayerBase_BP_AnimGraphNode_TransitionResult_0ABC68D447B1585F57070FA0177A20AD();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_NotMovingAnimLayerBase_BP_AnimGraphNode_TransitionResult_25B702EA471563B17201148634127050();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_NotMovingAnimLayerBase_BP_AnimGraphNode_TransitionResult_43C629934C657AE23A91A482A27209AD();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_NotMovingAnimLayerBase_BP_AnimGraphNode_TransitionResult_70239CCD416AF1A1A7A6EFA80BE71EAE();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_NotMovingAnimLayerBase_BP_AnimGraphNode_TransitionResult_CB14F22541588A3E7AB173B4671ED52B();
	void ExecuteUbergraph_NotMovingAnimLayerBase_BP(int32 EntryPoint);
	void NotMoving(struct FPoseLink* NotMoving_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("NotMovingAnimLayerBase_BP_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NotMovingAnimLayerBase_BP_C")
	}
	static class UNotMovingAnimLayerBase_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNotMovingAnimLayerBase_BP_C>();
	}
};
DUMPER7_ASSERTS_UNotMovingAnimLayerBase_BP_C;

}

