#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PaperBag_AB

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "KawaiiPhysics_structs.hpp"
#include "HTGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass PaperBag_AB.PaperBag_AB_C
// 0x0910 (0x0D60 - 0x0450)
class UPaperBag_AB_C final : public UHTAttachedMeshAnimInstance
{
public:
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0450(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0458(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0460(0x0020)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics;                       // 0x0480(0x0850)(ContainsInstancedReference)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0CD0(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0CF0(0x0048)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0D38(0x0020)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("PaperBag_AB_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PaperBag_AB_C")
	}
	static class UPaperBag_AB_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPaperBag_AB_C>();
	}
};
DUMPER7_ASSERTS_UPaperBag_AB_C;

}

