#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PDA_FluxCoastlineState_0

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass PDA_FluxCoastlineState.PDA_FluxCoastlineState_C
// 0x0068 (0x0098 - 0x0030)
class PDA_FluxCoastlineState_0::UPDA_FluxCoastlineState_C final : public UPrimaryDataAsset
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0030(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FIntPoint                              WorldResolution;                                   // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        WorldPixelSize;                                    // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               WorldGroundMap;                                    // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                AreaLocation;                                      // 0x0050(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                AreaSize;                                          // 0x0068(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               WorldCoastlineMap;                                 // 0x0080(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CaptureOffset;                                     // 0x0088(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CoastWidth;                                        // 0x0090(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ApplyNiagaraData(class UNiagaraComponent* NiagaraSystem, bool UseGround);
	void ClearExternalReferences();
	void CopyPropertiesToObject(class UObject* Destination, bool* Done);
	void ExecuteUbergraph_PDA_FluxCoastlineState(int32 EntryPoint);
	void GetExternalReferences(TArray<class UTexture*>* Objects);
	void GetVolumeTransform(const struct FVector& ExtraSize, const struct FVector& Scale, double ZOffsetScale, struct FTransform* NewParam);
	void SetDomain(const struct FVector& Location, const struct FVector& Size, const struct FIntPoint& Resolution, double PixelSize, double CaptureOffset_0, double Width);
	void SetTextures(class UTexture* WorldCoastline, class UTexture* WorldGround);

	void ApplyMaterialData(TArray<class UMaterialInstanceDynamic*>& MaterialInstances) const;
	void GetPixelSize(struct FLinearColor* WorldToSimulationUV) const;
	void GetSurfaceHeight(double* SurfaceHeight) const;
	void GetTextureSize(struct FIntPoint* Resolution) const;
	void GetWorldToTextureUV(struct FLinearColor* WorldToTextureUV) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL_FULLNAME("BlueprintGeneratedClass PDA_FluxCoastlineState.PDA_FluxCoastlineState_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PDA_FluxCoastlineState_C")
	}
	static class PDA_FluxCoastlineState_0::UPDA_FluxCoastlineState_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<PDA_FluxCoastlineState_0::UPDA_FluxCoastlineState_C>();
	}
};
DUMPER7_ASSERTS_PDA_FluxCoastlineState_0__UPDA_FluxCoastlineState_C;

}

