#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Physics_AnimLayer_haniel_1_Mobile

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct Physics_AnimLayer_haniel_1_Mobile.Physics_AnimLayer_haniel_1_Mobile_C.AnimBlueprintGeneratedConstantData
// 0x03DF (0x03E0 - 0x0001)
struct Physics_AnimLayer_haniel_1_Mobile::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_46;                                 // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_47;                                 // 0x000C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_48;                                 // 0x0014(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_49;                                 // 0x001C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_50;                               // 0x0028(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0048(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x00C8(0x0040)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_1;                         // 0x0108(0x0030)()
	struct FAnimNodeExposedValueHandler           AnimGraphNode_LinkedInputPose;                     // 0x0138(0x0008)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace;          // 0x0140(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace;          // 0x0170(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_KawaiiPhysics_9;                // 0x01A0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_KawaiiPhysics_8;                // 0x01D0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_KawaiiPhysics_7;                // 0x0200(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_KawaiiPhysics_6;                // 0x0230(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_KawaiiPhysics_5;                // 0x0260(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_KawaiiPhysics_4;                // 0x0290(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_KawaiiPhysics_3;                // 0x02C0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_KawaiiPhysics_2;                // 0x02F0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_KawaiiPhysics_1;                // 0x0320(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_KawaiiPhysics;                  // 0x0350(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root;                           // 0x0380(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedAnimLayer;                // 0x03B0(0x0030)()
};
DUMPER7_ASSERTS_Physics_AnimLayer_haniel_1_Mobile__FAnimBlueprintGeneratedConstantData;

}

