#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Physics_AnimLayer_haniel_1_Mobile

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "KawaiiPhysics_structs.hpp"
#include "HTGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Physics_AnimLayer_haniel_1_Mobile.Physics_AnimLayer_haniel_1_Mobile_C
// 0x5560 (0x5A10 - 0x04B0)
class UPhysics_AnimLayer_haniel_1_Mobile_C final : public UHTPlayerPhysicsAnimLayer
{
public:
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x04B0(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x04B8(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x04C0(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x04E0(0x00B8)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0598(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x05B8(0x0020)()
	uint8                                         Pad_5D8[0x8];                                      // 0x05D8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_9;                     // 0x05E0(0x0850)(ContainsInstancedReference)
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_8;                     // 0x0E30(0x0850)(ContainsInstancedReference)
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_7;                     // 0x1680(0x0850)(ContainsInstancedReference)
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_6;                     // 0x1ED0(0x0850)(ContainsInstancedReference)
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_5;                     // 0x2720(0x0850)(ContainsInstancedReference)
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_4;                     // 0x2F70(0x0850)(ContainsInstancedReference)
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_3;                     // 0x37C0(0x0850)(ContainsInstancedReference)
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_2;                     // 0x4010(0x0850)(ContainsInstancedReference)
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_1;                     // 0x4860(0x0850)(ContainsInstancedReference)
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics;                       // 0x50B0(0x0850)(ContainsInstancedReference)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x5900(0x0020)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer;                     // 0x5920(0x00C8)()
	struct FKawaiiPhysicsSettings                 Physics_Settings_Hair;                             // 0x59E8(0x001C)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	void PhysicsAnimInterface(const struct FPoseLink& InPose, struct FPoseLink* PhysicsAnimInterface_0);
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Physics_AnimLayer_haniel_1_Mobile_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Physics_AnimLayer_haniel_1_Mobile_C")
	}
	static class UPhysics_AnimLayer_haniel_1_Mobile_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPhysics_AnimLayer_haniel_1_Mobile_C>();
	}
};
DUMPER7_ASSERTS_UPhysics_AnimLayer_haniel_1_Mobile_C;

}

