#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlasticBag_AB

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "KawaiiPhysics_structs.hpp"
#include "HTGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass PlasticBag_AB.PlasticBag_AB_C
// 0x0910 (0x0D60 - 0x0450)
class UPlasticBag_AB_C final : public UHTAttachedMeshAnimInstance
{
public:
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0450(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0458(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0460(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0480(0x0048)()
	uint8                                         Pad_4C8[0x8];                                      // 0x04C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics;                       // 0x04D0(0x0850)(ContainsInstancedReference)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0D20(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0D40(0x0020)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("PlasticBag_AB_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PlasticBag_AB_C")
	}
	static class UPlasticBag_AB_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlasticBag_AB_C>();
	}
};
DUMPER7_ASSERTS_UPlasticBag_AB_C;

}

