#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Player_056_bat

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_PlayerCharacterBase_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Player_056_bat.Player_056_bat_C
// 0x0090 (0x3620 - 0x3590)
class APlayer_056_bat_C final : public ABP_PlayerCharacterBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x3590(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHTNiagaraComponent*                    HTNiagara1;                                        // 0x3598(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHTNiagaraComponent*                    HTNiagara;                                         // 0x35A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USRStaticMeshComponent*                 SRStaticMesh1;                                     // 0x35A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCapsuleComponent*                      Capsule;                                           // 0x35B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         ____0______0_6E49335D4F1A2E102DCF93B11736E830;     // 0x35B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            ____0__Direction_6E49335D4F1A2E102DCF93B11736E830; // 0x35BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35BD[0x3];                                     // 0x35BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     时间轴_0;                                       // 0x35C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         _________0_A99085B04E005FAD5F3FD2A43D3555B5;       // 0x35C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            _____Direction_A99085B04E005FAD5F3FD2A43D3555B5;   // 0x35CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35CD[0x3];                                     // 0x35CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     时间轴; // 0x35D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               DynamicSpeedMat;                                   // 0x35D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UHTCameraSettingModifier*               AddSpeedCamera;                                    // 0x35E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class Aboss_18_BP_chase_C*                    BossActor;                                         // 0x35E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FName                                   NewVar;                                            // 0x35F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHTCameraSettingModifier*               LockCamera;                                        // 0x35F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           Sprint_sound;                                      // 0x3600(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           Run_sound;                                         // 0x3608(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Body_wind;                                         // 0x3610(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void ADD_Speed();
	void change_bat(bool bEnter);
	void ExecuteUbergraph_Player_056_bat(int32 EntryPoint);
	void Minus_Speed();
	void OnBlendOut_377022674E51729EF8C33FA03FA13B45(class FName NotifyName);
	void OnCompleted_377022674E51729EF8C33FA03FA13B45(class FName NotifyName);
	void OnInterrupted_377022674E51729EF8C33FA03FA13B45(class FName NotifyName);
	void OnNotifyBegin_377022674E51729EF8C33FA03FA13B45(class FName NotifyName);
	void OnNotifyEnd_377022674E51729EF8C33FA03FA13B45(class FName NotifyName);
	void ReceiveBeginPlay();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void Remove_Force_locked();
	void Remove_Volume();
	void Set_LockChase(class AHTAICharacter* NewParam);
	void 时间轴_0__FinishedFunc();
	void 时间轴_0__UpdateFunc();
	void 时间轴__FinishedFunc();
	void 时间轴__UpdateFunc();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Player_056_bat_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Player_056_bat_C")
	}
	static class APlayer_056_bat_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APlayer_056_bat_C>();
	}
};
DUMPER7_ASSERTS_APlayer_056_bat_C;

}

