#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PressButton_ControlRig

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "ControlRig_classes.hpp"


namespace SDK
{

// ControlRigBlueprintGeneratedClass PressButton_ControlRig.PressButton_ControlRig_C
// 0x0170 (0x0CE0 - 0x0B70)
class UPressButton_ControlRig_C final : public UControlRig
{
public:
	struct FTransform                             LockFootRTrans;                                    // 0x0B70(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             LockFootLTrans;                                    // 0x0BD0(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ButtonPosition;                                    // 0x0C30(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               ButtonRotator;                                     // 0x0C48(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        ButtonAlpha;                                       // 0x0C60(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C68[0x8];                                      // 0x0C68(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             PelvisTrans;                                       // 0x0C70(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        FingerDistToEnd;                                   // 0x0CD0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LockPelvisAndFoot;                                 // 0x0CD8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("PressButton_ControlRig_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PressButton_ControlRig_C")
	}
	static class UPressButton_ControlRig_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPressButton_ControlRig_C>();
	}
};
DUMPER7_ASSERTS_UPressButton_ControlRig_C;

}

