#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: takeoverquest_getincar

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HTGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass takeoverquest_getincar.takeoverquest_getincar_C
// 0x0050 (0x0BD0 - 0x0B80)
class Atakeoverquest_getincar_C final : public AHTVisualActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B80(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBillboardComponent*                    Billboard;                                         // 0x0B88(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box;                                               // 0x0B90(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class AHTQuestTriggerBox*                     Target;                                            // 0x0B98(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FName                                   PointID;                                           // 0x0BA0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   StartQuestID;                                      // 0x0BA8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHTVisualSpawnManager*                  HTVisualspawn;                                     // 0x0BB0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class AHTAISpawnManager*                      HTAISpawn;                                         // 0x0BB8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	bool                                          InMission;                                         // 0x0BC0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC1[0x7];                                      // 0x0BC1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 car;                                               // 0x0BC8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BPOnMainRoleLoadFinished(class AHTPlayerState* PlayerState);
	void ExecuteUbergraph_takeoverquest_getincar(int32 EntryPoint);
	void GetOnVehicle(const struct FVehicleInteractInfo& VehicleInfo);
	void OnFail_29B0CBB64849BD0EF35C6884593D10BC(class AHTVisualSpawnManager* Spawn);
	void OnSuccess_29B0CBB64849BD0EF35C6884593D10BC(class AHTVisualSpawnManager* Spawn);
	void PointInfoUpdate();
	void PointOrderArrive(class FName PointID_0);
	void questcomplete(const class FName& QuestId, const class FName& QuestObjectID, class AHTPlayerState* thePlayer);
	void RestoreOrder(class FName PointID_0);
	void UpdatePoint();
	void 自定义事件(class AActor* Actor);
	void 自定义事件_0();
	void 自定义事件_1(class FName PointID_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("takeoverquest_getincar_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"takeoverquest_getincar_C")
	}
	static class Atakeoverquest_getincar_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<Atakeoverquest_getincar_C>();
	}
};
DUMPER7_ASSERTS_Atakeoverquest_getincar_C;

}

