#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Vehicle018_BackKit_01

#include "Basic.hpp"


namespace SDK::Params
{

// Function Vehicle018_BackKit_01.Vehicle018_BackKit_01_C.ChangeSkinByID
// 0x0014 (0x0014 - 0x0000)
struct Vehicle018_BackKit_01_C_ChangeSkinByID final
{
public:
	class FName                                   VehicleID;                                         // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   SkinId;                                            // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         UseColor;                                          // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Vehicle018_BackKit_01_C_ChangeSkinByID;

// Function Vehicle018_BackKit_01.Vehicle018_BackKit_01_C.ExecuteUbergraph_Vehicle018_BackKit_01
// 0x001C (0x001C - 0x0000)
struct Vehicle018_BackKit_01_C_ExecuteUbergraph_Vehicle018_BackKit_01 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_VehicleID;                            // 0x0004(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_SkinID;                               // 0x000C(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_UseColor;                             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Vehicle018_BackKit_01_C_ExecuteUbergraph_Vehicle018_BackKit_01;

}

