#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VehicleAnimBP_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "VehicleAnimBP_Base_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "HTGame_structs.hpp"
#include "HTGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass VehicleAnimBP_Base.VehicleAnimBP_Base_C
// 0x1970 (0x2EA0 - 0x1530)
class UVehicleAnimBP_Base_C : public UHTVehicleAnimationInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1530(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct VehicleAnimBP_Base::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;           // 0x1538(0x0028)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x1560(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x1568(0x0008)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1;             // 0x1570(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_3;                        // 0x1590(0x0128)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_15;                 // 0x16B8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_14;                 // 0x16E0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_13;                 // 0x1708(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_12;                 // 0x1730(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_11;                 // 0x1758(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_10;                 // 0x1780(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_9;                  // 0x17A8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_8;                  // 0x17D0(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_6;                    // 0x17F8(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_8;                       // 0x1840(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_5;                    // 0x1860(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_7;                       // 0x18A8(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4;                    // 0x18C8(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_6;                       // 0x1910(0x0020)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_5;                       // 0x1930(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_1;                      // 0x1950(0x00C8)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_3;                          // 0x1A18(0x00F0)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_2;                          // 0x1B08(0x00F0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_3;                     // 0x1BF8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_7;                  // 0x1C20(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6;                  // 0x1C48(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5;                  // 0x1C70(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4;                  // 0x1C98(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x1CC0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x1CE8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x1D10(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x1D38(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x1D60(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_4;                       // 0x1DA8(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x1DC8(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0x1E10(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x1E30(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x1E78(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x1E98(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x1EE0(0x0020)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x1F00(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x1F20(0x00C8)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_2;                        // 0x1FE8(0x0128)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1;             // 0x2110(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x2130(0x0128)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x2258(0x0020)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_1;                          // 0x2278(0x00F0)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone;                            // 0x2368(0x00F0)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator;                   // 0x2458(0x0040)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_2;                    // 0x2498(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0x2518(0x0028)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x2540(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x2560(0x0028)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose;                        // 0x2588(0x0010)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace;            // 0x2598(0x0118)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1;                   // 0x26B0(0x0050)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve;                         // 0x2700(0x0120)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x2820(0x0128)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x2948(0x0050)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_3;                              // 0x2998(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x29E0(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_2;                              // 0x2A08(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1;                    // 0x2A50(0x0080)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1;                              // 0x2AD0(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x2B18(0x0048)()
	struct FHTAnimNode_StageCoachWheelController  AnimGraphNode_HTWheelController;                   // 0x2B60(0x0110)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x2C70(0x0020)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_1;                     // 0x2C90(0x00C8)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive;                       // 0x2D58(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x2E20(0x0080)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void AnimNotify_CloseDoor();
	void AnimNotify_OpenDoor();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_VehicleAnimBP_Base_AnimGraphNode_TransitionResult_25B9058E42713CB1153F78AF4E8A37DC();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_VehicleAnimBP_Base_AnimGraphNode_TransitionResult_577A822A478A6D3FAA8B129718CD99A9();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_VehicleAnimBP_Base_AnimGraphNode_TransitionResult_5BE2F4A44C136C84157922B111560381();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_VehicleAnimBP_Base_AnimGraphNode_TransitionResult_644BD5D74BF215C7F919D4AB3C1D66FC();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_VehicleAnimBP_Base_AnimGraphNode_TransitionResult_A8D7BD9A4E68261F7B0080968ACAC599();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_VehicleAnimBP_Base_AnimGraphNode_TransitionResult_D1B67E4044FC8453B95BCC8D09DCD480();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_VehicleAnimBP_Base_AnimGraphNode_TransitionResult_DA33E1D64E802F9B53C8889DDAAFD6CD();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_VehicleAnimBP_Base_AnimGraphNode_TransitionResult_F8B7F9284F6F0DA3CD516A87FD05A240();
	void ExecuteUbergraph_VehicleAnimBP_Base(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("VehicleAnimBP_Base_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"VehicleAnimBP_Base_C")
	}
	static class UVehicleAnimBP_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVehicleAnimBP_Base_C>();
	}
};
DUMPER7_ASSERTS_UVehicleAnimBP_Base_C;

}

