#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_SystematicGameFeatureButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HTGame_structs.hpp"
#include "HTGame_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_SystematicGameFeatureButton.WB_SystematicGameFeatureButton_C
// 0x0070 (0x1E70 - 0x1E00)
class UWB_SystematicGameFeatureButton_C final : public UHTUI_SystematicGameFeatureButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1E00(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UScaleBox*                              ScaleBox_0;                                        // 0x1E08(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImageSelected_Hovered_1;                           // 0x1E10(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImageSelected_Hovered;                             // 0x1E18(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Preview;                                     // 0x1E20(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHTUINavigationWidget_YH*               HTUINavigationWidget_YH_62;                        // 0x1E28(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanelLocked;                                 // 0x1E30(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Background_2;                                      // 0x1E38(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<struct FStaticGuideWidgetInfo>         In_Guide_Infos;                                    // 0x1E40(0x0010)(Edit, BlueprintVisible)
	TArray<class FString>                         Only_ru_de;                                        // 0x1E50(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FString                                 Only_es;                                           // 0x1E60(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void BndEvt__WB_SystematicGameFeatureButton_HTUINavigationWidget_YH_62_K2Node_ComponentBoundEvent_0_FocusEventDelegate__DelegateSignature();
	void BP_RefreshState();
	void Construct();
	void Destruct();
	void ExecuteUbergraph_WB_SystematicGameFeatureButton(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WB_SystematicGameFeatureButton_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WB_SystematicGameFeatureButton_C")
	}
	static class UWB_SystematicGameFeatureButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_SystematicGameFeatureButton_C>();
	}
};
DUMPER7_ASSERTS_UWB_SystematicGameFeatureButton_C;

}

